// coding: cp866
//---------------------------------------------------------------------------
#include <stdlib.h>
#include <stdio.h>
#include <io.h>
#include <dos.h>
#include <bios.h>
#include <conio.h>
#include <errno.h>
#include <time.h>
#include <string.h>
#include <process.h>
#include <signal.h>
#include <setjmp.h>
#include <float.h>
#include <mem.h>
#include <alloc.h>
#include <math.h>
#include <fcntl.h>
#include <ctype.h>
#include <sys\stat.h>
#include <dir.h>

//---------------------------------------------------------------------------
typedef unsigned        _u;
typedef unsigned char   uc;
typedef unsigned short  us;
typedef unsigned int    ui;
typedef unsigned long   ul;
typedef char            _c;
typedef short           _s;
typedef int             _i;
typedef long            _l;
typedef float           _f;
typedef double          db;
typedef void            vd;
typedef FILE            FL;
//
#define   ex            extern
// сравнения
#define   NO            0
#define   YES           1
#define   OFF           0
#define   ON            1
#define   ASIS          2
#define   STOP          3
#define   MANUAL        0
#define   AUTO          1
#define   KVIT          1
#define   NOKV          0
#define   SWITCH        5
#define   REQ           11
#define   OTHER         3
#define   AND           &&
#define   and           &&
#define   OR            ||
#define   or            ||
#define   THEN_         ?
#define   then_         ?
#define   ELSE_         :
#define   else_         :
// счетчики
#define   NOE           4         // за задан время счетч не стабилизировался
#define   NOS           3         // нестабильное состоян работающего счетчика
#define   END           2         // счетчик сработал (есть ожидаемый сигнал)
#define   RUN           1         // счетчик еще работает (идет счет времени)
#define   BAD           0         // за задан время счетч не сработ (нет сигн)
#define   STY           1         // счетчик "защелкивается" 
#define   STN           0         // счетчик работает постоянно
// время
#define   VAG           0         // идет взвешивание (аналог BAD для счетчика)
#define   SEC           1         // множитель секунд
#define   MIN           60        // множитель минут
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
#define  NVMAX          50
//  Максимальное кол-во переменных  для усреднения значений кол-во функций
//  AISet(), т.е.файктически это кол-во AI каналов
//---------------------------------------------------------------------------
#define  CVMAX          30
//  Максимальное кол-во ячеек для подсчета среднего значения на каждом
//  AI канале
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  ANALOG         0
#define  IMPULS         1
//  Тип счетчиков усреднения
//---------------------------------------------------------------------------
#define  MAXAV          30
//  Максимальное количество счетчиков усреднения AAverRun()
//---------------------------------------------------------------------------
#define  MAXAA         (MAXAV*2)
//  макс кол-во значений усреднений
#define  MAXCL          60                
//  макс кол-во ячеек в массивах усреднений
#define  SMNHOW         5
//  макс кол-во возможных смен
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
#define  MBS            20
#define  MBA            10
//  Размер буфера сообщений
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  MAXDBB         8000
#define  SIZDBB        32000    
//  Максимальное количество элементов массива обмена SIZDBB=MAXDBB*4
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  MAXSTRE        79
//  Максимальная длинна строки экрана
#define  STRLN          255 
//  Максимальная длинна строки в файлах
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  LCMD           20
//  Максимальная длинна посылаемой строки комманды
//---------------------------------------------------------------------------
#define  LANS           60
//  Максимальная длинна ответа
//---------------------------------------------------------------------------
#define  MCF            40
//  Максимальное количество записей модулей УСО
//---------------------------------------------------------------------------
#define  MVAL           14
//  Максимальное количество переменных в ответе от модуля
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//  Максимальное количество портов + 1
#define  MCOM           5
//---------------------------------------------------------------------------
#define  RBFSZ          512
//  Размер буфера чтения данных из COM порта
//---------------------------------------------------------------------------
#define  NOU            0
#define  USO            1
#define  WST            2
//  Признак назначения порта (для обмена с УСО или рабочей станцией (WST))
//---------------------------------------------------------------------------
#define  COM1     1
#define  COM2     2
#define  COM3     3
#define  COM4     4
//  Номера COM портов
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  MaxTT          20
//  Максимальное кол-во таймеров программы пользователя
#define  MAXCNTTO       500
//  Максимальное кол-во счетчиков таймаута
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  HFI            100
//  Количество элементов массива фильтрации DI сигналов
//---------------------------------------------------------------------------
#define  MDI            20
//  Количество ячеек фильтрации DI сигналов в одном элементе
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  LNAM           16
//  Количество символов в имени станции для NBW
//---------------------------------------------------------------------------
#define  HOWMAXWS       20
//  Максимальное кол-во станций для контроля получения установки данных
//---------------------------------------------------------------------------
#define  MNCB           8
//  Максимальное кол-во NCB
//---------------------------------------------------------------------------
#define  LNCB           504
//  Длинна посылаемого NCB в байтах
//---------------------------------------------------------------------------
#define  C250           250
#define  C124           124
#define  C080           80
#define  C020           20
#define  C002           2
//  Длинны массивов
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  NREGUL         20
//  Максимальное кол-во регуляторов в программе
//---------------------------------------------------------------------------
#define  RNA           -1
#define  RMINUS         0
#define  RSTOP          1
#define  RPLUS          2
//  Значения дискретного выхода регулятора
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  u5648count 5
//  Максимальное количество плат 5648
#define  BegC   0
#define  EndC   7
#define  BegA   8
#define  EndA  15
#define  BegB  16
#define  EndB  24
//  Определение номеров каналов для портов
#define  pA 0
#define  pB 1
#define  pC 2
//  Порядок портов Port A,B,C
//---------------------------------------------------------------------------
#define  u5700count 5
//  Максимальное количество плат 5700
//---------------------------------------------------------------------------
#define  u5750count 5
//  Максимальное количество плат 5750
//---------------------------------------------------------------------------
#define  TICKS_in_CYCLE    18
//  Количество тиков в цикле
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  MINCKVAL   -10000
#define  MAXCKVAL    9000000000
//  Минимал-Максимал значения проверки границ переменных
//---------------------------------------------------------------------------
#define  MNOCHECK    10
//  Количество переменных не подлежащих проверке
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define   VAGSLEN     30
// длинна ответа от модуля ВАГИ
//---------------------------------------------------------------------------
#define   MAXHC       50
// Максимальное количество хеш-кодов комманд для приборов OWEN
//---------------------------------------------------------------------------
