//---------------------------------------------------------------------------
// регулятор набора давления АК4

#include "..\prg\_libpath.inc"
#include "..\prg\run_prgv.h"
#include "..\prg\run_prgr.h"

#include "regul_e.h"

//  Текущий счетчик хода клапана (текущее логическое состояние)
_f  far  A4RPHKF__C = 0;
//  Текущий счетчик минимального хода клапана
_f  far  A4RPHKN__C = 0;
//  Текущий счетчик минимальной паузы между импульсами
_f  far  A4RPHKP__C = 0;
//  Предыдущий сигнал выхода на клапан
_f  far  A4RPUU1__P = 0;


//---------------------------------------------------------------------------
vd  far Regul_4p(vd){
    //-----------------------------------------------------------------------
    ui RN1=8;                        // Номер регулятора
    ui RN2=9;                        // Номер регулятора
    _f IL=0;                         // Входная шкала (нижняя граница)
    _f IH=8;                         // Входная шкала (верхняя граница)
    _f OL=0.000;                     // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                     // Выходная шкала (клапан),%, в.гр.
    _f DM=20.00;                     // Макс приращ вых регулятора
    _f ZN=A4RPKZN__R;                // Зона нечуствительности
    _f PR=20.00;                     // Процент рассогласования
    _f CC=20;                        // Контрольный цикл
    ui TP=1;                         // Тип регулятора
    _f DP=0;                         // Приведение к диапазону в %
    _f IN=0;                         // Входное значение
    _f CCMGK=-1;                     // Минимальный ход клапана
    ui AMAN=0;

    //-----------------------------------------------------------------------
    // для приведения входного парамметра к шкале 100% (закоментировать DP=1)
    // 20: верх диапазона; -20: низ диапазона
    DP=(IH-(IL))*0.01; 
    DP=1;
    IN=MDivF(AIF4P____V,DP);
    // проверка значения входного параметра регулятора
    if(IN<IL) IN=IL; if(IN>IH) IN=IH;
    //-----------------------------------------------------------------------
    if (A4RPRA___M!=A4RPRA___V){
        if(A4RPRA___M==SWITCH) A4RPRA___M=(A4RPRA___V>0) then_ OFF else_ AUTO;
        A4RPRA___V =A4RPRA___M;
        if(A4RPRA___V==AUTO){ 
           Message(122+A4BNM,0); A4RPUU1__M=RMINUS;
        } else { 
           Message(123+A4BNM,0); A4RPMO1__M=A4RPMO1__V=WO_Skip[RN1];  
           if(A4RPUU1__P==RPLUS ) A4RPUU1__M=RMINUS;
           if(A4RPUU1__P==RMINUS) A4RPUU1__M=RPLUS;
           AMAN=1;
        }
    }
    if (A4RPOUF1_M>OFF){
        A4RPOUF1_V=(A4RPOUF1_V>0) then_ OFF else_ ON; A4RPOUF1_M=OFF;
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (A4RPZD___M < IL ){ A4RPZD___M = IL; }
    if (A4RPZD___M > IH ){ A4RPZD___M = IH; }
    A4RPZD___V = A4RPZD___M;
    // выход на клапан ручного управления
    if (A4RPMO1__M < 0  ){ A4RPMO1__M =0;   }
    if (A4RPMO1__M > 100){ A4RPMO1__M =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    A4RPLO___V = A4RPLO___M;
    A4RPHO___V = A4RPHO___M;
    // ограничение выхода на приборы снизу и сверху
    A4RPLP___V = A4RPLP___M;
    A4RPHP___V = A4RPHP___M;
    // если определен полный ход клапана в секундах и мин ход клапана в %
    if(A4RPHKF__R>0  and  A4RPHKN__R>0){
       if(fabs(A4RPHKN__R)>20) A4RPHKN__R=20;
       // определить минимальный ход клапана в секундах
       CCMGK=fabs(A4RPHKF__R*0.01*A4RPHKN__R);
    }

    //-----------------------------------------------------------------------
    // если установлен флаг выполнения регуляторов (раз в секунду) и счетчик
    // минимального хода клапана больше заданного
//  if (RegRUN==ON and A4RPHKN__C>CCMGK){
    if (RegRUN==ON){
       //--------------------------------------------------------------------
       // обнулить счетчик минимального хода клапана
       A4RPHKN__C=0;
       //--------------------------------------------------------------------
       // аналоговый регулятор
       A4RPMO1__V=Regulator(RN1,IN,
                                A4RPKP___R, A4RPKI___R, 
                                A4RPKD___R, A4RPKM___R,
                                A4RPMO1__M, A4RPRA___V,
                                A4RPZD___V, A4RPZD___V,
                                IL, IH, OL, OH,
                                DM, ZN, PR, CC, TP
       );
       // ограничение выхода, %
       if (A4RPMO1__V <  OL+ A4RPLO___V){ A4RPMO1__V=OL+A4RPLO___V; }
       if (A4RPMO1__V >  OH- A4RPHO___V){ A4RPMO1__V=OH-A4RPHO___V; }
       if (A4RPKM___R >= 0){ A4RPOO___V=100-A4RPMO1__V; }
       else                { A4RPOO___V=A4RPMO1__V;     }
       //--------------------------------------------------------------------
       // дискретный регулятор
       // P01 - номер регулятора
       // P02 - коэффициент длинны импульса
       // P03 - коэффициент длинны паузы
       // P04 - коэффициент масштаба
       // P05 - режим работы регулятора (ручное-автомат)
       // P06 - выход ручного управления регулятора
       // RET - дискретный выход (RMINUS=0; RSTOP=1; RPLUS=2;)
       A4RPUU1__V=RegulDigit(RN1,A4RPKIML_R, A4RPKIMP_R, A4RPKM___R, 
                                 A4RPRA___V, A4RPUU1__M);
       AITEMP=(A4RPZD___V-AIP4P____V)*A4RPKP___R;
       //--------------------------------------------------------------------
       // если в ручном и включено управление с введенного значения
       if(A4RPRA___V==OFF and A4RPOUF1_V==ON and AMAN==0){
          OutX[RN2]=(A4RPMO1__M-AIS4PI___V)*(A4RPKP___R*0.02);
          A4RPUU1__V =RegulDigit(RN2, A4RPKIML_R, A4RPKIMP_R, A4RPKM___R,
                                      A4RPRA___V, 5);
          AITEMP=(A4RPMO1__V-AIS4PI___V) *A4RPKP___R;
       } 
       //--------------------------------------------------------------------
       // перевернуть сигнал, если коэффициент масштабирования отрицательный
       if(A4RPKM___R<0){
//        if(AITEMP>0){
             if(A4RPUU1__V==RPLUS){
                A4RPUU1__V=RMINUS;
             } else {
                if(A4RPUU1__V==RMINUS){ A4RPUU1__V=RPLUS; }
             }
//        } 
       }
       //--------------------------------------------------------------------
//     // сразу обратный сигнал(импульс) выдавать нельзя (только через останов)
//     if((A4RPUU1__V==RPLUS  and A4RPUU1__P==RMINUS)||
//        (A4RPUU1__V==RMINUS and A4RPUU1__P==RPLUS )){ A4RPUU1__V=RSTOP; }
//     //--------------------------------------------------------------------
       // если регулятор в ручном режиме или если в автомате, но на опред шаге-
       // установить выход на клапана в зависимости от выхода регулятора
       A4RPOUT__V=0;
       if((A4RPRA___V==OFF)||
          (A4RPRA___V==ON&&A4STEPW__V>440&&A4STEPW__V<445&&A4STEPW__V!=442)){
           if(A4RPUU1__V==RPLUS ){ O4KIPO___M=1; O4KIPO___V=1; O4KIPC___M=0; O4KIPC___V=0; }
           if(A4RPUU1__V==RMINUS){ O4KIPO___M=0; O4KIPO___V=0; O4KIPC___M=1; O4KIPC___V=1; }
           if(A4RPUU1__V==RSTOP ){ O4KIPO___M=0; O4KIPO___V=0; O4KIPC___M=0; O4KIPC___V=0; }
           A4RPOUT__V=1;
       }
       A4RPUU1__P= A4RPUU1__V;
       // сбросить ручной выход в неопределенное состояние
       A4RPUU1__M= RNA;
       // вывести значения работы регулятора оператору на экран
       if(A4RPRA___V>OFF){
          A4RPX1___V= OutO [RN1];
          A4RPCP1__V= ImpLC[RN1];
          A4RPCW1__V= ImpWC[RN1];
       } else {
          A4RPX1___V= OutO [RN2];
          A4RPCP1__V= ImpLC[RN2];
          A4RPCW1__V= ImpWC[RN2];
       }
    }
    //-----------------------------------------------------------------------
    // контроль импульсов регулятора и счетчиков
    // раз в секунду
    if (NewSEC==ON){
       // если  есть сигнал  на открытие или сигнал с концевика откр.положения
       if(A4RPUU1__V==RPLUS  or O4KIPO___V>0 or I4KIPO___V>0){
          // обновить текущие счетчики
          if(A4RPHKF__C<A4RPHKF__R) A4RPHKF__C++;  // полного открытия
          if(A4RPHKN__C<A4RPHKF__R) A4RPHKN__C++;  // мин хода исполнителя
       }
       // если  есть сигнал  на закрытие или сигнал с концевика закр.положения
       if(A4RPUU1__V==RMINUS or O4KIPC___V>0 or I4KIPC___V>0){
          // обновить текущие счетчики
          if(A4RPHKF__C>         0) A4RPHKF__C--;  // полного открытия
          if(A4RPHKN__C<A4RPHKF__R) A4RPHKN__C++;  // мин хода исполнителя
       }
       // если сработал концевик открытого положения- подогнать счетчик к
       // заданному значению
       if(I4KIPO___V>0){ A4RPHKF__C=A4RPHKF__R; }
       // если сработал концевик закрытого положения- сбросить счетчик на ноль
       if(I4KIPC___V>0){ A4RPHKF__C=0; }
    }
    //-----------------------------------------------------------------------
    // значения для тренда программы оператора:
    // аналоговый выход регулятора
    A4RPAOTR_V= A4RPMO1__V * 0.08;
    // положение клапана
    A4RPPKTR_V= AIS4PI___V * 0.08;
    // температура автоклава
    A4RPTATR_V= AIT4P____V * 0.04;

    return;
}
//---------------------------------------------------------------------------
