//----------------------------------------------------------------------------
//  Получить значения с аналоговых модулей (i7017,i7033)
vd  far InpDataS(vd){
    _i  rec=0;

    #include "mod\ai\c2n30r00.c"
    #include "mod\ai\c2n38r08.c"
    #include "mod\ai\c2n39r09.c"
    #include "mod\ai\c2n3Ar10.c"
    #include "mod\ai\c2n49r19.c"

    return;
}
//----------------------------------------------------------------------------


//----------------------------------------------------------------------------
//  Получить значения с других аналоговых модулей
vd  far InpDataA(vd){

    return;
}
//----------------------------------------------------------------------------
