#define  SystemC3_V  DBB[  51]   // PCCS3: AUTH CODE
#define  SystemD3_V  DBB[  52]   // PCCS3: AUTH DATA
#define  CurMESS3_V  DBB[  53]   // PCCS3: Номер текущего сообщения
#define  DateCMP3_V  DBB[  54]   // PCCS3: Дата  компиляции программы
#define  TimeCMP3_V  DBB[  55]   // PCCS3: Время компиляции программы
#define  NetLive3_V  DBB[  56]   // PCCS3: Состояние сети
#define  TickLP3__V  DBB[  57]   // PCCS3: Количество пустых циклов за тик
#define  SecnLP3__V  DBB[  58]   // PCCS3: Количество пустых циклов за секунду
#define  ALARM3___V  DBB[  59]   // PCCS3: Флаг вывода сообщений
#define  ALARM3___M  DBB[  60]   // PCCS3: Флаг вывода сообщений
#define  ErrBell3_V  DBB[  61]   // PCCS3: Флаг ошибки программы
#define  ErrBell3_M  DBB[  62]   // PCCS3: Снятие сигнала ошибки программы
#define  WriteDT3_M  DBB[  63]   // PCCS3: Флаг записи данных программы
#define  ExitFLG3_M  DBB[  64]   // PCCS3: Флаг выхода из программы
#define  DebugFL3_V  DBB[  65]   // PCCS3: Режим отладки
#define  SCNT3____V  DBB[  66]   // PCCS3: Секунды работы
#define  HCNT3____V  DBB[  67]   // PCCS3: Часы работы
#define  CPLive3__M  DBB[  68]   // PCCS3: Флаг работы сети COM порта
#define  CPLive3__V  DBB[  69]   // PCCS3: Флаг работы сети COM порта
#define  NBLive3__M  DBB[  70]   // PCCS3: Флаг работы сети NetBIOS
#define  NBLive3__V  DBB[  71]   // PCCS3: Флаг работы сети NetBIOS
#define  CPLiveT3_V  DBB[  72]   // PCCS3: Таймаут работы сети по COM порту
#define  NBLiveT3_V  DBB[  73]   // PCCS3: Таймаут работы сети по NetBIOS
#define  TimeCSS3_M  DBB[  74]   // PCCS3: Время: секунды
#define  TimeCSS3_V  DBB[  75]   // PCCS3: Время: секунды
#define  TimeCSM3_M  DBB[  76]   // PCCS3: Время: минуты
#define  TimeCSM3_V  DBB[  77]   // PCCS3: Время: минуты
#define  TimeCSH3_M  DBB[  78]   // PCCS3: Время: часы
#define  TimeCSH3_V  DBB[  79]   // PCCS3: Время: часы
#define  DateCSD3_M  DBB[  80]   // PCCS3: Дата: день
#define  DateCSD3_V  DBB[  81]   // PCCS3: Дата: день
#define  DateCSM3_M  DBB[  82]   // PCCS3: Дата: месяц
#define  DateCSM3_V  DBB[  83]   // PCCS3: Дата: месяц
#define  DateCSY3_M  DBB[  84]   // PCCS3: Дата: год
#define  DateCSY3_V  DBB[  85]   // PCCS3: Дата: год
#define  TMDTSet3_M  DBB[  86]   // PCCS3: Флаг установки времени и даты
#define  DAWC3  DBB[  87]   // PCCS3: Текущий день недели
#define  PCCS3T21_V  DBB[  88]   // PCCS3: Счетчик таймаута посылок PCCS21
#define  PCCS3T25_V  DBB[  89]   // PCCS3: Счетчик таймаута посылок PCCS25
#define  D03ValN1_M  DBB[ 161]   // PCCS3: Номер вводимой переменной 1
#define  D03ValN1_V  DBB[ 162]   // PCCS3: Номер вводимой переменной 1
#define  D03ValZ1_M  DBB[ 163]   // PCCS3: Значение вводимой переменной 1
#define  D03ValZ1_V  DBB[ 164]   // PCCS3: Значение вводимой переменной 1
#define  D03ValZS1V  DBB[ 165]   // PCCS3: Запомненное значен предыдущ переменной 1
#define  D03ValN2_M  DBB[ 166]   // PCCS3: Номер вводимой переменной 2
#define  D03ValN2_V  DBB[ 167]   // PCCS3: Номер вводимой переменной 2
#define  D03ValZ2_M  DBB[ 168]   // PCCS3: Значение вводимой переменной 2
#define  D03ValZ2_V  DBB[ 169]   // PCCS3: Значение вводимой переменной 2
#define  D03ValZS2V  DBB[ 170]   // PCCS3: Запомненное значен предыдущ переменной 2
#define  D03ValN3_M  DBB[ 171]   // PCCS3: Номер вводимой переменной 3
#define  D03ValN3_V  DBB[ 172]   // PCCS3: Номер вводимой переменной 3
#define  D03ValZ3_M  DBB[ 173]   // PCCS3: Значение вводимой переменной 3
#define  D03ValZ3_V  DBB[ 174]   // PCCS3: Значение вводимой переменной 3
#define  D03ValZS3V  DBB[ 175]   // PCCS3: Запомненное значен предыдущ переменной 3
#define  D03ValN4_M  DBB[ 176]   // PCCS3: Номер вводимой переменной 4
#define  D03ValN4_V  DBB[ 177]   // PCCS3: Номер вводимой переменной 4
#define  D03ValZ4_M  DBB[ 178]   // PCCS3: Значение вводимой переменной 4
#define  D03ValZ4_V  DBB[ 179]   // PCCS3: Значение вводимой переменной 4
#define  D03ValZS4V  DBB[ 180]   // PCCS3: Запомненное значен предыдущ переменной 4
#define  COM1HSMD_M  DBB[ 230]   // PCCS3: Количество секунд для подсчета состояния модулей
#define  COM1HSMD_V  DBB[ 231]   // PCCS3: Количество секунд для подсчета состояния модулей
#define  COM2HSMD_M  DBB[ 232]   // PCCS3: Количество секунд для подсчета состояния модулей
#define  COM2HSMD_V  DBB[ 233]   // PCCS3: Количество секунд для подсчета состояния модулей
#define  COM2OK30_V  DBB[ 330]   // Количество правильных ответов модуля N30
#define  COM2OK31_V  DBB[ 331]   // Количество правильных ответов модуля N31
#define  COM2OK32_V  DBB[ 332]   // Количество правильных ответов модуля N32
#define  COM2OK33_V  DBB[ 333]   // Количество правильных ответов модуля N33
#define  COM2OK34_V  DBB[ 334]   // Количество правильных ответов модуля N34
#define  COM2OK35_V  DBB[ 335]   // Количество правильных ответов модуля N35
#define  COM2OK36_V  DBB[ 336]   // Количество правильных ответов модуля N36
#define  COM2OK37_V  DBB[ 337]   // Количество правильных ответов модуля N37
#define  COM2OK38_V  DBB[ 338]   // Количество правильных ответов модуля N38
#define  COM2OK39_V  DBB[ 339]   // Количество правильных ответов модуля N39
#define  COM2OK3A_V  DBB[ 340]   // Количество правильных ответов модуля N3A
#define  COM2OK41_V  DBB[ 341]   // Количество правильных ответов модуля N41
#define  COM2OK42_V  DBB[ 342]   // Количество правильных ответов модуля N42
#define  COM2OK43_V  DBB[ 343]   // Количество правильных ответов модуля N43
#define  COM2OK44_V  DBB[ 344]   // Количество правильных ответов модуля N44
#define  COM2OK45_V  DBB[ 345]   // Количество правильных ответов модуля N45
#define  COM2OK46_V  DBB[ 346]   // Количество правильных ответов модуля N46
#define  COM2OK47_V  DBB[ 347]   // Количество правильных ответов модуля N47
#define  COM2OK48_V  DBB[ 348]   // Количество правильных ответов модуля N48
#define  COM2OK49_V  DBB[ 349]   // Количество правильных ответов модуля N49
#define  COM2ER30_V  DBB[ 430]   // Количество ошибочных ответов модуля N30
#define  COM2ER31_V  DBB[ 431]   // Количество ошибочных ответов модуля N31
#define  COM2ER32_V  DBB[ 432]   // Количество ошибочных ответов модуля N32
#define  COM2ER33_V  DBB[ 433]   // Количество ошибочных ответов модуля N33
#define  COM2ER34_V  DBB[ 434]   // Количество ошибочных ответов модуля N34
#define  COM2ER35_V  DBB[ 435]   // Количество ошибочных ответов модуля N35
#define  COM2ER36_V  DBB[ 436]   // Количество ошибочных ответов модуля N36
#define  COM2ER37_V  DBB[ 437]   // Количество ошибочных ответов модуля N37
#define  COM2ER38_V  DBB[ 438]   // Количество ошибочных ответов модуля N38
#define  COM2ER39_V  DBB[ 439]   // Количество ошибочных ответов модуля N39
#define  COM2ER3A_V  DBB[ 440]   // Количество ошибочных ответов модуля N3A
#define  COM2ER41_V  DBB[ 441]   // Количество ошибочных ответов модуля N41
#define  COM2ER42_V  DBB[ 442]   // Количество ошибочных ответов модуля N42
#define  COM2ER43_V  DBB[ 443]   // Количество ошибочных ответов модуля N43
#define  COM2ER44_V  DBB[ 444]   // Количество ошибочных ответов модуля N44
#define  COM2ER45_V  DBB[ 445]   // Количество ошибочных ответов модуля N45
#define  COM2ER46_V  DBB[ 446]   // Количество ошибочных ответов модуля N46
#define  COM2ER47_V  DBB[ 447]   // Количество ошибочных ответов модуля N47
#define  COM2ER48_V  DBB[ 448]   // Количество ошибочных ответов модуля N48
#define  COM2ER49_V  DBB[ 449]   // Количество ошибочных ответов модуля N49
#define  AIF3P____V  DBB[ 740]   // A3   Расход пара автоклава
#define  AIF4P____V  DBB[ 741]   // A4   Расход пара автоклава
#define  AIL3C____V  DBB[ 742]   // A3   Уровень конденсата автоклава
#define  AIL4C____V  DBB[ 743]   // A4   Уровень конденсата автоклава
#define  AIP3P____V  DBB[ 744]   // A3   Давление пара автоклава
#define  AIP4P____V  DBB[ 745]   // A4   Давление пара автоклава
#define  AIP34V___V  DBB[ 746]   // A34  Разрежение автоклава
#define  AIP34M___V  DBB[ 747]   // A34  Давление в магистрали
#define  I3ZIOPO__V  DBB[ 748]   // A3   Задвижка впуска острого пара ОТКРЫТА
#define  I3ZIOPC__V  DBB[ 749]   // A3   Задвижка впуска острого пара ЗАКРЫТА
#define  I3ZIPPO__V  DBB[ 750]   // A3   Задвижка впуска перепускного пара ОТКРЫТА
#define  I3ZIPPC__V  DBB[ 751]   // A3   Задвижка впуска перепускного пара ЗАКРЫТА
#define  I3KIPO___V  DBB[ 752]   // A3   Клапан впуска пара ОТКРЫТ
#define  I3KIPC___V  DBB[ 753]   // A3   Клапан впуска пара ЗАКРЫТ
#define  I3ZOPPO__V  DBB[ 754]   // A3   Задвижка выпуска перепускного пара ОТКРЫТА
#define  I3ZOPPC__V  DBB[ 755]   // A3   Задвижка выпуска перепускного пара ЗАКРЫТА
#define  I3ZOPAO__V  DBB[ 756]   // A3   Задвижка выпуска пара в атмосферу ОТКРЫТА
#define  I3ZOPAC__V  DBB[ 757]   // A3   Задвижка выпуска пара в атмосферу ЗАКРЫТА
#define  I3KOPO___V  DBB[ 758]   // A3   Клапан выпуска пара ОТКРЫТ
#define  I3KOPC___V  DBB[ 759]   // A3   Клапан выпуска пара ЗАКРЫТ
#define  I3MU_____V  DBB[ 760]   // A3   Местное управление
#define  I3DU_____V  DBB[ 761]   // A3   Дистанционное управление
#define  I3VAC____V  DBB[ 762]   // A3   Наличие напряжения на щите
#define  I3VZO____V  DBB[ 763]   // A3   Вакуумная задвижка ОТКРЫТА
#define  I3VZC____V  DBB[ 764]   // A3   Вакуумная задвижка ЗАКРЫТА
#define  I3VZOE___V  DBB[ 765]   // A3   Ошибка открытия вакуумной задвижки
#define  I3VZCE___V  DBB[ 766]   // A3   Ошибка закрытия вакуумной задвижки
#define  I3VN_1___V  DBB[ 767]   // A3   Вакуумный насос ВКЛЮЧЕН
#define  I3MAXV___V  DBB[ 768]   // A3   Достигнуто максимальное разрежение
#define  I3VZMD___V  DBB[ 769]   // A3   Вакуумная задвижка М/Д
#define  I3VNMD___V  DBB[ 770]   // A3   Вакуумный насос ЩТ/ПК
#define  I3VACU___V  DBB[ 771]   // A3   Наличие напряжения на уст-ва управления
#define  I3BOFF___V  DBB[ 772]   // A3   Кнопка выключения звонка
#define  N32C10___V  DBB[ 773]   // Резерв N32C10
#define  N32C12___V  DBB[ 774]   // Резерв N32C12
#define  N32C13___V  DBB[ 775]   // Резерв N32C13
#define  O3ZIOPO__V  DBB[ 776]   // A3   Задвижку впуска острого пара ОТКРЫТЬ
#define  O3ZIOPC__V  DBB[ 777]   // A3   Задвижку впуска острого пара ЗАКРЫТЬ
#define  O3ZIPPO__V  DBB[ 778]   // A3   Задвижку впуска перепускного пара ОТКРЫТЬ
#define  O3ZIPPC__V  DBB[ 779]   // A3   Задвижку впуска перепускного пара ЗАКРЫТЬ
#define  O3KIPO___V  DBB[ 780]   // A3   Клапан впуска пара ОТКРЫТЬ
#define  O3KIPC___V  DBB[ 781]   // A3   Клапан впуска пара ЗАКРЫТЬ
#define  O3ZOPPO__V  DBB[ 782]   // A3   Задвижку выпуска перепускного пара ОТКРЫТЬ
#define  O3ZOPPC__V  DBB[ 783]   // A3   Задвижку выпуска перепускного пара ЗАКРЫТЬ
#define  O3ZOPAO__V  DBB[ 784]   // A3   Задвижку выпуска пара в атмосферу ОТКРЫТЬ
#define  O3ZOPAC__V  DBB[ 785]   // A3   Задвижку выпуска пара в атмосферу ЗАКРЫТЬ
#define  O3KOPO___V  DBB[ 786]   // A3   Клапан выпуска пара ОТКРЫТЬ
#define  O3KOPC___V  DBB[ 787]   // A3   Клапан выпуска пара ЗАКРЫТЬ
#define  O3BELL___V  DBB[ 788]   // A3   ЗВОНОК
#define  O3KOCO___V  DBB[ 789]   // A3   Клапан сброса конденсата ОТКРЫТЬ
#define  O3KOCC___V  DBB[ 790]   // A3   Клапан сброса конденсата ЗАКРЫТЬ
#define  O3VZO____V  DBB[ 791]   // A3   Вакуумную задвижку ОТКРЫТЬ
#define  O3VZC____V  DBB[ 792]   // A3   Вакуумную задвижку ЗАКРЫТЬ
#define  O3AZVO___V  DBB[ 793]   // A3   Атмосферную задвижку на вак магистрали ОТКРЫТЬ
#define  O3VN_1___V  DBB[ 794]   // A3   Вакуумный насос ВКЛЮЧИТЬ
#define  N34C06___V  DBB[ 795]   // Резерв N34C06
#define  N34C07___V  DBB[ 796]   // Резерв N34C07
#define  N34C08___V  DBB[ 797]   // Резерв N34C08
#define  N34C09___V  DBB[ 798]   // Резерв N34C09
#define  N34C10___V  DBB[ 799]   // Резерв N34C10
#define  N34C11___V  DBB[ 800]   // Резерв N34C11
#define  PCCS3WR__V  DBB[ 801]   // A3   Флаг работы контроллера
#define  I3VACKR__V  DBB[ 802]   // A3   Наличие напряжения на управлении крышкой
#define  I3GNS_1__V  DBB[ 803]   // A3   Гидронасос ВКЛЮЧЕН
#define  I3LUCMU__V  DBB[ 804]   // A3   Крышка в местном режиме
#define  I3LUCDU__V  DBB[ 805]   // A3   Крышка дистанционном режиме
#define  I3KOCO___V  DBB[ 806]   // A3   Клапан сброса конденсата ОТКРЫТ
#define  I3KOCC___V  DBB[ 807]   // A3   Клапан сброса конденсата ЗАКРЫТ
#define  I3GNS1B__V  DBB[ 808]   // A3   Кнопка гидронасос ВКЛЮЧИТЬ
#define  I3GNS0B__V  DBB[ 809]   // A3   Кнопка гидронасос ВЫКЛЮЧИТЬ
#define  I3GNST___V  DBB[ 810]   // A3   Кнопка гидронасос НАЛАДКА
#define  N35C04___V  DBB[ 811]   // Резерв N35C04
#define  N35C05___V  DBB[ 812]   // Резерв N35C05
#define  N35C11___V  DBB[ 813]   // Резерв N35C11
#define  N35C12___V  DBB[ 814]   // Резерв N35C12
#define  N35C13___V  DBB[ 815]   // Резерв N35C13
#define  O3GNS____V  DBB[ 816]   // A3   Управление гидронасосом
#define  O3HM1UP__V  DBB[ 817]   // A3   Хомут1 ПОДНЯТЬ
#define  O3HM1DN__V  DBB[ 818]   // A3   Хомут1 ОПУСТИТЬ
#define  O3KR1O___V  DBB[ 819]   // A3   Крышка1 ОТКРЫТЬ
#define  O3KR1C___V  DBB[ 820]   // A3   Крышка1 ЗАКРЫТЬ
#define  O3BY1O___V  DBB[ 821]   // A3   Байонет1 ОТКРЫТЬ
#define  O3BY1C___V  DBB[ 822]   // A3   Байонет1 ЗАКРЫТЬ
#define  O3HM2UP__V  DBB[ 823]   // A3   Хомут2 ПОДНЯТЬ
#define  O3HM2DN__V  DBB[ 824]   // A3   Хомут2 ОПУСТИТЬ
#define  O3KR2O___V  DBB[ 825]   // A3   Крышка2 ОТКРЫТЬ
#define  O3KR2C___V  DBB[ 826]   // A3   Крышка2 ЗАКРЫТЬ
#define  O3BY2O___V  DBB[ 827]   // A3   Байонет2 ОТКРЫТЬ
#define  O3BY2C___V  DBB[ 828]   // A3   Байонет2 ЗАКРЫТЬ
#define  I3HM1UP__V  DBB[ 829]   // A3   Хомут1 ПОДНЯТ
#define  I3HM1DN__V  DBB[ 830]   // A3   Хомут1 ОПУЩЕН
#define  I3KR1O___V  DBB[ 831]   // A3   Крышка1 ОТКРЫТА
#define  I3KR1C___V  DBB[ 832]   // A3   Крышка1 ЗАКРЫТА
#define  I3BY1O___V  DBB[ 833]   // A3   Байонет1 ОТКРЫТ
#define  I3BY1C___V  DBB[ 834]   // A3   Байонет1 ЗАКРЫТ
#define  I3P1_Y___V  DBB[ 835]   // A3   Давление1 ЕСТЬ
#define  I3P1_N___V  DBB[ 836]   // A3   Давление1 НЕТ
#define  I3SBP1Z__V  DBB[ 837]   // A3   СБП1 ЗАБЛОКИРОВАН
#define  I3SBP1R__V  DBB[ 838]   // A3   СБП1 РАЗБЛОКИРОВАН
#define  I3BY1Z___V  DBB[ 839]   // A3   Байонет1 ЗАБЛОКИРОВАН
#define  I3KR1SB__V  DBB[ 840]   // A3   Кнопка крышка1 СТОП
#define  I3KR1OB__V  DBB[ 841]   // A3   Кнопка крышка1 ОТКРЫТЬ
#define  I3KR1CB__V  DBB[ 842]   // A3   Кнопка крышка1 ЗАКРЫТЬ
#define  AITPO____V  DBB[ 843]   // Температура острого пара
#define  AIFPO____V  DBB[ 844]   // Расход острого пара
#define  N38C02___V  DBB[ 845]   // Резерв N38C02
#define  N38C03___V  DBB[ 846]   // Резерв N38C03
#define  N38C04___V  DBB[ 847]   // Резерв N38C04
#define  N38C05___V  DBB[ 848]   // Резерв N38C05
#define  N38C06___V  DBB[ 849]   // Резерв N38C06
#define  N38C07___V  DBB[ 850]   // Резерв N38C07
#define  AIT3TOP__V  DBB[ 857]   // A3   Температура вверху автоклава
#define  AIT3BOT__V  DBB[ 858]   // A3   Температура внизу автоклава
#define  AIT3P____V  DBB[ 859]   // A3   Температура пара автоклава
#define  AIS3PI___V  DBB[ 860]   // A3   Положение клапана впуска пара
#define  AIS3PO___V  DBB[ 861]   // A3   Положение клапана выпуска пара
#define  AIS3CO___V  DBB[ 862]   // A3   Положение клапана сброса конденсата
#define  AIS4PI___V  DBB[ 863]   // A4   Положение клапана впуска пара
#define  AIS4PO___V  DBB[ 864]   // A4   Положение клапана выпуска пара
#define  AIS4CO___V  DBB[ 865]   // A4   Положение клапана сброса конденсата
#define  N3AC06___V  DBB[ 866]   // Резерв N3AC06
#define  N3AC07___V  DBB[ 867]   // Резерв N3AC07
#define  I4ZIOPO__V  DBB[ 868]   // A4   Задвижка впуска острого пара ОТКРЫТА
#define  I4ZIOPC__V  DBB[ 869]   // A4   Задвижка впуска острого пара ЗАКРЫТА
#define  I4ZIPPO__V  DBB[ 870]   // A4   Задвижка впуска перепускного пара ОТКРЫТА
#define  I4ZIPPC__V  DBB[ 871]   // A4   Задвижка впуска перепускного пара ЗАКРЫТА
#define  I4KIPO___V  DBB[ 872]   // A4   Клапан впуска пара ОТКРЫТ
#define  I4KIPC___V  DBB[ 873]   // A4   Клапан впуска пара ЗАКРЫТ
#define  I4ZOPPO__V  DBB[ 874]   // A4   Задвижка выпуска перепускного пара ОТКРЫТА
#define  I4ZOPPC__V  DBB[ 875]   // A4   Задвижка выпуска перепускного пара ЗАКРЫТА
#define  I4ZOPAO__V  DBB[ 876]   // A4   Задвижка выпуска пара в атмосферу ОТКРЫТА
#define  I4ZOPAC__V  DBB[ 877]   // A4   Задвижка выпуска пара в атмосферу ЗАКРЫТА
#define  I4KOPO___V  DBB[ 878]   // A4   Клапан выпуска пара ОТКРЫТ
#define  I4KOPC___V  DBB[ 879]   // A4   Клапан выпуска пара ЗАКРЫТ
#define  I4MU_____V  DBB[ 880]   // A4   Местное управление
#define  I4DU_____V  DBB[ 881]   // A4   Дистанционное управление
#define  I4VAC____V  DBB[ 882]   // A4   Наличие напряжения на щите
#define  I4VZO____V  DBB[ 883]   // A4   Вакуумная задвижка ОТКРЫТА
#define  I4VZC____V  DBB[ 884]   // A4   Вакуумная задвижка ЗАКРЫТА
#define  I4VZOE___V  DBB[ 885]   // A4   Ошибка открытия вакуумной задвижки
#define  I4VZCE___V  DBB[ 886]   // A4   Ошибка закрытия вакуумной задвижки
#define  I4VN_1___V  DBB[ 887]   // A4   Вакуумный насос ВКЛЮЧЕН
#define  I4MAXV___V  DBB[ 888]   // A4   Достигнуто максимальное разрежение
#define  I4VZMD___V  DBB[ 889]   // A4   Вакуумная задвижка М/Д
#define  I4VNMD___V  DBB[ 890]   // A4   Вакуумный насос ЩТ/ПК
#define  I4VACU___V  DBB[ 891]   // A4   Наличие напряжения на уст-ва управления
#define  I4BOFF___V  DBB[ 892]   // A4   Кнопка выключения звонка
#define  N42C10___V  DBB[ 893]   // Резерв N42C10
#define  N42C12___V  DBB[ 894]   // Резерв N42C12
#define  N42C13___V  DBB[ 895]   // Резерв N42C13
#define  O4ZIOPO__V  DBB[ 896]   // A4   Задвижку впуска острого пара ОТКРЫТЬ
#define  O4ZIOPC__V  DBB[ 897]   // A4   Задвижку впуска острого пара ЗАКРЫТЬ
#define  O4ZIPPO__V  DBB[ 898]   // A4   Задвижку впуска перепускного пара ОТКРЫТЬ
#define  O4ZIPPC__V  DBB[ 899]   // A4   Задвижку впуска перепускного пара ЗАКРЫТЬ
#define  O4KIPO___V  DBB[ 900]   // A4   Клапан впуска пара ОТКРЫТЬ
#define  O4KIPC___V  DBB[ 901]   // A4   Клапан впуска пара ЗАКРЫТЬ
#define  O4ZOPPO__V  DBB[ 902]   // A4   Задвижку выпуска перепускного пара ОТКРЫТЬ
#define  O4ZOPPC__V  DBB[ 903]   // A4   Задвижку выпуска перепускного пара ЗАКРЫТЬ
#define  O4ZOPAO__V  DBB[ 904]   // A4   Задвижку выпуска пара в атмосферу ОТКРЫТЬ
#define  O4ZOPAC__V  DBB[ 905]   // A4   Задвижку выпуска пара в атмосферу ЗАКРЫТЬ
#define  O4KOPO___V  DBB[ 906]   // A4   Клапан выпуска пара ОТКРЫТЬ
#define  O4KOPC___V  DBB[ 907]   // A4   Клапан выпуска пара ЗАКРЫТЬ
#define  O4BELL___V  DBB[ 908]   // A4   ЗВОНОК
#define  O4KOCO___V  DBB[ 909]   // A4   Клапан сброса конденсата ОТКРЫТЬ
#define  O4KOCC___V  DBB[ 910]   // A4   Клапан сброса конденсата ЗАКРЫТЬ
#define  O4VZO____V  DBB[ 911]   // A4   Вакуумную задвижку ОТКРЫТЬ
#define  O4VZC____V  DBB[ 912]   // A4   Вакуумную задвижку ЗАКРЫТЬ
#define  O4AZVO___V  DBB[ 913]   // A4   Атмосферную задвижку на вак магистрали ОТКРЫТЬ
#define  O4VN_1___V  DBB[ 914]   // A4   Вакуумный насос ВКЛЮЧИТЬ
#define  N44C06___V  DBB[ 915]   // Резерв N44C06
#define  N44C07___V  DBB[ 916]   // Резерв N44C07
#define  N44C08___V  DBB[ 917]   // Резерв N44C08
#define  N44C09___V  DBB[ 918]   // Резерв N44C09
#define  N44C10___V  DBB[ 919]   // Резерв N44C10
#define  N44C11___V  DBB[ 920]   // Резерв N44C11
#define  PCCS4WR__V  DBB[ 921]   // A4   Флаг работы контроллера
#define  I4VACKR__V  DBB[ 922]   // A4   Наличие напряжения на управлении крышкой
#define  I4GNS_1__V  DBB[ 923]   // A4   Гидронасос ВКЛЮЧЕН
#define  I4LUCMU__V  DBB[ 924]   // A4   Крышка в местном режиме
#define  I4LUCDU__V  DBB[ 925]   // A4   Крышка в дистанционном режиме
#define  I4KOCO___V  DBB[ 926]   // A4   Клапан сброса конденсата ОТКРЫТ
#define  I4KOCC___V  DBB[ 927]   // A4   Клапан сброса конденсата ЗАКРЫТ
#define  I4GNS1B__V  DBB[ 928]   // A4   Кнопка гидронасос ВКЛЮЧИТЬ
#define  I4GNS0B__V  DBB[ 929]   // A4   Кнопка гидронасос ВЫКЛЮЧИТЬ
#define  I4GNST___V  DBB[ 930]   // A4   Кнопка гидронасос НАЛАДКА
#define  N45C04___V  DBB[ 931]   // Резерв N45C04
#define  N45C05___V  DBB[ 932]   // Резерв N45C05
#define  N45C11___V  DBB[ 933]   // Резерв N45C11
#define  N45C12___V  DBB[ 934]   // Резерв N45C12
#define  N45C13___V  DBB[ 935]   // Резерв N45C13
#define  O4GNS____V  DBB[ 936]   // A4   Управление гидронасосом
#define  O4HM1UP__V  DBB[ 937]   // A4   Хомут1 ПОДНЯТЬ
#define  O4HM1DN__V  DBB[ 938]   // A4   Хомут1 ОПУСТИТЬ
#define  O4KR1O___V  DBB[ 939]   // A4   Крышка1 ОТКРЫТЬ
#define  O4KR1C___V  DBB[ 940]   // A4   Крышка1 ЗАКРЫТЬ
#define  O4BY1O___V  DBB[ 941]   // A4   Байонет1 ОТКРЫТЬ
#define  O4BY1C___V  DBB[ 942]   // A4   Байонет1 ЗАКРЫТЬ
#define  O4HM2UP__V  DBB[ 943]   // A4   Хомут2 ПОДНЯТЬ
#define  O4HM2DN__V  DBB[ 944]   // A4   Хомут2 ОПУСТИТЬ
#define  O4KR2O___V  DBB[ 945]   // A4   Крышка2 ОТКРЫТЬ
#define  O4KR2C___V  DBB[ 946]   // A4   Крышка2 ЗАКРЫТЬ
#define  O4BY2O___V  DBB[ 947]   // A4   Байонет2 ОТКРЫТЬ
#define  O4BY2C___V  DBB[ 948]   // A4   Байонет2 ЗАКРЫТЬ
#define  I4HM1UP__V  DBB[ 949]   // A4   Хомут1 ПОДНЯТ
#define  I4HM1DN__V  DBB[ 950]   // A4   Хомут1 ОПУЩЕН
#define  I4KR1O___V  DBB[ 951]   // A4   Крышка1 ОТКРЫТА
#define  I4KR1C___V  DBB[ 952]   // A4   Крышка1 ЗАКРЫТА
#define  I4BY1O___V  DBB[ 953]   // A4   Байонет1 ОТКРЫТ
#define  I4BY1C___V  DBB[ 954]   // A4   Байонет1 ЗАКРЫТ
#define  I4P1_Y___V  DBB[ 955]   // A4   Давление1 ЕСТЬ
#define  I4P1_N___V  DBB[ 956]   // A4   Давление1 НЕТ
#define  I4SBP1Z__V  DBB[ 957]   // A4   СБП1 ЗАБЛОКИРОВАН
#define  I4SBP1R__V  DBB[ 958]   // A4   СБП1 РАЗБЛОКИРОВАН
#define  I4BY1Z___V  DBB[ 959]   // A4   Байонет1 ЗАБЛОКИРОВАН
#define  I4KR1SB__V  DBB[ 960]   // A4   Кнопка крышка1 СТОП
#define  I4KR1OB__V  DBB[ 961]   // A4   Кнопка крышка1 ОТКРЫТЬ
#define  I4KR1CB__V  DBB[ 962]   // A4   Кнопка крышка1 ЗАКРЫТЬ
#define  I4HM2UP__V  DBB[ 963]   // A4   Хомут2 ПОДНЯТ
#define  I4HM2DN__V  DBB[ 964]   // A4   Хомут2 ОПУЩЕН
#define  I4KR2O___V  DBB[ 965]   // A4   Крышка2 ОТКРЫТА
#define  I4KR2C___V  DBB[ 966]   // A4   Крышка2 ЗАКРЫТА
#define  I4BY2O___V  DBB[ 967]   // A4   Байонет2 ОТКРЫТ
#define  I4BY2C___V  DBB[ 968]   // A4   Байонет2 ЗАКРЫТ
#define  I4P2_Y___V  DBB[ 969]   // A4   Давление2 ЕСТЬ
#define  I4P2_N___V  DBB[ 970]   // A4   Давление2 НЕТ
#define  I4SBP2Z__V  DBB[ 971]   // A4   СБП2 ЗАБЛОКИРОВАН
#define  I4SBP2R__V  DBB[ 972]   // A4   СБП2 РАЗБЛОКИРОВАН
#define  I4BY2Z___V  DBB[ 973]   // A4   Байонет2 ЗАБЛОКИРОВАН
#define  I4KR2SB__V  DBB[ 974]   // A4   Кнопка крышка2 СТОП
#define  I4KR2OB__V  DBB[ 975]   // A4   Кнопка крышка2 ОТКРЫТЬ
#define  I4KR2CB__V  DBB[ 976]   // A4   Кнопка крышка2 ЗАКРЫТЬ
#define  AIT4TOP__V  DBB[ 977]   // A4   Температура вверху автоклава
#define  AIT4BOT__V  DBB[ 978]   // A4   Температура внизу автоклава
#define  AIT4P____V  DBB[ 979]   // A4   Температура пара автоклава
#define  AIF3P__SZM  DBB[1562]   // Ноль шкалы  A3   Расход пара автоклава
#define  AIF3P__SZV  DBB[1563]   // Ноль шкалы  A3   Расход пара автоклава
#define  AIF3P__SDM  DBB[1564]   // Диапазон шкалы  A3   Расход пара автоклава
#define  AIF3P__SDV  DBB[1565]   // Диапазон шкалы  A3   Расход пара автоклава
#define  AIF3P__AZM  DBB[1566]   // Минимальное значение сигнализации  A3   Расход пара автоклава
#define  AIF3P__AZV  DBB[1567]   // Минимальное значение сигнализации  A3   Расход пара автоклава
#define  AIF3P__AMM  DBB[1568]   // Максимальное значение сигнализации  A3   Расход пара автоклава
#define  AIF3P__AMV  DBB[1569]   // Максимальное значение сигнализации  A3   Расход пара автоклава
#define  AIF3P___FM  DBB[1570]   // Значение фильтрации скачков  A3   Расход пара автоклава
#define  AIF3P___FV  DBB[1571]   // Значение фильтрации скачков  A3   Расход пара автоклава
#define  AIF3P___AM  DBB[1572]   // Количество циклов усреднения  A3   Расход пара автоклава
#define  AIF3P___AV  DBB[1573]   // Количество циклов усреднения  A3   Расход пара автоклава
#define  AIF4P__SZM  DBB[1574]   // Ноль шкалы  A4   Расход пара автоклава
#define  AIF4P__SZV  DBB[1575]   // Ноль шкалы  A4   Расход пара автоклава
#define  AIF4P__SDM  DBB[1576]   // Диапазон шкалы  A4   Расход пара автоклава
#define  AIF4P__SDV  DBB[1577]   // Диапазон шкалы  A4   Расход пара автоклава
#define  AIF4P__AZM  DBB[1578]   // Минимальное значение сигнализации  A4   Расход пара автоклава
#define  AIF4P__AZV  DBB[1579]   // Минимальное значение сигнализации  A4   Расход пара автоклава
#define  AIF4P__AMM  DBB[1580]   // Максимальное значение сигнализации  A4   Расход пара автоклава
#define  AIF4P__AMV  DBB[1581]   // Максимальное значение сигнализации  A4   Расход пара автоклава
#define  AIF4P___FM  DBB[1582]   // Значение фильтрации скачков  A4   Расход пара автоклава
#define  AIF4P___FV  DBB[1583]   // Значение фильтрации скачков  A4   Расход пара автоклава
#define  AIF4P___AM  DBB[1584]   // Количество циклов усреднения  A4   Расход пара автоклава
#define  AIF4P___AV  DBB[1585]   // Количество циклов усреднения  A4   Расход пара автоклава
#define  AIL3C__SZM  DBB[1586]   // Ноль шкалы  A3   Уровень конденсата автоклава
#define  AIL3C__SZV  DBB[1587]   // Ноль шкалы  A3   Уровень конденсата автоклава
#define  AIL3C__SDM  DBB[1588]   // Диапазон шкалы  A3   Уровень конденсата автоклава
#define  AIL3C__SDV  DBB[1589]   // Диапазон шкалы  A3   Уровень конденсата автоклава
#define  AIL3C__AZM  DBB[1590]   // Минимальное значение сигнализации  A3   Уровень конденсата автоклава
#define  AIL3C__AZV  DBB[1591]   // Минимальное значение сигнализации  A3   Уровень конденсата автоклава
#define  AIL3C__AMM  DBB[1592]   // Максимальное значение сигнализации  A3   Уровень конденсата автоклава
#define  AIL3C__AMV  DBB[1593]   // Максимальное значение сигнализации  A3   Уровень конденсата автоклава
#define  AIL3C___FM  DBB[1594]   // Значение фильтрации скачков  A3   Уровень конденсата автоклава
#define  AIL3C___FV  DBB[1595]   // Значение фильтрации скачков  A3   Уровень конденсата автоклава
#define  AIL3C___AM  DBB[1596]   // Количество циклов усреднения  A3   Уровень конденсата автоклава
#define  AIL3C___AV  DBB[1597]   // Количество циклов усреднения  A3   Уровень конденсата автоклава
#define  AIL4C__SZM  DBB[1598]   // Ноль шкалы  A4   Уровень конденсата автоклава
#define  AIL4C__SZV  DBB[1599]   // Ноль шкалы  A4   Уровень конденсата автоклава
#define  AIL4C__SDM  DBB[1600]   // Диапазон шкалы  A4   Уровень конденсата автоклава
#define  AIL4C__SDV  DBB[1601]   // Диапазон шкалы  A4   Уровень конденсата автоклава
#define  AIL4C__AZM  DBB[1602]   // Минимальное значение сигнализации  A4   Уровень конденсата автоклава
#define  AIL4C__AZV  DBB[1603]   // Минимальное значение сигнализации  A4   Уровень конденсата автоклава
#define  AIL4C__AMM  DBB[1604]   // Максимальное значение сигнализации  A4   Уровень конденсата автоклава
#define  AIL4C__AMV  DBB[1605]   // Максимальное значение сигнализации  A4   Уровень конденсата автоклава
#define  AIL4C___FM  DBB[1606]   // Значение фильтрации скачков  A4   Уровень конденсата автоклава
#define  AIL4C___FV  DBB[1607]   // Значение фильтрации скачков  A4   Уровень конденсата автоклава
#define  AIL4C___AM  DBB[1608]   // Количество циклов усреднения  A4   Уровень конденсата автоклава
#define  AIL4C___AV  DBB[1609]   // Количество циклов усреднения  A4   Уровень конденсата автоклава
#define  AIP3P__SZM  DBB[1610]   // Ноль шкалы  A3   Давление пара автоклава
#define  AIP3P__SZV  DBB[1611]   // Ноль шкалы  A3   Давление пара автоклава
#define  AIP3P__SDM  DBB[1612]   // Диапазон шкалы  A3   Давление пара автоклава
#define  AIP3P__SDV  DBB[1613]   // Диапазон шкалы  A3   Давление пара автоклава
#define  AIP3P__AZM  DBB[1614]   // Минимальное значение сигнализации  A3   Давление пара автоклава
#define  AIP3P__AZV  DBB[1615]   // Минимальное значение сигнализации  A3   Давление пара автоклава
#define  AIP3P__AMM  DBB[1616]   // Максимальное значение сигнализации  A3   Давление пара автоклава
#define  AIP3P__AMV  DBB[1617]   // Максимальное значение сигнализации  A3   Давление пара автоклава
#define  AIP3P___FM  DBB[1618]   // Значение фильтрации скачков  A3   Давление пара автоклава
#define  AIP3P___FV  DBB[1619]   // Значение фильтрации скачков  A3   Давление пара автоклава
#define  AIP3P___AM  DBB[1620]   // Количество циклов усреднения  A3   Давление пара автоклава
#define  AIP3P___AV  DBB[1621]   // Количество циклов усреднения  A3   Давление пара автоклава
#define  AIP4P__SZM  DBB[1622]   // Ноль шкалы  A4   Давление пара автоклава
#define  AIP4P__SZV  DBB[1623]   // Ноль шкалы  A4   Давление пара автоклава
#define  AIP4P__SDM  DBB[1624]   // Диапазон шкалы  A4   Давление пара автоклава
#define  AIP4P__SDV  DBB[1625]   // Диапазон шкалы  A4   Давление пара автоклава
#define  AIP4P__AZM  DBB[1626]   // Минимальное значение сигнализации  A4   Давление пара автоклава
#define  AIP4P__AZV  DBB[1627]   // Минимальное значение сигнализации  A4   Давление пара автоклава
#define  AIP4P__AMM  DBB[1628]   // Максимальное значение сигнализации  A4   Давление пара автоклава
#define  AIP4P__AMV  DBB[1629]   // Максимальное значение сигнализации  A4   Давление пара автоклава
#define  AIP4P___FM  DBB[1630]   // Значение фильтрации скачков  A4   Давление пара автоклава
#define  AIP4P___FV  DBB[1631]   // Значение фильтрации скачков  A4   Давление пара автоклава
#define  AIP4P___AM  DBB[1632]   // Количество циклов усреднения  A4   Давление пара автоклава
#define  AIP4P___AV  DBB[1633]   // Количество циклов усреднения  A4   Давление пара автоклава
#define  AIP34V_SZM  DBB[1634]   // Ноль шкалы  A34  Разрежение автоклава
#define  AIP34V_SZV  DBB[1635]   // Ноль шкалы  A34  Разрежение автоклава
#define  AIP34V_SDM  DBB[1636]   // Диапазон шкалы  A34  Разрежение автоклава
#define  AIP34V_SDV  DBB[1637]   // Диапазон шкалы  A34  Разрежение автоклава
#define  AIP34V_AZM  DBB[1638]   // Минимальное значение сигнализации  A34  Разрежение автоклава
#define  AIP34V_AZV  DBB[1639]   // Минимальное значение сигнализации  A34  Разрежение автоклава
#define  AIP34V_AMM  DBB[1640]   // Максимальное значение сигнализации  A34  Разрежение автоклава
#define  AIP34V_AMV  DBB[1641]   // Максимальное значение сигнализации  A34  Разрежение автоклава
#define  AIP34V__FM  DBB[1642]   // Значение фильтрации скачков  A34  Разрежение автоклава
#define  AIP34V__FV  DBB[1643]   // Значение фильтрации скачков  A34  Разрежение автоклава
#define  AIP34V__AM  DBB[1644]   // Количество циклов усреднения  A34  Разрежение автоклава
#define  AIP34V__AV  DBB[1645]   // Количество циклов усреднения  A34  Разрежение автоклава
#define  AIP34M_SZM  DBB[1646]   // Ноль шкалы  A34  Давление в магистрали
#define  AIP34M_SZV  DBB[1647]   // Ноль шкалы  A34  Давление в магистрали
#define  AIP34M_SDM  DBB[1648]   // Диапазон шкалы  A34  Давление в магистрали
#define  AIP34M_SDV  DBB[1649]   // Диапазон шкалы  A34  Давление в магистрали
#define  AIP34M_AZM  DBB[1650]   // Минимальное значение сигнализации  A34  Давление в магистрали
#define  AIP34M_AZV  DBB[1651]   // Минимальное значение сигнализации  A34  Давление в магистрали
#define  AIP34M_AMM  DBB[1652]   // Максимальное значение сигнализации  A34  Давление в магистрали
#define  AIP34M_AMV  DBB[1653]   // Максимальное значение сигнализации  A34  Давление в магистрали
#define  AIP34M__FM  DBB[1654]   // Значение фильтрации скачков  A34  Давление в магистрали
#define  AIP34M__FV  DBB[1655]   // Значение фильтрации скачков  A34  Давление в магистрали
#define  AIP34M__AM  DBB[1656]   // Количество циклов усреднения  A34  Давление в магистрали
#define  AIP34M__AV  DBB[1657]   // Количество циклов усреднения  A34  Давление в магистрали
#define  O3ZIOPO__M  DBB[1658]   // A3   Задвижку впуска острого пара ОТКРЫТЬ
#define  O3ZIOPC__M  DBB[1659]   // A3   Задвижку впуска острого пара ЗАКРЫТЬ
#define  O3ZIPPO__M  DBB[1660]   // A3   Задвижку впуска перепускного пара ОТКРЫТЬ
#define  O3ZIPPC__M  DBB[1661]   // A3   Задвижку впуска перепускного пара ЗАКРЫТЬ
#define  O3KIPO___M  DBB[1662]   // A3   Клапан впуска пара ОТКРЫТЬ
#define  O3KIPC___M  DBB[1663]   // A3   Клапан впуска пара ЗАКРЫТЬ
#define  O3ZOPPO__M  DBB[1664]   // A3   Задвижку выпуска перепускного пара ОТКРЫТЬ
#define  O3ZOPPC__M  DBB[1665]   // A3   Задвижку выпуска перепускного пара ЗАКРЫТЬ
#define  O3ZOPAO__M  DBB[1666]   // A3   Задвижку выпуска пара в атмосферу ОТКРЫТЬ
#define  O3ZOPAC__M  DBB[1667]   // A3   Задвижку выпуска пара в атмосферу ЗАКРЫТЬ
#define  O3KOPO___M  DBB[1668]   // A3   Клапан выпуска пара ОТКРЫТЬ
#define  O3KOPC___M  DBB[1669]   // A3   Клапан выпуска пара ЗАКРЫТЬ
#define  O3BELL___M  DBB[1670]   // A3   ЗВОНОК
#define  O3KOCO___M  DBB[1671]   // A3   Клапан сброса конденсата ОТКРЫТЬ
#define  O3KOCC___M  DBB[1672]   // A3   Клапан сброса конденсата ЗАКРЫТЬ
#define  O3VZO____M  DBB[1673]   // A3   Вакуумную задвижку ОТКРЫТЬ
#define  O3VZC____M  DBB[1674]   // A3   Вакуумную задвижку ЗАКРЫТЬ
#define  O3AZVO___M  DBB[1675]   // A3   Атмосферную задвижку на вак магистрали ОТКРЫТЬ
#define  O3VN_1___M  DBB[1676]   // A3   Вакуумный насос ВКЛЮЧИТЬ
#define  N34C06___M  DBB[1677]   // Резерв N34C06
#define  N34C07___M  DBB[1678]   // Резерв N34C07
#define  N34C08___M  DBB[1679]   // Резерв N34C08
#define  N34C09___M  DBB[1680]   // Резерв N34C09
#define  N34C10___M  DBB[1681]   // Резерв N34C10
#define  N34C11___M  DBB[1682]   // Резерв N34C11
#define  PCCS3WR__M  DBB[1683]   // A3   Флаг работы контроллера
#define  O3GNS____M  DBB[1684]   // A3   Управление гидронасосом
#define  O3HM1UP__M  DBB[1685]   // A3   Хомут1 ПОДНЯТЬ
#define  O3HM1DN__M  DBB[1686]   // A3   Хомут1 ОПУСТИТЬ
#define  O3KR1O___M  DBB[1687]   // A3   Крышка1 ОТКРЫТЬ
#define  O3KR1C___M  DBB[1688]   // A3   Крышка1 ЗАКРЫТЬ
#define  O3BY1O___M  DBB[1689]   // A3   Байонет1 ОТКРЫТЬ
#define  O3BY1C___M  DBB[1690]   // A3   Байонет1 ЗАКРЫТЬ
#define  O3HM2UP__M  DBB[1691]   // A3   Хомут2 ПОДНЯТЬ
#define  O3HM2DN__M  DBB[1692]   // A3   Хомут2 ОПУСТИТЬ
#define  O3KR2O___M  DBB[1693]   // A3   Крышка2 ОТКРЫТЬ
#define  O3KR2C___M  DBB[1694]   // A3   Крышка2 ЗАКРЫТЬ
#define  O3BY2O___M  DBB[1695]   // A3   Байонет2 ОТКРЫТЬ
#define  O3BY2C___M  DBB[1696]   // A3   Байонет2 ЗАКРЫТЬ
#define  AITPO__SZM  DBB[1697]   // Ноль шкалы  Температура острого пара
#define  AITPO__SZV  DBB[1698]   // Ноль шкалы  Температура острого пара
#define  AITPO__SDM  DBB[1699]   // Диапазон шкалы  Температура острого пара
#define  AITPO__SDV  DBB[1700]   // Диапазон шкалы  Температура острого пара
#define  AITPO__AZM  DBB[1701]   // Минимальное значение сигнализации  Температура острого пара
#define  AITPO__AZV  DBB[1702]   // Минимальное значение сигнализации  Температура острого пара
#define  AITPO__AMM  DBB[1703]   // Максимальное значение сигнализации  Температура острого пара
#define  AITPO__AMV  DBB[1704]   // Максимальное значение сигнализации  Температура острого пара
#define  AITPO___FM  DBB[1705]   // Значение фильтрации скачков  Температура острого пара
#define  AITPO___FV  DBB[1706]   // Значение фильтрации скачков  Температура острого пара
#define  AITPO___AM  DBB[1707]   // Количество циклов усреднения  Температура острого пара
#define  AITPO___AV  DBB[1708]   // Количество циклов усреднения  Температура острого пара
#define  AIFPO__SZM  DBB[1709]   // Ноль шкалы  Расход острого пара
#define  AIFPO__SZV  DBB[1710]   // Ноль шкалы  Расход острого пара
#define  AIFPO__SDM  DBB[1711]   // Диапазон шкалы  Расход острого пара
#define  AIFPO__SDV  DBB[1712]   // Диапазон шкалы  Расход острого пара
#define  AIFPO__AZM  DBB[1713]   // Минимальное значение сигнализации  Расход острого пара
#define  AIFPO__AZV  DBB[1714]   // Минимальное значение сигнализации  Расход острого пара
#define  AIFPO__AMM  DBB[1715]   // Максимальное значение сигнализации  Расход острого пара
#define  AIFPO__AMV  DBB[1716]   // Максимальное значение сигнализации  Расход острого пара
#define  AIFPO___FM  DBB[1717]   // Значение фильтрации скачков  Расход острого пара
#define  AIFPO___FV  DBB[1718]   // Значение фильтрации скачков  Расход острого пара
#define  AIFPO___AM  DBB[1719]   // Количество циклов усреднения  Расход острого пара
#define  AIFPO___AV  DBB[1720]   // Количество циклов усреднения  Расход острого пара
#define  N38C02_SZM  DBB[1721]   // Ноль шкалы  Резерв N38C02
#define  N38C02_SZV  DBB[1722]   // Ноль шкалы  Резерв N38C02
#define  N38C02_SDM  DBB[1723]   // Диапазон шкалы  Резерв N38C02
#define  N38C02_SDV  DBB[1724]   // Диапазон шкалы  Резерв N38C02
#define  N38C02_AZM  DBB[1725]   // Минимальное значение сигнализации  Резерв N38C02
#define  N38C02_AZV  DBB[1726]   // Минимальное значение сигнализации  Резерв N38C02
#define  N38C02_AMM  DBB[1727]   // Максимальное значение сигнализации  Резерв N38C02
#define  N38C02_AMV  DBB[1728]   // Максимальное значение сигнализации  Резерв N38C02
#define  N38C02__FM  DBB[1729]   // Значение фильтрации скачков  Резерв N38C02
#define  N38C02__FV  DBB[1730]   // Значение фильтрации скачков  Резерв N38C02
#define  N38C02__AM  DBB[1731]   // Количество циклов усреднения  Резерв N38C02
#define  N38C02__AV  DBB[1732]   // Количество циклов усреднения  Резерв N38C02
#define  N38C03_SZM  DBB[1733]   // Ноль шкалы  Резерв N38C03
#define  N38C03_SZV  DBB[1734]   // Ноль шкалы  Резерв N38C03
#define  N38C03_SDM  DBB[1735]   // Диапазон шкалы  Резерв N38C03
#define  N38C03_SDV  DBB[1736]   // Диапазон шкалы  Резерв N38C03
#define  N38C03_AZM  DBB[1737]   // Минимальное значение сигнализации  Резерв N38C03
#define  N38C03_AZV  DBB[1738]   // Минимальное значение сигнализации  Резерв N38C03
#define  N38C03_AMM  DBB[1739]   // Максимальное значение сигнализации  Резерв N38C03
#define  N38C03_AMV  DBB[1740]   // Максимальное значение сигнализации  Резерв N38C03
#define  N38C03__FM  DBB[1741]   // Значение фильтрации скачков  Резерв N38C03
#define  N38C03__FV  DBB[1742]   // Значение фильтрации скачков  Резерв N38C03
#define  N38C03__AM  DBB[1743]   // Количество циклов усреднения  Резерв N38C03
#define  N38C03__AV  DBB[1744]   // Количество циклов усреднения  Резерв N38C03
#define  N38C04_SZM  DBB[1745]   // Ноль шкалы  Резерв N38C04
#define  N38C04_SZV  DBB[1746]   // Ноль шкалы  Резерв N38C04
#define  N38C04_SDM  DBB[1747]   // Диапазон шкалы  Резерв N38C04
#define  N38C04_SDV  DBB[1748]   // Диапазон шкалы  Резерв N38C04
#define  N38C04_AZM  DBB[1749]   // Минимальное значение сигнализации  Резерв N38C04
#define  N38C04_AZV  DBB[1750]   // Минимальное значение сигнализации  Резерв N38C04
#define  N38C04_AMM  DBB[1751]   // Максимальное значение сигнализации  Резерв N38C04
#define  N38C04_AMV  DBB[1752]   // Максимальное значение сигнализации  Резерв N38C04
#define  N38C04__FM  DBB[1753]   // Значение фильтрации скачков  Резерв N38C04
#define  N38C04__FV  DBB[1754]   // Значение фильтрации скачков  Резерв N38C04
#define  N38C04__AM  DBB[1755]   // Количество циклов усреднения  Резерв N38C04
#define  N38C04__AV  DBB[1756]   // Количество циклов усреднения  Резерв N38C04
#define  N38C05_SZM  DBB[1757]   // Ноль шкалы  Резерв N38C05
#define  N38C05_SZV  DBB[1758]   // Ноль шкалы  Резерв N38C05
#define  N38C05_SDM  DBB[1759]   // Диапазон шкалы  Резерв N38C05
#define  N38C05_SDV  DBB[1760]   // Диапазон шкалы  Резерв N38C05
#define  N38C05_AZM  DBB[1761]   // Минимальное значение сигнализации  Резерв N38C05
#define  N38C05_AZV  DBB[1762]   // Минимальное значение сигнализации  Резерв N38C05
#define  N38C05_AMM  DBB[1763]   // Максимальное значение сигнализации  Резерв N38C05
#define  N38C05_AMV  DBB[1764]   // Максимальное значение сигнализации  Резерв N38C05
#define  N38C05__FM  DBB[1765]   // Значение фильтрации скачков  Резерв N38C05
#define  N38C05__FV  DBB[1766]   // Значение фильтрации скачков  Резерв N38C05
#define  N38C05__AM  DBB[1767]   // Количество циклов усреднения  Резерв N38C05
#define  N38C05__AV  DBB[1768]   // Количество циклов усреднения  Резерв N38C05
#define  N38C06_SZM  DBB[1769]   // Ноль шкалы  Резерв N38C06
#define  N38C06_SZV  DBB[1770]   // Ноль шкалы  Резерв N38C06
#define  N38C06_SDM  DBB[1771]   // Диапазон шкалы  Резерв N38C06
#define  N38C06_SDV  DBB[1772]   // Диапазон шкалы  Резерв N38C06
#define  N38C06_AZM  DBB[1773]   // Минимальное значение сигнализации  Резерв N38C06
#define  N38C06_AZV  DBB[1774]   // Минимальное значение сигнализации  Резерв N38C06
#define  N38C06_AMM  DBB[1775]   // Максимальное значение сигнализации  Резерв N38C06
#define  N38C06_AMV  DBB[1776]   // Максимальное значение сигнализации  Резерв N38C06
#define  N38C06__FM  DBB[1777]   // Значение фильтрации скачков  Резерв N38C06
#define  N38C06__FV  DBB[1778]   // Значение фильтрации скачков  Резерв N38C06
#define  N38C06__AM  DBB[1779]   // Количество циклов усреднения  Резерв N38C06
#define  N38C06__AV  DBB[1780]   // Количество циклов усреднения  Резерв N38C06
#define  N38C07_SZM  DBB[1781]   // Ноль шкалы  Резерв N38C07
#define  N38C07_SZV  DBB[1782]   // Ноль шкалы  Резерв N38C07
#define  N38C07_SDM  DBB[1783]   // Диапазон шкалы  Резерв N38C07
#define  N38C07_SDV  DBB[1784]   // Диапазон шкалы  Резерв N38C07
#define  N38C07_AZM  DBB[1785]   // Минимальное значение сигнализации  Резерв N38C07
#define  N38C07_AZV  DBB[1786]   // Минимальное значение сигнализации  Резерв N38C07
#define  N38C07_AMM  DBB[1787]   // Максимальное значение сигнализации  Резерв N38C07
#define  N38C07_AMV  DBB[1788]   // Максимальное значение сигнализации  Резерв N38C07
#define  N38C07__FM  DBB[1789]   // Значение фильтрации скачков  Резерв N38C07
#define  N38C07__FV  DBB[1790]   // Значение фильтрации скачков  Резерв N38C07
#define  N38C07__AM  DBB[1791]   // Количество циклов усреднения  Резерв N38C07
#define  N38C07__AV  DBB[1792]   // Количество циклов усреднения  Резерв N38C07
#define  AIT3TOPSZM  DBB[1793]   // Ноль шкалы  A3   Температура вверху автоклава
#define  AIT3TOPSZV  DBB[1794]   // Ноль шкалы  A3   Температура вверху автоклава
#define  AIT3TOPSDM  DBB[1795]   // Диапазон шкалы  A3   Температура вверху автоклава
#define  AIT3TOPSDV  DBB[1796]   // Диапазон шкалы  A3   Температура вверху автоклава
#define  AIT3TOPAZM  DBB[1797]   // Минимальное значение сигнализации  A3   Температура вверху автоклава
#define  AIT3TOPAZV  DBB[1798]   // Минимальное значение сигнализации  A3   Температура вверху автоклава
#define  AIT3TOPAMM  DBB[1799]   // Максимальное значение сигнализации  A3   Температура вверху автоклава
#define  AIT3TOPAMV  DBB[1800]   // Максимальное значение сигнализации  A3   Температура вверху автоклава
#define  AIT3TOP_FM  DBB[1801]   // Значение фильтрации скачков  A3   Температура вверху автоклава
#define  AIT3TOP_FV  DBB[1802]   // Значение фильтрации скачков  A3   Температура вверху автоклава
#define  AIT3TOP_AM  DBB[1803]   // Количество циклов усреднения  A3   Температура вверху автоклава
#define  AIT3TOP_AV  DBB[1804]   // Количество циклов усреднения  A3   Температура вверху автоклава
#define  AIT3BOTSZM  DBB[1805]   // Ноль шкалы  A3   Температура внизу автоклава
#define  AIT3BOTSZV  DBB[1806]   // Ноль шкалы  A3   Температура внизу автоклава
#define  AIT3BOTSDM  DBB[1807]   // Диапазон шкалы  A3   Температура внизу автоклава
#define  AIT3BOTSDV  DBB[1808]   // Диапазон шкалы  A3   Температура внизу автоклава
#define  AIT3BOTAZM  DBB[1809]   // Минимальное значение сигнализации  A3   Температура внизу автоклава
#define  AIT3BOTAZV  DBB[1810]   // Минимальное значение сигнализации  A3   Температура внизу автоклава
#define  AIT3BOTAMM  DBB[1811]   // Максимальное значение сигнализации  A3   Температура внизу автоклава
#define  AIT3BOTAMV  DBB[1812]   // Максимальное значение сигнализации  A3   Температура внизу автоклава
#define  AIT3BOT_FM  DBB[1813]   // Значение фильтрации скачков  A3   Температура внизу автоклава
#define  AIT3BOT_FV  DBB[1814]   // Значение фильтрации скачков  A3   Температура внизу автоклава
#define  AIT3BOT_AM  DBB[1815]   // Количество циклов усреднения  A3   Температура внизу автоклава
#define  AIT3BOT_AV  DBB[1816]   // Количество циклов усреднения  A3   Температура внизу автоклава
#define  AIT3P__SZM  DBB[1817]   // Ноль шкалы  A3   Температура пара автоклава
#define  AIT3P__SZV  DBB[1818]   // Ноль шкалы  A3   Температура пара автоклава
#define  AIT3P__SDM  DBB[1819]   // Диапазон шкалы  A3   Температура пара автоклава
#define  AIT3P__SDV  DBB[1820]   // Диапазон шкалы  A3   Температура пара автоклава
#define  AIT3P__AZM  DBB[1821]   // Минимальное значение сигнализации  A3   Температура пара автоклава
#define  AIT3P__AZV  DBB[1822]   // Минимальное значение сигнализации  A3   Температура пара автоклава
#define  AIT3P__AMM  DBB[1823]   // Максимальное значение сигнализации  A3   Температура пара автоклава
#define  AIT3P__AMV  DBB[1824]   // Максимальное значение сигнализации  A3   Температура пара автоклава
#define  AIT3P___FM  DBB[1825]   // Значение фильтрации скачков  A3   Температура пара автоклава
#define  AIT3P___FV  DBB[1826]   // Значение фильтрации скачков  A3   Температура пара автоклава
#define  AIT3P___AM  DBB[1827]   // Количество циклов усреднения  A3   Температура пара автоклава
#define  AIT3P___AV  DBB[1828]   // Количество циклов усреднения  A3   Температура пара автоклава
#define  AIS3PI_SZM  DBB[1829]   // Ноль шкалы  A3   Положение клапана впуска пара
#define  AIS3PI_SZV  DBB[1830]   // Ноль шкалы  A3   Положение клапана впуска пара
#define  AIS3PI_SDM  DBB[1831]   // Диапазон шкалы  A3   Положение клапана впуска пара
#define  AIS3PI_SDV  DBB[1832]   // Диапазон шкалы  A3   Положение клапана впуска пара
#define  AIS3PI_AZM  DBB[1833]   // Минимальное значение сигнализации  A3   Положение клапана впуска пара
#define  AIS3PI_AZV  DBB[1834]   // Минимальное значение сигнализации  A3   Положение клапана впуска пара
#define  AIS3PI_AMM  DBB[1835]   // Максимальное значение сигнализации  A3   Положение клапана впуска пара
#define  AIS3PI_AMV  DBB[1836]   // Максимальное значение сигнализации  A3   Положение клапана впуска пара
#define  AIS3PI__FM  DBB[1837]   // Значение фильтрации скачков  A3   Положение клапана впуска пара
#define  AIS3PI__FV  DBB[1838]   // Значение фильтрации скачков  A3   Положение клапана впуска пара
#define  AIS3PI__AM  DBB[1839]   // Количество циклов усреднения  A3   Положение клапана впуска пара
#define  AIS3PI__AV  DBB[1840]   // Количество циклов усреднения  A3   Положение клапана впуска пара
#define  AIS3PO_SZM  DBB[1841]   // Ноль шкалы  A3   Положение клапана выпуска пара
#define  AIS3PO_SZV  DBB[1842]   // Ноль шкалы  A3   Положение клапана выпуска пара
#define  AIS3PO_SDM  DBB[1843]   // Диапазон шкалы  A3   Положение клапана выпуска пара
#define  AIS3PO_SDV  DBB[1844]   // Диапазон шкалы  A3   Положение клапана выпуска пара
#define  AIS3PO_AZM  DBB[1845]   // Минимальное значение сигнализации  A3   Положение клапана выпуска пара
#define  AIS3PO_AZV  DBB[1846]   // Минимальное значение сигнализации  A3   Положение клапана выпуска пара
#define  AIS3PO_AMM  DBB[1847]   // Максимальное значение сигнализации  A3   Положение клапана выпуска пара
#define  AIS3PO_AMV  DBB[1848]   // Максимальное значение сигнализации  A3   Положение клапана выпуска пара
#define  AIS3PO__FM  DBB[1849]   // Значение фильтрации скачков  A3   Положение клапана выпуска пара
#define  AIS3PO__FV  DBB[1850]   // Значение фильтрации скачков  A3   Положение клапана выпуска пара
#define  AIS3PO__AM  DBB[1851]   // Количество циклов усреднения  A3   Положение клапана выпуска пара
#define  AIS3PO__AV  DBB[1852]   // Количество циклов усреднения  A3   Положение клапана выпуска пара
#define  AIS3CO_SZM  DBB[1853]   // Ноль шкалы  A3   Положение клапана сброса конденсата
#define  AIS3CO_SZV  DBB[1854]   // Ноль шкалы  A3   Положение клапана сброса конденсата
#define  AIS3CO_SDM  DBB[1855]   // Диапазон шкалы  A3   Положение клапана сброса конденсата
#define  AIS3CO_SDV  DBB[1856]   // Диапазон шкалы  A3   Положение клапана сброса конденсата
#define  AIS3CO_AZM  DBB[1857]   // Минимальное значение сигнализации  A3   Положение клапана сброса конденсата
#define  AIS3CO_AZV  DBB[1858]   // Минимальное значение сигнализации  A3   Положение клапана сброса конденсата
#define  AIS3CO_AMM  DBB[1859]   // Максимальное значение сигнализации  A3   Положение клапана сброса конденсата
#define  AIS3CO_AMV  DBB[1860]   // Максимальное значение сигнализации  A3   Положение клапана сброса конденсата
#define  AIS3CO__FM  DBB[1861]   // Значение фильтрации скачков  A3   Положение клапана сброса конденсата
#define  AIS3CO__FV  DBB[1862]   // Значение фильтрации скачков  A3   Положение клапана сброса конденсата
#define  AIS3CO__AM  DBB[1863]   // Количество циклов усреднения  A3   Положение клапана сброса конденсата
#define  AIS3CO__AV  DBB[1864]   // Количество циклов усреднения  A3   Положение клапана сброса конденсата
#define  AIS4PI_SZM  DBB[1865]   // Ноль шкалы  A4   Положение клапана впуска пара
#define  AIS4PI_SZV  DBB[1866]   // Ноль шкалы  A4   Положение клапана впуска пара
#define  AIS4PI_SDM  DBB[1867]   // Диапазон шкалы  A4   Положение клапана впуска пара
#define  AIS4PI_SDV  DBB[1868]   // Диапазон шкалы  A4   Положение клапана впуска пара
#define  AIS4PI_AZM  DBB[1869]   // Минимальное значение сигнализации  A4   Положение клапана впуска пара
#define  AIS4PI_AZV  DBB[1870]   // Минимальное значение сигнализации  A4   Положение клапана впуска пара
#define  AIS4PI_AMM  DBB[1871]   // Максимальное значение сигнализации  A4   Положение клапана впуска пара
#define  AIS4PI_AMV  DBB[1872]   // Максимальное значение сигнализации  A4   Положение клапана впуска пара
#define  AIS4PI__FM  DBB[1873]   // Значение фильтрации скачков  A4   Положение клапана впуска пара
#define  AIS4PI__FV  DBB[1874]   // Значение фильтрации скачков  A4   Положение клапана впуска пара
#define  AIS4PI__AM  DBB[1875]   // Количество циклов усреднения  A4   Положение клапана впуска пара
#define  AIS4PI__AV  DBB[1876]   // Количество циклов усреднения  A4   Положение клапана впуска пара
#define  AIS4PO_SZM  DBB[1877]   // Ноль шкалы  A4   Положение клапана выпуска пара
#define  AIS4PO_SZV  DBB[1878]   // Ноль шкалы  A4   Положение клапана выпуска пара
#define  AIS4PO_SDM  DBB[1879]   // Диапазон шкалы  A4   Положение клапана выпуска пара
#define  AIS4PO_SDV  DBB[1880]   // Диапазон шкалы  A4   Положение клапана выпуска пара
#define  AIS4PO_AZM  DBB[1881]   // Минимальное значение сигнализации  A4   Положение клапана выпуска пара
#define  AIS4PO_AZV  DBB[1882]   // Минимальное значение сигнализации  A4   Положение клапана выпуска пара
#define  AIS4PO_AMM  DBB[1883]   // Максимальное значение сигнализации  A4   Положение клапана выпуска пара
#define  AIS4PO_AMV  DBB[1884]   // Максимальное значение сигнализации  A4   Положение клапана выпуска пара
#define  AIS4PO__FM  DBB[1885]   // Значение фильтрации скачков  A4   Положение клапана выпуска пара
#define  AIS4PO__FV  DBB[1886]   // Значение фильтрации скачков  A4   Положение клапана выпуска пара
#define  AIS4PO__AM  DBB[1887]   // Количество циклов усреднения  A4   Положение клапана выпуска пара
#define  AIS4PO__AV  DBB[1888]   // Количество циклов усреднения  A4   Положение клапана выпуска пара
#define  AIS4CO_SZM  DBB[1889]   // Ноль шкалы  A4   Положение клапана сброса конденсата
#define  AIS4CO_SZV  DBB[1890]   // Ноль шкалы  A4   Положение клапана сброса конденсата
#define  AIS4CO_SDM  DBB[1891]   // Диапазон шкалы  A4   Положение клапана сброса конденсата
#define  AIS4CO_SDV  DBB[1892]   // Диапазон шкалы  A4   Положение клапана сброса конденсата
#define  AIS4CO_AZM  DBB[1893]   // Минимальное значение сигнализации  A4   Положение клапана сброса конденсата
#define  AIS4CO_AZV  DBB[1894]   // Минимальное значение сигнализации  A4   Положение клапана сброса конденсата
#define  AIS4CO_AMM  DBB[1895]   // Максимальное значение сигнализации  A4   Положение клапана сброса конденсата
#define  AIS4CO_AMV  DBB[1896]   // Максимальное значение сигнализации  A4   Положение клапана сброса конденсата
#define  AIS4CO__FM  DBB[1897]   // Значение фильтрации скачков  A4   Положение клапана сброса конденсата
#define  AIS4CO__FV  DBB[1898]   // Значение фильтрации скачков  A4   Положение клапана сброса конденсата
#define  AIS4CO__AM  DBB[1899]   // Количество циклов усреднения  A4   Положение клапана сброса конденсата
#define  AIS4CO__AV  DBB[1900]   // Количество циклов усреднения  A4   Положение клапана сброса конденсата
#define  N3AC06_SZM  DBB[1901]   // Ноль шкалы  Резерв N3AC06
#define  N3AC06_SZV  DBB[1902]   // Ноль шкалы  Резерв N3AC06
#define  N3AC06_SDM  DBB[1903]   // Диапазон шкалы  Резерв N3AC06
#define  N3AC06_SDV  DBB[1904]   // Диапазон шкалы  Резерв N3AC06
#define  N3AC06_AZM  DBB[1905]   // Минимальное значение сигнализации  Резерв N3AC06
#define  N3AC06_AZV  DBB[1906]   // Минимальное значение сигнализации  Резерв N3AC06
#define  N3AC06_AMM  DBB[1907]   // Максимальное значение сигнализации  Резерв N3AC06
#define  N3AC06_AMV  DBB[1908]   // Максимальное значение сигнализации  Резерв N3AC06
#define  N3AC06__FM  DBB[1909]   // Значение фильтрации скачков  Резерв N3AC06
#define  N3AC06__FV  DBB[1910]   // Значение фильтрации скачков  Резерв N3AC06
#define  N3AC06__AM  DBB[1911]   // Количество циклов усреднения  Резерв N3AC06
#define  N3AC06__AV  DBB[1912]   // Количество циклов усреднения  Резерв N3AC06
#define  N3AC07_SZM  DBB[1913]   // Ноль шкалы  Резерв N3AC07
#define  N3AC07_SZV  DBB[1914]   // Ноль шкалы  Резерв N3AC07
#define  N3AC07_SDM  DBB[1915]   // Диапазон шкалы  Резерв N3AC07
#define  N3AC07_SDV  DBB[1916]   // Диапазон шкалы  Резерв N3AC07
#define  N3AC07_AZM  DBB[1917]   // Минимальное значение сигнализации  Резерв N3AC07
#define  N3AC07_AZV  DBB[1918]   // Минимальное значение сигнализации  Резерв N3AC07
#define  N3AC07_AMM  DBB[1919]   // Максимальное значение сигнализации  Резерв N3AC07
#define  N3AC07_AMV  DBB[1920]   // Максимальное значение сигнализации  Резерв N3AC07
#define  N3AC07__FM  DBB[1921]   // Значение фильтрации скачков  Резерв N3AC07
#define  N3AC07__FV  DBB[1922]   // Значение фильтрации скачков  Резерв N3AC07
#define  N3AC07__AM  DBB[1923]   // Количество циклов усреднения  Резерв N3AC07
#define  N3AC07__AV  DBB[1924]   // Количество циклов усреднения  Резерв N3AC07
#define  O4ZIOPO__M  DBB[1925]   // A4   Задвижку впуска острого пара ОТКРЫТЬ
#define  O4ZIOPC__M  DBB[1926]   // A4   Задвижку впуска острого пара ЗАКРЫТЬ
#define  O4ZIPPO__M  DBB[1927]   // A4   Задвижку впуска перепускного пара ОТКРЫТЬ
#define  O4ZIPPC__M  DBB[1928]   // A4   Задвижку впуска перепускного пара ЗАКРЫТЬ
#define  O4KIPO___M  DBB[1929]   // A4   Клапан впуска пара ОТКРЫТЬ
#define  O4KIPC___M  DBB[1930]   // A4   Клапан впуска пара ЗАКРЫТЬ
#define  O4ZOPPO__M  DBB[1931]   // A4   Задвижку выпуска перепускного пара ОТКРЫТЬ
#define  O4ZOPPC__M  DBB[1932]   // A4   Задвижку выпуска перепускного пара ЗАКРЫТЬ
#define  O4ZOPAO__M  DBB[1933]   // A4   Задвижку выпуска пара в атмосферу ОТКРЫТЬ
#define  O4ZOPAC__M  DBB[1934]   // A4   Задвижку выпуска пара в атмосферу ЗАКРЫТЬ
#define  O4KOPO___M  DBB[1935]   // A4   Клапан выпуска пара ОТКРЫТЬ
#define  O4KOPC___M  DBB[1936]   // A4   Клапан выпуска пара ЗАКРЫТЬ
#define  O4BELL___M  DBB[1937]   // A4   ЗВОНОК
#define  O4KOCO___M  DBB[1938]   // A4   Клапан сброса конденсата ОТКРЫТЬ
#define  O4KOCC___M  DBB[1939]   // A4   Клапан сброса конденсата ЗАКРЫТЬ
#define  O4VZO____M  DBB[1940]   // A4   Вакуумную задвижку ОТКРЫТЬ
#define  O4VZC____M  DBB[1941]   // A4   Вакуумную задвижку ЗАКРЫТЬ
#define  O4AZVO___M  DBB[1942]   // A4   Атмосферную задвижку на вак магистрали ОТКРЫТЬ
#define  O4VN_1___M  DBB[1943]   // A4   Вакуумный насос ВКЛЮЧИТЬ
#define  N44C06___M  DBB[1944]   // Резерв N44C06
#define  N44C07___M  DBB[1945]   // Резерв N44C07
#define  N44C08___M  DBB[1946]   // Резерв N44C08
#define  N44C09___M  DBB[1947]   // Резерв N44C09
#define  N44C10___M  DBB[1948]   // Резерв N44C10
#define  N44C11___M  DBB[1949]   // Резерв N44C11
#define  PCCS4WR__M  DBB[1950]   // A4   Флаг работы контроллера
#define  O4GNS____M  DBB[1951]   // A4   Управление гидронасосом
#define  O4HM1UP__M  DBB[1952]   // A4   Хомут1 ПОДНЯТЬ
#define  O4HM1DN__M  DBB[1953]   // A4   Хомут1 ОПУСТИТЬ
#define  O4KR1O___M  DBB[1954]   // A4   Крышка1 ОТКРЫТЬ
#define  O4KR1C___M  DBB[1955]   // A4   Крышка1 ЗАКРЫТЬ
#define  O4BY1O___M  DBB[1956]   // A4   Байонет1 ОТКРЫТЬ
#define  O4BY1C___M  DBB[1957]   // A4   Байонет1 ЗАКРЫТЬ
#define  O4HM2UP__M  DBB[1958]   // A4   Хомут2 ПОДНЯТЬ
#define  O4HM2DN__M  DBB[1959]   // A4   Хомут2 ОПУСТИТЬ
#define  O4KR2O___M  DBB[1960]   // A4   Крышка2 ОТКРЫТЬ
#define  O4KR2C___M  DBB[1961]   // A4   Крышка2 ЗАКРЫТЬ
#define  O4BY2O___M  DBB[1962]   // A4   Байонет2 ОТКРЫТЬ
#define  O4BY2C___M  DBB[1963]   // A4   Байонет2 ЗАКРЫТЬ
#define  AIT4TOPSZM  DBB[1964]   // Ноль шкалы  A4   Температура вверху автоклава
#define  AIT4TOPSZV  DBB[1965]   // Ноль шкалы  A4   Температура вверху автоклава
#define  AIT4TOPSDM  DBB[1966]   // Диапазон шкалы  A4   Температура вверху автоклава
#define  AIT4TOPSDV  DBB[1967]   // Диапазон шкалы  A4   Температура вверху автоклава
#define  AIT4TOPAZM  DBB[1968]   // Минимальное значение сигнализации  A4   Температура вверху автоклава
#define  AIT4TOPAZV  DBB[1969]   // Минимальное значение сигнализации  A4   Температура вверху автоклава
#define  AIT4TOPAMM  DBB[1970]   // Максимальное значение сигнализации  A4   Температура вверху автоклава
#define  AIT4TOPAMV  DBB[1971]   // Максимальное значение сигнализации  A4   Температура вверху автоклава
#define  AIT4TOP_FM  DBB[1972]   // Значение фильтрации скачков  A4   Температура вверху автоклава
#define  AIT4TOP_FV  DBB[1973]   // Значение фильтрации скачков  A4   Температура вверху автоклава
#define  AIT4TOP_AM  DBB[1974]   // Количество циклов усреднения  A4   Температура вверху автоклава
#define  AIT4TOP_AV  DBB[1975]   // Количество циклов усреднения  A4   Температура вверху автоклава
#define  AIT4BOTSZM  DBB[1976]   // Ноль шкалы  A4   Температура внизу автоклава
#define  AIT4BOTSZV  DBB[1977]   // Ноль шкалы  A4   Температура внизу автоклава
#define  AIT4BOTSDM  DBB[1978]   // Диапазон шкалы  A4   Температура внизу автоклава
#define  AIT4BOTSDV  DBB[1979]   // Диапазон шкалы  A4   Температура внизу автоклава
#define  AIT4BOTAZM  DBB[1980]   // Минимальное значение сигнализации  A4   Температура внизу автоклава
#define  AIT4BOTAZV  DBB[1981]   // Минимальное значение сигнализации  A4   Температура внизу автоклава
#define  AIT4BOTAMM  DBB[1982]   // Максимальное значение сигнализации  A4   Температура внизу автоклава
#define  AIT4BOTAMV  DBB[1983]   // Максимальное значение сигнализации  A4   Температура внизу автоклава
#define  AIT4BOT_FM  DBB[1984]   // Значение фильтрации скачков  A4   Температура внизу автоклава
#define  AIT4BOT_FV  DBB[1985]   // Значение фильтрации скачков  A4   Температура внизу автоклава
#define  AIT4BOT_AM  DBB[1986]   // Количество циклов усреднения  A4   Температура внизу автоклава
#define  AIT4BOT_AV  DBB[1987]   // Количество циклов усреднения  A4   Температура внизу автоклава
#define  AIT4P__SZM  DBB[1988]   // Ноль шкалы  A4   Температура пара автоклава
#define  AIT4P__SZV  DBB[1989]   // Ноль шкалы  A4   Температура пара автоклава
#define  AIT4P__SDM  DBB[1990]   // Диапазон шкалы  A4   Температура пара автоклава
#define  AIT4P__SDV  DBB[1991]   // Диапазон шкалы  A4   Температура пара автоклава
#define  AIT4P__AZM  DBB[1992]   // Минимальное значение сигнализации  A4   Температура пара автоклава
#define  AIT4P__AZV  DBB[1993]   // Минимальное значение сигнализации  A4   Температура пара автоклава
#define  AIT4P__AMM  DBB[1994]   // Максимальное значение сигнализации  A4   Температура пара автоклава
#define  AIT4P__AMV  DBB[1995]   // Максимальное значение сигнализации  A4   Температура пара автоклава
#define  AIT4P___FM  DBB[1996]   // Значение фильтрации скачков  A4   Температура пара автоклава
#define  AIT4P___FV  DBB[1997]   // Значение фильтрации скачков  A4   Температура пара автоклава
#define  AIT4P___AM  DBB[1998]   // Количество циклов усреднения  A4   Температура пара автоклава
#define  AIT4P___AV  DBB[1999]   // Количество циклов усреднения  A4   Температура пара автоклава
#define  S3ZIOP___V  DBB[2601]   // A3   Задвижка впуска острого пара
#define  S3ZIPP___V  DBB[2602]   // A3   Задвижка впуска перепускного пара
#define  S3KIP____V  DBB[2603]   // A3   Клапан впуска пара
#define  S3ZOPP___V  DBB[2604]   // A3   Задвижка выпуска перепускного пара
#define  S3ZOPA___V  DBB[2605]   // A3   Задвижка выпуска пара в атмосферу
#define  S3KOP____V  DBB[2606]   // A3   Клапан выпуска пара
#define  S3MDU____V  DBB[2607]   // A3   М/Д управление автоклавом
#define  S3VZ_____V  DBB[2608]   // A3   Вакуумная задвижка
#define  S3VN_____V  DBB[2609]   // A3   Вакуумный насос
#define  S3VNMD___V  DBB[2610]   // A3   М/Д управление вакуумным насосом
#define  S3MDUP___V  DBB[2611]   // A3   М/Д управление автоклавом пред сост
#define  S3GNS____V  DBB[2612]   // A3   Гидронасос
#define  S3LUCMD__V  DBB[2613]   // A3   М/Д управление крышкой
#define  S3KOC____V  DBB[2614]   // A3   Клапан сброса конденсата
#define  S3HM1____V  DBB[2615]   // A3   Хомут1
#define  S3KR1____V  DBB[2616]   // A3   Крышка1
#define  S3BY1____V  DBB[2617]   // A3   Байонет1
#define  S3P1_____V  DBB[2618]   // A3   Давление1
#define  S3SBP1___V  DBB[2619]   // A3   СБП1
#define  S3HM2____V  DBB[2620]   // A3   Хомут2
#define  S3KR2____V  DBB[2621]   // A3   Крышка2
#define  S3BY2____V  DBB[2622]   // A3   Байонет2
#define  S3P2_____V  DBB[2623]   // A3   Давление2
#define  S3SBP2___V  DBB[2624]   // A3   СБП2
#define  A3TTTB___V  DBB[2625]   // A3   Разница Т верха и Т низа АК
#define  A3STEP___V  DBB[2626]   // A3   Текущий шаг(режим) работы АК
#define  A3STEPH__V  DBB[2627]   // A3   Кол-во часов работы АК в текущем режиме
#define  A3STEPM__V  DBB[2628]   // A3   Кол-во минут работы АК в текущем режиме
#define  A3STEPS__V  DBB[2629]   // A3   Кол-во секунд работы АК в текущем режиме
#define  A3STEPC__V  DBB[2630]   // A3   Счетчик работы АК в текущем режиме
#define  U3ZIOP___V  DBB[2631]   // A3   Cостояние сигнала на задвижку впуска остр пара
#define  U3ZIPP___V  DBB[2632]   // A3   Cостояние сигнала на задвижку впуска переп пара
#define  U3KIP____V  DBB[2633]   // A3   Cостояние сигнала на клапан впуска пара
#define  U3ZOPP___V  DBB[2634]   // A3   Cостояние сигнала на задвижку выпуска переп пара
#define  U3ZOPA___V  DBB[2635]   // A3   Cостояние сигнала на задвижку выпуска пара в атмосферу
#define  U3KOP____V  DBB[2636]   // A3   Cостояние сигнала на клапан выпуска пара
#define  U3KOC____V  DBB[2637]   // A3   Cостояние сигнала на клапан сброса конденсата
#define  U3VZ_____V  DBB[2638]   // A3   Cостояние сигнала на вакуумную задвижку
#define  U3HM1____V  DBB[2639]   // A3   Cостояние сигнала на Хомут 1
#define  U3KR1____V  DBB[2640]   // A3   Cостояние сигнала на Крышку 1
#define  U3BY1____V  DBB[2641]   // A3   Cостояние сигнала на Байонет 1
#define  U3HM2____V  DBB[2642]   // A3   Cостояние сигнала на Хомут 2
#define  U3KR2____V  DBB[2643]   // A3   Cостояние сигнала на Крышку 2
#define  U3BY2____V  DBB[2644]   // A3   Cостояние сигнала на Байонет 2
#define  A3CYCRN__M  DBB[2645]   // A3   Запуск цикла
#define  A3CYCST__M  DBB[2646]   // A3   Остановка цикла
#define  A3ISPST__M  DBB[2647]   // A3   Остановка всех исполнителей
#define  A3CYCRN__V  DBB[2648]   // A3   Запуск цикла
#define  A3CYCST__V  DBB[2649]   // A3   Остановка цикла
#define  A3ISPST__V  DBB[2650]   // A3   Остановка всех исполнителей
#define  S4ZIOP___V  DBB[2651]   // A4   Задвижка впуска острого пара
#define  S4ZIPP___V  DBB[2652]   // A4   Задвижка впуска перепускного пара
#define  S4KIP____V  DBB[2653]   // A4   Клапан впуска пара
#define  S4ZOPP___V  DBB[2654]   // A4   Задвижка выпуска перепускного пара
#define  S4ZOPA___V  DBB[2655]   // A4   Задвижка выпуска пара в атмосферу
#define  S4KOP____V  DBB[2656]   // A4   Клапан выпуска пара
#define  S4MDU____V  DBB[2657]   // A4   М/Д управление автоклавом
#define  S4VZ_____V  DBB[2658]   // A4   Вакуумная задвижка
#define  S4VN_____V  DBB[2659]   // A4   Вакуумный насос
#define  S4VNMD___V  DBB[2660]   // A4   М/Д управление вакуумным насосом
#define  S4MDUP___V  DBB[2661]   // A4   М/Д управление автоклавом пред сост
#define  S4GNS____V  DBB[2662]   // A4   Гидронасос
#define  S4LUCMD__V  DBB[2663]   // A4   М/Д управление крышкой
#define  S4KOC____V  DBB[2664]   // A4   Клапан сброса конденсата
#define  S4HM1____V  DBB[2665]   // A4   Хомут1
#define  S4KR1____V  DBB[2666]   // A4   Крышка1
#define  S4BY1____V  DBB[2667]   // A4   Байонет1
#define  S4P1_____V  DBB[2668]   // A4   Давление1
#define  S4SBP1___V  DBB[2669]   // A4   СБП1
#define  S4HM2____V  DBB[2670]   // A4   Хомут2
#define  S4KR2____V  DBB[2671]   // A4   Крышка2
#define  S4BY2____V  DBB[2672]   // A4   Байонет2
#define  S4P2_____V  DBB[2673]   // A4   Давление2
#define  S4SBP2___V  DBB[2674]   // A4   СБП2
#define  A4TTTB___V  DBB[2675]   // A4   Разница Т верха и Т низа АК
#define  A4STEP___V  DBB[2676]   // A4   Текущий шаг(режим) работы АК
#define  A4STEPH__V  DBB[2677]   // A4   Кол-во часов работы АК в текущем режиме
#define  A4STEPM__V  DBB[2678]   // A4   Кол-во минут работы АК в текущем режиме
#define  A4STEPS__V  DBB[2679]   // A4   Кол-во секунд работы АК в текущем режиме
#define  A4STEPC__V  DBB[2680]   // A4   Счетчик работы АК в текущем режиме
#define  U4ZIOP___V  DBB[2681]   // A4   Cостояние сигнала на задвижку впуска остр пара
#define  U4ZIPP___V  DBB[2682]   // A4   Cостояние сигнала на задвижку впуска переп пара
#define  U4KIP____V  DBB[2683]   // A4   Cостояние сигнала на клапан впуска пара
#define  U4ZOPP___V  DBB[2684]   // A4   Cостояние сигнала на задвижку выпуска переп пара
#define  U4ZOPA___V  DBB[2685]   // A4   Cостояние сигнала на задвижку выпуска пара в атмосферу
#define  U4KOP____V  DBB[2686]   // A4   Cостояние сигнала на клапан выпуска пара
#define  U4KOC____V  DBB[2687]   // A4   Cостояние сигнала на клапан сброса конденсата
#define  U4VZ_____V  DBB[2688]   // A4   Cостояние сигнала на вакуумную задвижку
#define  U4HM1____V  DBB[2689]   // A4   Cостояние сигнала на Хомут 1
#define  U4KR1____V  DBB[2690]   // A4   Cостояние сигнала на Крышку 1
#define  U4BY1____V  DBB[2691]   // A4   Cостояние сигнала на Байонет 1
#define  U4HM2____V  DBB[2692]   // A4   Cостояние сигнала на Хомут 2
#define  U4KR2____V  DBB[2693]   // A4   Cостояние сигнала на Крышку 2
#define  U4BY2____V  DBB[2694]   // A4   Cостояние сигнала на Байонет 2
#define  A4CYCRN__M  DBB[2695]   // A4   Запуск цикла
#define  A4CYCST__M  DBB[2696]   // A4   Остановка цикла
#define  A4ISPST__M  DBB[2697]   // A4   Остановка всех исполнителей
#define  A4CYCRN__V  DBB[2698]   // A4   Запуск цикла
#define  A4CYCST__V  DBB[2699]   // A4   Остановка цикла
#define  A4ISPST__V  DBB[2700]   // A4   Остановка всех исполнителей
#define  A3STEPW__M  DBB[2803]   // A3   Текущий режим работы автоклава
#define  A4STEPW__M  DBB[2804]   // A4   Текущий режим работы автоклава
#define  A3STEPP__V  DBB[2813]   // A3   Предыдущий режим работы автоклава
#define  A4STEPP__V  DBB[2814]   // A4   Предыдущий режим работы автоклава
#define  A3STEPW__V  DBB[2823]   // A3   Текущий подшаг режима работы автоклава
#define  A4STEPW__V  DBB[2824]   // A4   Текущий подшаг режима работы автоклава
#define  A3STEPWP_V  DBB[2829]   // A3   Предыдущий подшаг режима работы автоклава
#define  A4STEPWP_V  DBB[2830]   // A4   Предыдущий подшаг режима работы автоклава
#define  A3STEPZ__V  DBB[2835]   // A3   Задание для счетчика текущего ожидания
#define  A4STEPZ__V  DBB[2836]   // A4   Задание для счетчика текущего ожидания
#define  A3RCKP___R  DBB[3301]   // A3   Регулятор конденсата.Коэффициент пропорциональности
#define  A3RCKI___R  DBB[3302]   // A3   Регулятор конденсата.Коэффициент интегрирования
#define  A3RCKD___R  DBB[3303]   // A3   Регулятор конденсата.Коэффициент дифференцирования
#define  A3RCKM___R  DBB[3304]   // A3   Регулятор конденсата.Коэффициент масштабирования
#define  A3RCKIML_R  DBB[3305]   // A3   Регулятор конденсата.Коэффициент длинны импульса
#define  A3RCKIMP_R  DBB[3306]   // A3   Регулятор конденсата.Коэффициент паузы импульса
#define  A3RCKZN__R  DBB[3307]   // A3   Регулятор конденсата.Зона нечуствительности
#define  A3RCHKF__R  DBB[3308]   // A3   Регулятор конденсата.Ход клапана полный (сек)
#define  A3RCHKN__R  DBB[3309]   // A3   Регулятор конденсата.Ход клапана минимальный (%)
#define  A3RCHKX__R  DBB[3310]   // A3   Регулятор конденсата.Ход клапана максимальный (%)
#define  A3RPKP___R  DBB[3311]   // A3   Регулятор давления.Коэффициент пропорциональности
#define  A3RPKI___R  DBB[3312]   // A3   Регулятор давления.Коэффициент интегрирования
#define  A3RPKD___R  DBB[3313]   // A3   Регулятор давления.Коэффициент дифференцирования
#define  A3RPKM___R  DBB[3314]   // A3   Регулятор давления.Коэффициент масштабирования
#define  A3RPKIML_R  DBB[3315]   // A3   Регулятор давления.Коэффициент длинны импульса
#define  A3RPKIMP_R  DBB[3316]   // A3   Регулятор давления.Коэффициент паузы импульса
#define  A3RPKZN__R  DBB[3317]   // A3   Регулятор давления.Зона нечуствительности
#define  A3RPHKF__R  DBB[3318]   // A3   Регулятор давления.Ход клапана полный (сек)
#define  A3RPHKN__R  DBB[3319]   // A3   Регулятор давления.Ход клапана минимальный (%)
#define  A3RPHKX__R  DBB[3320]   // A3   Регулятор давления.Ход клапана максимальный (%)
#define  A3NAKPP__R  DBB[3321]   // A3   Номер автоклава для перепуска пара
#define  A3RAZVK__R  DBB[3322]   // A3   Требуемое разрежение для вакуумирования
#define  A3PPP____R  DBB[3323]   // A3   Предел подъема давления
#define  A3PVIDH__R  DBB[3324]   // A3   Часы выдержки под давлением
#define  A3PVIDM__R  DBB[3325]   // A3   Минуты выдержки под давлением
#define  A3SPAT___R  DBB[3326]   // A3   Сброс давления в атмосферу
#define  A3SPAK___R  DBB[3327]   // A3   Сброс давления в акумулятор
#define  A3KIPZ___R  DBB[3328]   // A3   Задание положения клапана впуска пара
#define  A3KOPZ___R  DBB[3329]   // A3   Задание положения клапана выпуска пара
#define  A3KOCZ___R  DBB[3330]   // A3   Задание положения клапана слива конденсата
#define  A3TKRO___R  DBB[3331]   // A3   Время открытия крышки
#define  A3TKRO___C  DBB[3332]   // A3   Счетчик времени открытия крышки
#define  A3TKRC___R  DBB[3333]   // A3   Время закрытия крышки
#define  A3TKRC___C  DBB[3334]   // A3   Счетчик времени закрытия крышки
#define  A3TBYRT__R  DBB[3335]   // A3   Время проворачивания байонета
#define  A3TBYRT__C  DBB[3336]   // A3   Счетчик времени проворачивания байонета
#define  A3TZOPO__R  DBB[3337]   // A3   Время открытия задвижки острого пара
#define  A3TZOPO__C  DBB[3338]   // A3   Счетчик времени открытия задвижки острого пара
#define  A3TZPPO__R  DBB[3339]   // A3   Время открытия задвижки перепускного пара
#define  A3TZPPO__C  DBB[3340]   // A3   Счетчик времени открытия задвижки перепускного пара
#define  A3TZSPA__R  DBB[3341]   // A3   Время открытия задвижки сброса пара в атмосферу
#define  A3TZSPA__C  DBB[3342]   // A3   Счетчик времени открытия задвижки сброса пара в атмосферу
#define  A3TVZO___R  DBB[3343]   // A3   Время открытия вакуумной задвижки
#define  A3TVZO___C  DBB[3344]   // A3   Счетчик времени открытия вакуумной задвижки
#define  A3THMUP__R  DBB[3345]   // A3   Время поднятия хомута
#define  A3THMUP__C  DBB[3346]   // A3   Счетчик времени поднятия хомута
#define  A3TKLO___R  DBB[3347]   // A3   Время открытия клапана выпуска пара
#define  A3TKLO___C  DBB[3348]   // A3   Счетчик времени открытия клапана выпуска пара
#define  A3ZRZVK__R  DBB[3349]   // A3   Задание разрежения для вакуумирования
#define  A3MAXPM__R  DBB[3350]   // A3   Задание максимального давления в магистрали
#define  A3ZNPM___R  DBB[3351]   // A3   Задание зоны нечуствит давления в магистрали
#define  A3ZNVD___R  DBB[3352]   // A3   Задание зоны нечуствит при ВЫДЕРЖКЕ
#define  A3ZPPRE__R  DBB[3353]   // A3   Задание разницы давления окончания переброса
#define  A3ZPAKX__R  DBB[3354]   // A3   Задание максимального давления в автоклаве
#define  A3ZDTAK__R  DBB[3355]   // A3   Задание допустимой разницы температур в автоклаве
#define  A3TCMDON_R  DBB[3356]   // A3   Время наличия команды после сработки концевика
#define  A3RCRA___M  DBB[3357]   // A3   Регулятор конденсата.Ручное-Автомат.
#define  A3RCRA___V  DBB[3358]   // A3   Регулятор конденсата.Ручное-Автомат.
#define  A3RPRA___M  DBB[3359]   // A3   Регулятор давления.Ручное-Автомат.
#define  A3RPRA___V  DBB[3360]   // A3   Регулятор давления.Ручное-Автомат.
#define  A3RCMO___M  DBB[3361]   // A3   Регулятор конденсата.Выход ручного управления.
#define  A3RCMO___V  DBB[3362]   // A3   Регулятор конденсата.Выход ручного управления.
#define  A3RCZD___M  DBB[3363]   // A3   Регулятор конденсата.Задание регулятора.
#define  A3RCZD___V  DBB[3364]   // A3   Регулятор конденсата.Задание регулятора.
#define  A3RCLO___M  DBB[3365]   // A3   Регулятор конденсата.Ограничение выхода на клапан снизу.
#define  A3RCLO___V  DBB[3366]   // A3   Регулятор конденсата.Ограничение выхода на клапан снизу.
#define  A3RCHO___M  DBB[3367]   // A3   Регулятор конденсата.Ограничение выхода на клапан сверху.
#define  A3RCHO___V  DBB[3368]   // A3   Регулятор конденсата.Ограничение выхода на клапан сверху.
#define  A3RCLP___M  DBB[3369]   // A3   Регулятор конденсата.Ограничение выхода на прибор снизу.
#define  A3RCLP___V  DBB[3370]   // A3   Регулятор конденсата.Ограничение выхода на прибор снизу.
#define  A3RCHP___M  DBB[3371]   // A3   Регулятор конденсата.Ограничение выхода на прибор сверху.
#define  A3RCHP___V  DBB[3372]   // A3   Регулятор конденсата.Ограничение выхода на прибор сверху.
#define  A3RCOO___M  DBB[3373]   // A3   Регулятор конденсата.Аналоговый выход регулятора.
#define  A3RCOO___V  DBB[3374]   // A3   Регулятор конденсата.Аналоговый выход регулятора.
#define  A3RCUU___M  DBB[3375]   // A3   Регулятор конденсата.Дискретный выход регулятора.
#define  A3RCUU___V  DBB[3376]   // A3   Регулятор конденсата.Дискретный выход регулятора.
#define  A3RCX____V  DBB[3377]   // A3   Регулятор конденсата.Рассогласование выхода регулятора.
#define  A3RCCP___V  DBB[3378]   // A3   Регулятор конденсата.Счетчик паузы импульса.
#define  A3RCCW___V  DBB[3379]   // A3   Регулятор конденсата.Счетчик длинны импульса.
#define  A3RPMO1__M  DBB[3380]   // A3   Регулятор давления.Выход ручного управления.
#define  A3RPMO1__V  DBB[3381]   // A3   Регулятор давления.Выход ручного управления.
#define  A3RPZD___M  DBB[3382]   // A3   Регулятор давления.Задание регулятора.
#define  A3RPZD___V  DBB[3383]   // A3   Регулятор давления.Задание регулятора.
#define  A3RPLO___M  DBB[3384]   // A3   Регулятор давления.Ограничение выхода на клапан снизу.
#define  A3RPLO___V  DBB[3385]   // A3   Регулятор давления.Ограничение выхода на клапан снизу.
#define  A3RPHO___M  DBB[3386]   // A3   Регулятор давления.Ограничение выхода на клапан сверху.
#define  A3RPHO___V  DBB[3387]   // A3   Регулятор давления.Ограничение выхода на клапан сверху.
#define  A3RPLP___M  DBB[3388]   // A3   Регулятор давления.Ограничение выхода на прибор снизу.
#define  A3RPLP___V  DBB[3389]   // A3   Регулятор давления.Ограничение выхода на прибор снизу.
#define  A3RPHP___M  DBB[3390]   // A3   Регулятор давления.Ограничение выхода на прибор сверху.
#define  A3RPHP___V  DBB[3391]   // A3   Регулятор давления.Ограничение выхода на прибор сверху.
#define  A3RPOO___M  DBB[3392]   // A3   Регулятор давления.Аналоговый выход регулятора.
#define  A3RPOO___V  DBB[3393]   // A3   Регулятор давления.Аналоговый выход регулятора.
#define  A3RPUU1__M  DBB[3394]   // A3   Регулятор давления.Дискретный выход регулятора.
#define  A3RPUU1__V  DBB[3395]   // A3   Регулятор давления.Дискретный выход регулятора.
#define  A3RPX1___V  DBB[3396]   // A3   Регулятор давления.Рассогласование выхода регулятора.
#define  A3RPCP1__V  DBB[3397]   // A3   Регулятор давления.Счетчик паузы импульса.
#define  A3RPCW1__V  DBB[3398]   // A3   Регулятор давления.Счетчик длинны импульса.
#define  A4RCKP___R  DBB[3401]   // A4   Регулятор конденсата.Коэффициент пропорциональности
#define  A4RCKI___R  DBB[3402]   // A4   Регулятор конденсата.Коэффициент интегрирования
#define  A4RCKD___R  DBB[3403]   // A4   Регулятор конденсата.Коэффициент дифференцирования
#define  A4RCKM___R  DBB[3404]   // A4   Регулятор конденсата.Коэффициент масштабирования
#define  A4RCKIML_R  DBB[3405]   // A4   Регулятор конденсата.Коэффициент длинны импульса
#define  A4RCKIMP_R  DBB[3406]   // A4   Регулятор конденсата.Коэффициент паузы импульса
#define  A4RCKZN__R  DBB[3407]   // A4   Регулятор конденсата.Зона нечуствительности
#define  A4RCHKF__R  DBB[3408]   // A4   Регулятор конденсата.Ход клапана полный (сек)
#define  A4RCHKN__R  DBB[3409]   // A4   Регулятор конденсата.Ход клапана минимальный (%)
#define  A4RCHKX__R  DBB[3410]   // A4   Регулятор конденсата.Ход клапана максимальный (%)
#define  A4RPKP___R  DBB[3411]   // A4   Регулятор давления.Коэффициент пропорциональности
#define  A4RPKI___R  DBB[3412]   // A4   Регулятор давления.Коэффициент интегрирования
#define  A4RPKD___R  DBB[3413]   // A4   Регулятор давления.Коэффициент дифференцирования
#define  A4RPKM___R  DBB[3414]   // A4   Регулятор давления.Коэффициент масштабирования
#define  A4RPKIML_R  DBB[3415]   // A4   Регулятор давления.Коэффициент длинны импульса
#define  A4RPKIMP_R  DBB[3416]   // A4   Регулятор давления.Коэффициент паузы импульса
#define  A4RPKZN__R  DBB[3417]   // A4   Регулятор давления.Зона нечуствительности
#define  A4RPHKF__R  DBB[3418]   // A4   Регулятор давления.Ход клапана полный (сек)
#define  A4RPHKN__R  DBB[3419]   // A4   Регулятор давления.Ход клапана минимальный (%)
#define  A4RPHKX__R  DBB[3420]   // A4   Регулятор давления.Ход клапана максимальный (%)
#define  A4NAKPP__R  DBB[3421]   // A4   Номер автоклава для перепуска пара
#define  A4RAZVK__R  DBB[3422]   // A4   Требуемое разрежение для вакуумирования
#define  A4PPP____R  DBB[3423]   // A4   Предел подъема давления
#define  A4PVIDH__R  DBB[3424]   // A4   Часы выдержки под давлением
#define  A4PVIDM__R  DBB[3425]   // A4   Минуты выдержки под давлением
#define  A4SPAT___R  DBB[3426]   // A4   Сброс давления в атмосферу
#define  A4SPAK___R  DBB[3427]   // A4   Сброс давления в акумулятор
#define  A4KIPZ___R  DBB[3428]   // A4   Задание положения клапана впуска пара
#define  A4KOPZ___R  DBB[3429]   // A4   Задание положения клапана выпуска пара
#define  A4KOCZ___R  DBB[3430]   // A4   Задание положения клапана слива конденсата
#define  A4TKRO___R  DBB[3431]   // A4   Время открытия крышки
#define  A4TKRO___C  DBB[3432]   // A4   Счетчик времени открытия крышки
#define  A4TKRC___R  DBB[3433]   // A4   Время закрытия крышки
#define  A4TKRC___C  DBB[3434]   // A4   Счетчик времени закрытия крышки
#define  A4TBYRT__R  DBB[3435]   // A4   Время проворачивания байонета
#define  A4TBYRT__C  DBB[3436]   // A4   Счетчик времени проворачивания байонета
#define  A4TZOPO__R  DBB[3437]   // A4   Время открытия задвижки острого пара
#define  A4TZOPO__C  DBB[3438]   // A4   Счетчик времени открытия задвижки острого пара
#define  A4TZPPO__R  DBB[3439]   // A4   Время открытия задвижки перепускного пара
#define  A4TZPPO__C  DBB[3440]   // A4   Счетчик времени открытия задвижки перепускного пара
#define  A4TZSPA__R  DBB[3441]   // A4   Время открытия задвижки сброса пара в атмосферу
#define  A4TZSPA__C  DBB[3442]   // A4   Счетчик времени открытия задвижки сброса пара в атмосферу
#define  A4TVZO___R  DBB[3443]   // A4   Время открытия вакуумной задвижки
#define  A4TVZO___C  DBB[3444]   // A4   Счетчик времени открытия вакуумной задвижки
#define  A4THMUP__R  DBB[3445]   // A4   Время поднятия хомута
#define  A4THMUP__C  DBB[3446]   // A4   Счетчик времени поднятия хомута
#define  A4TKLO___R  DBB[3447]   // A4   Время открытия клапана выпуска пара
#define  A4TKLO___C  DBB[3448]   // A4   Счетчик времени открытия клапана выпуска пара
#define  A4ZRZVK__R  DBB[3449]   // A4   Задание разрежения для вакуумирования
#define  A4MAXPM__R  DBB[3450]   // A4   Задание максимального давления в магистрали
#define  A4ZNPM___R  DBB[3451]   // A4   Задание зоны нечуствит давления в магистрали
#define  A4ZNVD___R  DBB[3452]   // A4   Задание зоны нечуствит при ВЫДЕРЖКЕ
#define  A4ZPPRE__R  DBB[3453]   // A4   Задание разницы давления окончания переброса
#define  A4ZPAKX__R  DBB[3454]   // A4   Задание максимального давления в автоклаве
#define  A4ZDTAK__R  DBB[3455]   // A4   Задание допустимой разницы температур в автоклаве
#define  A4TCMDON_R  DBB[3456]   // A4   Время наличия команды после сработки концевика
#define  A4RCRA___M  DBB[3457]   // A4   Регулятор конденсата.Ручное-Автомат.
#define  A4RCRA___V  DBB[3458]   // A4   Регулятор конденсата.Ручное-Автомат.
#define  A4RPRA___M  DBB[3459]   // A4   Регулятор давления.Ручное-Автомат.
#define  A4RPRA___V  DBB[3460]   // A4   Регулятор давления.Ручное-Автомат.
#define  A4RCMO___M  DBB[3461]   // A4   Регулятор конденсата.Выход ручного управления.
#define  A4RCMO___V  DBB[3462]   // A4   Регулятор конденсата.Выход ручного управления.
#define  A4RCZD___M  DBB[3463]   // A4   Регулятор конденсата.Задание регулятора.
#define  A4RCZD___V  DBB[3464]   // A4   Регулятор конденсата.Задание регулятора.
#define  A4RCLO___M  DBB[3465]   // A4   Регулятор конденсата.Ограничение выхода на клапан снизу.
#define  A4RCLO___V  DBB[3466]   // A4   Регулятор конденсата.Ограничение выхода на клапан снизу.
#define  A4RCHO___M  DBB[3467]   // A4   Регулятор конденсата.Ограничение выхода на клапан сверху.
#define  A4RCHO___V  DBB[3468]   // A4   Регулятор конденсата.Ограничение выхода на клапан сверху.
#define  A4RCLP___M  DBB[3469]   // A4   Регулятор конденсата.Ограничение выхода на прибор снизу.
#define  A4RCLP___V  DBB[3470]   // A4   Регулятор конденсата.Ограничение выхода на прибор снизу.
#define  A4RCHP___M  DBB[3471]   // A4   Регулятор конденсата.Ограничение выхода на прибор сверху.
#define  A4RCHP___V  DBB[3472]   // A4   Регулятор конденсата.Ограничение выхода на прибор сверху.
#define  A4RCOO___M  DBB[3473]   // A4   Регулятор конденсата.Аналоговый выход регулятора.
#define  A4RCOO___V  DBB[3474]   // A4   Регулятор конденсата.Аналоговый выход регулятора.
#define  A4RCUU___M  DBB[3475]   // A4   Регулятор конденсата.Дискретный выход регулятора.
#define  A4RCUU___V  DBB[3476]   // A4   Регулятор конденсата.Дискретный выход регулятора.
#define  A4RCX____V  DBB[3477]   // A4   Регулятор конденсата.Рассогласование выхода регулятора.
#define  A4RCCP___V  DBB[3478]   // A4   Регулятор конденсата.Счетчик паузы импульса.
#define  A4RCCW___V  DBB[3479]   // A4   Регулятор конденсата.Счетчик длинны импульса.
#define  A4RPMO1__M  DBB[3480]   // A4   Регулятор давления.Выход ручного управления.
#define  A4RPMO1__V  DBB[3481]   // A4   Регулятор давления.Выход ручного управления.
#define  A4RPZD___M  DBB[3482]   // A4   Регулятор давления.Задание регулятора.
#define  A4RPZD___V  DBB[3483]   // A4   Регулятор давления.Задание регулятора.
#define  A4RPLO___M  DBB[3484]   // A4   Регулятор давления.Ограничение выхода на клапан снизу.
#define  A4RPLO___V  DBB[3485]   // A4   Регулятор давления.Ограничение выхода на клапан снизу.
#define  A4RPHO___M  DBB[3486]   // A4   Регулятор давления.Ограничение выхода на клапан сверху.
#define  A4RPHO___V  DBB[3487]   // A4   Регулятор давления.Ограничение выхода на клапан сверху.
#define  A4RPLP___M  DBB[3488]   // A4   Регулятор давления.Ограничение выхода на прибор снизу.
#define  A4RPLP___V  DBB[3489]   // A4   Регулятор давления.Ограничение выхода на прибор снизу.
#define  A4RPHP___M  DBB[3490]   // A4   Регулятор давления.Ограничение выхода на прибор сверху.
#define  A4RPHP___V  DBB[3491]   // A4   Регулятор давления.Ограничение выхода на прибор сверху.
#define  A4RPOO___M  DBB[3492]   // A4   Регулятор давления.Аналоговый выход регулятора.
#define  A4RPOO___V  DBB[3493]   // A4   Регулятор давления.Аналоговый выход регулятора.
#define  A4RPUU1__M  DBB[3494]   // A4   Регулятор давления.Дискретный выход регулятора.
#define  A4RPUU1__V  DBB[3495]   // A4   Регулятор давления.Дискретный выход регулятора.
#define  A4RPX1___V  DBB[3496]   // A4   Регулятор давления.Рассогласование выхода регулятора.
#define  A4RPCP1__V  DBB[3497]   // A4   Регулятор давления.Счетчик паузы импульса.
#define  A4RPCW1__V  DBB[3498]   // A4   Регулятор давления.Счетчик длинны импульса.
#define  A3RPMO2__M  DBB[3801]   // A3   Регулятор давления выпуска пара.Выход ручного управления.
#define  A3RPMO2__V  DBB[3802]   // A3   Регулятор давления выпуска пара.Выход ручного управления.
#define  A3RPUU2__M  DBB[3803]   // A3   Регулятор давления выпуска пара.Дискретный выход регулятора.
#define  A3RPUU2__V  DBB[3804]   // A3   Регулятор давления выпуска пара.Дискретный выход регулятора.
#define  A3RPX2___V  DBB[3805]   // A3   Регулятор давления выпуска пара.Рассогласование выхода регулятора.
#define  A3RPCP2__V  DBB[3806]   // A3   Регулятор давления выпуска пара.Счетчик паузы импульса.
#define  A3RPCW2__V  DBB[3807]   // A3   Регулятор давления выпуска пара.Счетчик длинны импульса.
#define  A3TBONIS_R  DBB[3808]   // A3   Время задержки перед включением исполнителей.
#define  A3NAKPP_YM  DBB[3809]   // A3   Включение в цикл режима ПЕРЕПУСК ПАРА
#define  A3NAKPP_YV  DBB[3810]   // A3   Включение в цикл режима ПЕРЕПУСК ПАРА
#define  A3RAZVK_YM  DBB[3811]   // A3   Включение в цикл режима ВАКУУМИРОВАНИЯ
#define  A3RAZVK_YV  DBB[3812]   // A3   Включение в цикл режима ВАКУУМИРОВАНИЯ
#define  A3PPP___YM  DBB[3813]   // A3   Включение в цикл режима ПОДЪЕМ ДАВЛЕНИЯ
#define  A3PPP___YV  DBB[3814]   // A3   Включение в цикл режима ПОДЪЕМ ДАВЛЕНИЯ
#define  A3PVID__YM  DBB[3815]   // A3   Включение в цикл режима ВЫДЕРЖКА ПОД ДАВЛЕНИЕМ
#define  A3PVID__YV  DBB[3816]   // A3   Включение в цикл режима ВЫДЕРЖКА ПОД ДАВЛЕНИЕМ
#define  A3SP____YM  DBB[3817]   // A3   Включение в цикл режима СБРОС ДАВЛЕНИЯ
#define  A3SP____YV  DBB[3818]   // A3   Включение в цикл режима СБРОС ДАВЛЕНИЯ
#define  A3RCAOTR_V  DBB[3819]   // A3   Аналоговый выход для тренда регулятора конденсата
#define  A3RCPKTR_V  DBB[3820]   // A3   Положение клапана для тренда регулятора конденсата
#define  A3RPAOTR_V  DBB[3821]   // A3   Аналоговый выход для тренда регулятора набора давления
#define  A3RPPKTR_V  DBB[3822]   // A3   Положение клапана для тренда регулятора набора давления
#define  A3RPTATR_V  DBB[3823]   // A3   Температура АК для тренда регулятора набора давления
#define  A3RCOUT__V  DBB[3824]   // A3   Флаг формирования выхода на клапан
#define  A3RPOUT__V  DBB[3825]   // A3   Флаг формирования выхода на клапан
#define  A3STEPHP_V  DBB[3826]   // A3   Кол-во часов работы АК в предыдущем режиме
#define  A3STEPMP_V  DBB[3827]   // A3   Кол-во минут работы АК в предыдущем режиме
#define  A3STEPSP_V  DBB[3828]   // A3   Кол-во секунд работы АК в предыдущем режиме
#define  A3PPSTEP_V  DBB[3829]   // A3   шаг режима перепуска
#define  A3ZDSTAT_V  DBB[3830]   // A3   состояние задвижек
#define  A3RPOUF1_M  DBB[3831]   // A3   флаг режима работы регулятора в руч режиме
#define  A3RPOUF1_V  DBB[3832]   // A3   флаг режима работы регулятора в руч режиме
#define  A3RPOUF2_M  DBB[3833]   // A3   флаг режима работы регулятора в руч режиме
#define  A3RPOUF2_V  DBB[3834]   // A3   флаг режима работы регулятора в руч режиме
#define  A3RCOUF__M  DBB[3835]   // A3   флаг режима работы регулятора в руч режиме
#define  A3RCOUF__V  DBB[3836]   // A3   флаг режима работы регулятора в руч режиме
#define  A3KRSTAT_V  DBB[3837]   // A3   состояние исполнителей крышек
#define  A3CPPSTEPV  DBB[3838]   // A3   шаг контроля обмена для текущего АК
#define  A3RPPSTEPV  DBB[3839]   // A3   шаг для обмена с удаленного АК
#define  A3IPPNUM_V  DBB[3840]   // A3   номер АК-инициатора
#define  A3IPPSTEPV  DBB[3841]   // A3   текущий шаг на АК-инициаторе
#define  A4RPMO2__M  DBB[3851]   // A4   Регулятор давления выпуска пара.Выход ручного управления.
#define  A4RPMO2__V  DBB[3852]   // A4   Регулятор давления выпуска пара.Выход ручного управления.
#define  A4RPUU2__M  DBB[3853]   // A4   Регулятор давления выпуска пара.Дискретный выход регулятора.
#define  A4RPUU2__V  DBB[3854]   // A4   Регулятор давления выпуска пара.Дискретный выход регулятора.
#define  A4RPX2___V  DBB[3855]   // A4   Регулятор давления выпуска пара.Рассогласование выхода регулятора.
#define  A4RPCP2__V  DBB[3856]   // A4   Регулятор давления выпуска пара.Счетчик паузы импульса.
#define  A4RPCW2__V  DBB[3857]   // A4   Регулятор давления выпуска пара.Счетчик длинны импульса.
#define  A4TBONIS_R  DBB[3858]   // A4   Время задержки перед включением исполнителей.
#define  A4NAKPP_YM  DBB[3859]   // A4   Включение в цикл режима ПЕРЕПУСК ПАРА
#define  A4NAKPP_YV  DBB[3860]   // A4   Включение в цикл режима ПЕРЕПУСК ПАРА
#define  A4RAZVK_YM  DBB[3861]   // A4   Включение в цикл режима ВАКУУМИРОВАНИЯ
#define  A4RAZVK_YV  DBB[3862]   // A4   Включение в цикл режима ВАКУУМИРОВАНИЯ
#define  A4PPP___YM  DBB[3863]   // A4   Включение в цикл режима ПОДЪЕМ ДАВЛЕНИЯ
#define  A4PPP___YV  DBB[3864]   // A4   Включение в цикл режима ПОДЪЕМ ДАВЛЕНИЯ
#define  A4PVID__YM  DBB[3865]   // A4   Включение в цикл режима ВЫДЕРЖКА ПОД ДАВЛЕНИЕМ
#define  A4PVID__YV  DBB[3866]   // A4   Включение в цикл режима ВЫДЕРЖКА ПОД ДАВЛЕНИЕМ
#define  A4SP____YM  DBB[3867]   // A4   Включение в цикл режима СБРОС ДАВЛЕНИЯ
#define  A4SP____YV  DBB[3868]   // A4   Включение в цикл режима СБРОС ДАВЛЕНИЯ
#define  A4RCAOTR_V  DBB[3869]   // A4   Аналоговый выход для тренда регулятора конденсата
#define  A4RCPKTR_V  DBB[3870]   // A4   Положение клапана для тренда регулятора конденсата
#define  A4RPAOTR_V  DBB[3871]   // A4   Аналоговый выход для тренда регулятора набора давления
#define  A4RPPKTR_V  DBB[3872]   // A4   Положение клапана для тренда регулятора набора давления
#define  A4RPTATR_V  DBB[3873]   // A4   Температура АК для тренда регулятора набора давления
#define  A4RCOUT__V  DBB[3874]   // A4   Флаг формирования выхода на клапан
#define  A4RPOUT__V  DBB[3875]   // A4   Флаг формирования выхода на клапан
#define  A4STEPHP_V  DBB[3876]   // A4   Кол-во часов работы АК в предыдущем режиме
#define  A4STEPMP_V  DBB[3877]   // A4   Кол-во минут работы АК в предыдущем режиме
#define  A4STEPSP_V  DBB[3878]   // A4   Кол-во секунд работы АК в предыдущем режиме
#define  A4PPSTEP_V  DBB[3879]   // A4   шаг режима перепуска
#define  A4ZDSTAT_V  DBB[3880]   // A4   состояние задвижек
#define  A4RPOUF1_M  DBB[3881]   // A4   флаг режима работы регулятора в руч режиме
#define  A4RPOUF1_V  DBB[3882]   // A4   флаг режима работы регулятора в руч режиме
#define  A4RPOUF2_M  DBB[3883]   // A4   флаг режима работы регулятора в руч режиме
#define  A4RPOUF2_V  DBB[3884]   // A4   флаг режима работы регулятора в руч режиме
#define  A4RCOUF__M  DBB[3885]   // A4   флаг режима работы регулятора в руч режиме
#define  A4RCOUF__V  DBB[3886]   // A4   флаг режима работы регулятора в руч режиме
#define  A4KRSTAT_V  DBB[3887]   // A4   состояние исполнителей крышек
#define  A4CPPSTEPV  DBB[3888]   // A4   шаг контроля обмена для текущего АК
#define  A4RPPSTEPV  DBB[3889]   // A4   шаг для обмена с удаленного АК
#define  A4IPPNUM_V  DBB[3890]   // A4   номер АК-инициатора
#define  A4IPPSTEPV  DBB[3891]   // A4   текущий шаг на АК-инициаторе
#define  A31NTPP01R  DBB[5001]   // A3 Реж1 Температура 1 при наборе температуры перепуск паром
#define  A31NTPF01R  DBB[5002]   // A3 Реж1 Расход 1 при наборе температуры перепуск паром
#define  A31NTPP02R  DBB[5003]   // A3 Реж1 Температура 2 при наборе температуры перепуск паром
#define  A31NTPF02R  DBB[5004]   // A3 Реж1 Расход 2 при наборе температуры перепуск паром
#define  A31NTPP03R  DBB[5005]   // A3 Реж1 Температура 3 при наборе температуры перепуск паром
#define  A31NTPF03R  DBB[5006]   // A3 Реж1 Расход 3 при наборе температуры перепуск паром
#define  A31NTPP04R  DBB[5007]   // A3 Реж1 Температура 4 при наборе температуры перепуск паром
#define  A31NTPF04R  DBB[5008]   // A3 Реж1 Расход 4 при наборе температуры перепуск паром
#define  A31NTPP05R  DBB[5009]   // A3 Реж1 Температура 5 при наборе температуры перепуск паром
#define  A31NTPF05R  DBB[5010]   // A3 Реж1 Расход 5 при наборе температуры перепуск паром
#define  A31NTOP01R  DBB[5011]   // A3 Реж1 Температура 1 при наборе температуры острым паром
#define  A31NTOF01R  DBB[5012]   // A3 Реж1 Расход 1 при наборе температуры острым паром
#define  A31NTOP02R  DBB[5013]   // A3 Реж1 Температура 2 при наборе температуры острым паром
#define  A31NTOF02R  DBB[5014]   // A3 Реж1 Расход 2 при наборе температуры острым паром
#define  A31NTOP03R  DBB[5015]   // A3 Реж1 Температура 3 при наборе температуры острым паром
#define  A31NTOF03R  DBB[5016]   // A3 Реж1 Расход 3 при наборе температуры острым паром
#define  A31NTOP04R  DBB[5017]   // A3 Реж1 Температура 4 при наборе температуры острым паром
#define  A31NTOF04R  DBB[5018]   // A3 Реж1 Расход 4 при наборе температуры острым паром
#define  A31NTOP05R  DBB[5019]   // A3 Реж1 Температура 5 при наборе температуры острым паром
#define  A31NTOF05R  DBB[5020]   // A3 Реж1 Расход 5 при наборе температуры острым паром
#define  A31NPPP01R  DBB[5021]   // A3 Реж1 Давление 1 при наборе давления перепуск паром
#define  A31NPPF01R  DBB[5022]   // A3 Реж1 Расход 1 при наборе давления перепуск паром
#define  A31NPPP02R  DBB[5023]   // A3 Реж1 Давление 2 при наборе давления перепуск паром
#define  A31NPPF02R  DBB[5024]   // A3 Реж1 Расход 2 при наборе давления перепуск паром
#define  A31NPPP03R  DBB[5025]   // A3 Реж1 Давление 3 при наборе давления перепуск паром
#define  A31NPPF03R  DBB[5026]   // A3 Реж1 Расход 3 при наборе давления перепуск паром
#define  A31NPPP04R  DBB[5027]   // A3 Реж1 Давление 4 при наборе давления перепуск паром
#define  A31NPPF04R  DBB[5028]   // A3 Реж1 Расход 4 при наборе давления перепуск паром
#define  A31NPPP05R  DBB[5029]   // A3 Реж1 Давление 5 при наборе давления перепуск паром
#define  A31NPPF05R  DBB[5030]   // A3 Реж1 Расход 5 при наборе давления перепуск паром
#define  A31NPPP06R  DBB[5031]   // A3 Реж1 Давление 6 при наборе давления перепуск паром
#define  A31NPPF06R  DBB[5032]   // A3 Реж1 Расход 6 при наборе давления перепуск паром
#define  A31NPPP07R  DBB[5033]   // A3 Реж1 Давление 7 при наборе давления перепуск паром
#define  A31NPPF07R  DBB[5034]   // A3 Реж1 Расход 7 при наборе давления перепуск паром
#define  A31NPPP08R  DBB[5035]   // A3 Реж1 Давление 8 при наборе давления перепуск паром
#define  A31NPPF08R  DBB[5036]   // A3 Реж1 Расход 8 при наборе давления перепуск паром
#define  A31NPPP09R  DBB[5037]   // A3 Реж1 Давление 9 при наборе давления перепуск паром
#define  A31NPPF09R  DBB[5038]   // A3 Реж1 Расход 9 при наборе давления перепуск паром
#define  A31NPPP10R  DBB[5039]   // A3 Реж1 Давление 10 при наборе давления перепуск паром
#define  A31NPPF10R  DBB[5040]   // A3 Реж1 Расход 10 при наборе давления перепуск паром
#define  A31NPOP01R  DBB[5041]   // A3 Реж1 Давление 1 при наборе давления острым паром
#define  A31NPOF01R  DBB[5042]   // A3 Реж1 Расход 1 при наборе давления острым паром
#define  A31NPOP02R  DBB[5043]   // A3 Реж1 Давление 2 при наборе давления острым паром
#define  A31NPOF02R  DBB[5044]   // A3 Реж1 Расход 2 при наборе давления острым паром
#define  A31NPOP03R  DBB[5045]   // A3 Реж1 Давление 3 при наборе давления острым паром
#define  A31NPOF03R  DBB[5046]   // A3 Реж1 Расход 3 при наборе давления острым паром
#define  A31NPOP04R  DBB[5047]   // A3 Реж1 Давление 4 при наборе давления острым паром
#define  A31NPOF04R  DBB[5048]   // A3 Реж1 Расход 4 при наборе давления острым паром
#define  A31NPOP05R  DBB[5049]   // A3 Реж1 Давление 5 при наборе давления острым паром
#define  A31NPOF05R  DBB[5050]   // A3 Реж1 Расход 5 при наборе давления острым паром
#define  A31NPOP06R  DBB[5051]   // A3 Реж1 Давление 6 при наборе давления острым паром
#define  A31NPOF06R  DBB[5052]   // A3 Реж1 Расход 6 при наборе давления острым паром
#define  A31NPOP07R  DBB[5053]   // A3 Реж1 Давление 7 при наборе давления острым паром
#define  A31NPOF07R  DBB[5054]   // A3 Реж1 Расход 7 при наборе давления острым паром
#define  A31NPOP08R  DBB[5055]   // A3 Реж1 Давление 8 при наборе давления острым паром
#define  A31NPOF08R  DBB[5056]   // A3 Реж1 Расход 8 при наборе давления острым паром
#define  A31NPOP09R  DBB[5057]   // A3 Реж1 Давление 9 при наборе давления острым паром
#define  A31NPOF09R  DBB[5058]   // A3 Реж1 Расход 9 при наборе давления острым паром
#define  A31NPOP10R  DBB[5059]   // A3 Реж1 Давление 10 при наборе давления острым паром
#define  A31NPOF10R  DBB[5060]   // A3 Реж1 Расход 10 при наборе давления острым паром
#define  A31SPAP01R  DBB[5061]   // A3 Реж1 Давление 1 при сбросе давления в атмосферу
#define  A31SPAK01R  DBB[5062]   // A3 Реж1 Клапан 1 при сбросе давления в атмосферу
#define  A31SPAP02R  DBB[5063]   // A3 Реж1 Давление 2 при сбросе давления в атмосферу
#define  A31SPAK02R  DBB[5064]   // A3 Реж1 Клапан 2 при сбросе давления в атмосферу
#define  A31SPAP03R  DBB[5065]   // A3 Реж1 Давление 3 при сбросе давления в атмосферу
#define  A31SPAK03R  DBB[5066]   // A3 Реж1 Клапан 3 при сбросе давления в атмосферу
#define  A31SPAP04R  DBB[5067]   // A3 Реж1 Давление 4 при сбросе давления в атмосферу
#define  A31SPAK04R  DBB[5068]   // A3 Реж1 Клапан 4 при сбросе давления в атмосферу
#define  A31SPAP05R  DBB[5069]   // A3 Реж1 Давление 5 при сбросе давления в атмосферу
#define  A31SPAK05R  DBB[5070]   // A3 Реж1 Клапан 5 при сбросе давления в атмосферу
#define  A31SPKP01R  DBB[5071]   // A3 Реж1 Давление 1 при сбросе давления в акумулятор
#define  A31SPKK01R  DBB[5072]   // A3 Реж1 Клапан 1 при сбросе давления в акумулятор
#define  A31SPKP02R  DBB[5073]   // A3 Реж1 Давление 2 при сбросе давления в акумулятор
#define  A31SPKK02R  DBB[5074]   // A3 Реж1 Клапан 2 при сбросе давления в акумулятор
#define  A31SPKP03R  DBB[5075]   // A3 Реж1 Давление 3 при сбросе давления в акумулятор
#define  A31SPKK03R  DBB[5076]   // A3 Реж1 Клапан 3 при сбросе давления в акумулятор
#define  A31SPKP04R  DBB[5077]   // A3 Реж1 Давление 4 при сбросе давления в акумулятор
#define  A31SPKK04R  DBB[5078]   // A3 Реж1 Клапан 4 при сбросе давления в акумулятор
#define  A31SPKP05R  DBB[5079]   // A3 Реж1 Давление 5 при сбросе давления в акумулятор
#define  A31SPKK05R  DBB[5080]   // A3 Реж1 Клапан 5 при сбросе давления в акумулятор
#define  A32NTPP01R  DBB[5101]   // A3 Реж2 Температура 1 при наборе температуры перепуск паром
#define  A32NTPF01R  DBB[5102]   // A3 Реж2 Расход 1 при наборе температуры перепуск паром
#define  A32NTPP02R  DBB[5103]   // A3 Реж2 Температура 2 при наборе температуры перепуск паром
#define  A32NTPF02R  DBB[5104]   // A3 Реж2 Расход 2 при наборе температуры перепуск паром
#define  A32NTPP03R  DBB[5105]   // A3 Реж2 Температура 3 при наборе температуры перепуск паром
#define  A32NTPF03R  DBB[5106]   // A3 Реж2 Расход 3 при наборе температуры перепуск паром
#define  A32NTPP04R  DBB[5107]   // A3 Реж2 Температура 4 при наборе температуры перепуск паром
#define  A32NTPF04R  DBB[5108]   // A3 Реж2 Расход 4 при наборе температуры перепуск паром
#define  A32NTPP05R  DBB[5109]   // A3 Реж2 Температура 5 при наборе температуры перепуск паром
#define  A32NTPF05R  DBB[5110]   // A3 Реж2 Расход 5 при наборе температуры перепуск паром
#define  A32NTOP01R  DBB[5111]   // A3 Реж2 Температура 1 при наборе температуры острым паром
#define  A32NTOF01R  DBB[5112]   // A3 Реж2 Расход 1 при наборе температуры острым паром
#define  A32NTOP02R  DBB[5113]   // A3 Реж2 Температура 2 при наборе температуры острым паром
#define  A32NTOF02R  DBB[5114]   // A3 Реж2 Расход 2 при наборе температуры острым паром
#define  A32NTOP03R  DBB[5115]   // A3 Реж2 Температура 3 при наборе температуры острым паром
#define  A32NTOF03R  DBB[5116]   // A3 Реж2 Расход 3 при наборе температуры острым паром
#define  A32NTOP04R  DBB[5117]   // A3 Реж2 Температура 4 при наборе температуры острым паром
#define  A32NTOF04R  DBB[5118]   // A3 Реж2 Расход 4 при наборе температуры острым паром
#define  A32NTOP05R  DBB[5119]   // A3 Реж2 Температура 5 при наборе температуры острым паром
#define  A32NTOF05R  DBB[5120]   // A3 Реж2 Расход 5 при наборе температуры острым паром
#define  A32NPPP01R  DBB[5121]   // A3 Реж2 Давление 1 при наборе давления перепуск паром
#define  A32NPPF01R  DBB[5122]   // A3 Реж2 Расход 1 при наборе давления перепуск паром
#define  A32NPPP02R  DBB[5123]   // A3 Реж2 Давление 2 при наборе давления перепуск паром
#define  A32NPPF02R  DBB[5124]   // A3 Реж2 Расход 2 при наборе давления перепуск паром
#define  A32NPPP03R  DBB[5125]   // A3 Реж2 Давление 3 при наборе давления перепуск паром
#define  A32NPPF03R  DBB[5126]   // A3 Реж2 Расход 3 при наборе давления перепуск паром
#define  A32NPPP04R  DBB[5127]   // A3 Реж2 Давление 4 при наборе давления перепуск паром
#define  A32NPPF04R  DBB[5128]   // A3 Реж2 Расход 4 при наборе давления перепуск паром
#define  A32NPPP05R  DBB[5129]   // A3 Реж2 Давление 5 при наборе давления перепуск паром
#define  A32NPPF05R  DBB[5130]   // A3 Реж2 Расход 5 при наборе давления перепуск паром
#define  A32NPPP06R  DBB[5131]   // A3 Реж2 Давление 6 при наборе давления перепуск паром
#define  A32NPPF06R  DBB[5132]   // A3 Реж2 Расход 6 при наборе давления перепуск паром
#define  A32NPPP07R  DBB[5133]   // A3 Реж2 Давление 7 при наборе давления перепуск паром
#define  A32NPPF07R  DBB[5134]   // A3 Реж2 Расход 7 при наборе давления перепуск паром
#define  A32NPPP08R  DBB[5135]   // A3 Реж2 Давление 8 при наборе давления перепуск паром
#define  A32NPPF08R  DBB[5136]   // A3 Реж2 Расход 8 при наборе давления перепуск паром
#define  A32NPPP09R  DBB[5137]   // A3 Реж2 Давление 9 при наборе давления перепуск паром
#define  A32NPPF09R  DBB[5138]   // A3 Реж2 Расход 9 при наборе давления перепуск паром
#define  A32NPPP10R  DBB[5139]   // A3 Реж2 Давление 10 при наборе давления перепуск паром
#define  A32NPPF10R  DBB[5140]   // A3 Реж2 Расход 10 при наборе давления перепуск паром
#define  A32NPOP01R  DBB[5141]   // A3 Реж2 Давление 1 при наборе давления острым паром
#define  A32NPOF01R  DBB[5142]   // A3 Реж2 Расход 1 при наборе давления острым паром
#define  A32NPOP02R  DBB[5143]   // A3 Реж2 Давление 2 при наборе давления острым паром
#define  A32NPOF02R  DBB[5144]   // A3 Реж2 Расход 2 при наборе давления острым паром
#define  A32NPOP03R  DBB[5145]   // A3 Реж2 Давление 3 при наборе давления острым паром
#define  A32NPOF03R  DBB[5146]   // A3 Реж2 Расход 3 при наборе давления острым паром
#define  A32NPOP04R  DBB[5147]   // A3 Реж2 Давление 4 при наборе давления острым паром
#define  A32NPOF04R  DBB[5148]   // A3 Реж2 Расход 4 при наборе давления острым паром
#define  A32NPOP05R  DBB[5149]   // A3 Реж2 Давление 5 при наборе давления острым паром
#define  A32NPOF05R  DBB[5150]   // A3 Реж2 Расход 5 при наборе давления острым паром
#define  A32NPOP06R  DBB[5151]   // A3 Реж2 Давление 6 при наборе давления острым паром
#define  A32NPOF06R  DBB[5152]   // A3 Реж2 Расход 6 при наборе давления острым паром
#define  A32NPOP07R  DBB[5153]   // A3 Реж2 Давление 7 при наборе давления острым паром
#define  A32NPOF07R  DBB[5154]   // A3 Реж2 Расход 7 при наборе давления острым паром
#define  A32NPOP08R  DBB[5155]   // A3 Реж2 Давление 8 при наборе давления острым паром
#define  A32NPOF08R  DBB[5156]   // A3 Реж2 Расход 8 при наборе давления острым паром
#define  A32NPOP09R  DBB[5157]   // A3 Реж2 Давление 9 при наборе давления острым паром
#define  A32NPOF09R  DBB[5158]   // A3 Реж2 Расход 9 при наборе давления острым паром
#define  A32NPOP10R  DBB[5159]   // A3 Реж2 Давление 10 при наборе давления острым паром
#define  A32NPOF10R  DBB[5160]   // A3 Реж2 Расход 10 при наборе давления острым паром
#define  A32SPAP01R  DBB[5161]   // A3 Реж2 Давление 1 при сбросе давления в атмосферу
#define  A32SPAK01R  DBB[5162]   // A3 Реж2 Клапан 1 при сбросе давления в атмосферу
#define  A32SPAP02R  DBB[5163]   // A3 Реж2 Давление 2 при сбросе давления в атмосферу
#define  A32SPAK02R  DBB[5164]   // A3 Реж2 Клапан 2 при сбросе давления в атмосферу
#define  A32SPAP03R  DBB[5165]   // A3 Реж2 Давление 3 при сбросе давления в атмосферу
#define  A32SPAK03R  DBB[5166]   // A3 Реж2 Клапан 3 при сбросе давления в атмосферу
#define  A32SPAP04R  DBB[5167]   // A3 Реж2 Давление 4 при сбросе давления в атмосферу
#define  A32SPAK04R  DBB[5168]   // A3 Реж2 Клапан 4 при сбросе давления в атмосферу
#define  A32SPAP05R  DBB[5169]   // A3 Реж2 Давление 5 при сбросе давления в атмосферу
#define  A32SPAK05R  DBB[5170]   // A3 Реж2 Клапан 5 при сбросе давления в атмосферу
#define  A32SPKP01R  DBB[5171]   // A3 Реж2 Давление 1 при сбросе давления в акумулятор
#define  A32SPKK01R  DBB[5172]   // A3 Реж2 Клапан 1 при сбросе давления в акумулятор
#define  A32SPKP02R  DBB[5173]   // A3 Реж2 Давление 2 при сбросе давления в акумулятор
#define  A32SPKK02R  DBB[5174]   // A3 Реж2 Клапан 2 при сбросе давления в акумулятор
#define  A32SPKP03R  DBB[5175]   // A3 Реж2 Давление 3 при сбросе давления в акумулятор
#define  A32SPKK03R  DBB[5176]   // A3 Реж2 Клапан 3 при сбросе давления в акумулятор
#define  A32SPKP04R  DBB[5177]   // A3 Реж2 Давление 4 при сбросе давления в акумулятор
#define  A32SPKK04R  DBB[5178]   // A3 Реж2 Клапан 4 при сбросе давления в акумулятор
#define  A32SPKP05R  DBB[5179]   // A3 Реж2 Давление 5 при сбросе давления в акумулятор
#define  A32SPKK05R  DBB[5180]   // A3 Реж2 Клапан 5 при сбросе давления в акумулятор
#define  A33NTPP01R  DBB[5201]   // A3 Реж3 Температура 1 при наборе температуры перепуск паром
#define  A33NTPF01R  DBB[5202]   // A3 Реж3 Расход 1 при наборе температуры перепуск паром
#define  A33NTPP02R  DBB[5203]   // A3 Реж3 Температура 2 при наборе температуры перепуск паром
#define  A33NTPF02R  DBB[5204]   // A3 Реж3 Расход 2 при наборе температуры перепуск паром
#define  A33NTPP03R  DBB[5205]   // A3 Реж3 Температура 3 при наборе температуры перепуск паром
#define  A33NTPF03R  DBB[5206]   // A3 Реж3 Расход 3 при наборе температуры перепуск паром
#define  A33NTPP04R  DBB[5207]   // A3 Реж3 Температура 4 при наборе температуры перепуск паром
#define  A33NTPF04R  DBB[5208]   // A3 Реж3 Расход 4 при наборе температуры перепуск паром
#define  A33NTPP05R  DBB[5209]   // A3 Реж3 Температура 5 при наборе температуры перепуск паром
#define  A33NTPF05R  DBB[5210]   // A3 Реж3 Расход 5 при наборе температуры перепуск паром
#define  A33NTOP01R  DBB[5211]   // A3 Реж3 Температура 1 при наборе температуры острым паром
#define  A33NTOF01R  DBB[5212]   // A3 Реж3 Расход 1 при наборе температуры острым паром
#define  A33NTOP02R  DBB[5213]   // A3 Реж3 Температура 2 при наборе температуры острым паром
#define  A33NTOF02R  DBB[5214]   // A3 Реж3 Расход 2 при наборе температуры острым паром
#define  A33NTOP03R  DBB[5215]   // A3 Реж3 Температура 3 при наборе температуры острым паром
#define  A33NTOF03R  DBB[5216]   // A3 Реж3 Расход 3 при наборе температуры острым паром
#define  A33NTOP04R  DBB[5217]   // A3 Реж3 Температура 4 при наборе температуры острым паром
#define  A33NTOF04R  DBB[5218]   // A3 Реж3 Расход 4 при наборе температуры острым паром
#define  A33NTOP05R  DBB[5219]   // A3 Реж3 Температура 5 при наборе температуры острым паром
#define  A33NTOF05R  DBB[5220]   // A3 Реж3 Расход 5 при наборе температуры острым паром
#define  A33NPPP01R  DBB[5221]   // A3 Реж3 Давление 1 при наборе давления перепуск паром
#define  A33NPPF01R  DBB[5222]   // A3 Реж3 Расход 1 при наборе давления перепуск паром
#define  A33NPPP02R  DBB[5223]   // A3 Реж3 Давление 2 при наборе давления перепуск паром
#define  A33NPPF02R  DBB[5224]   // A3 Реж3 Расход 2 при наборе давления перепуск паром
#define  A33NPPP03R  DBB[5225]   // A3 Реж3 Давление 3 при наборе давления перепуск паром
#define  A33NPPF03R  DBB[5226]   // A3 Реж3 Расход 3 при наборе давления перепуск паром
#define  A33NPPP04R  DBB[5227]   // A3 Реж3 Давление 4 при наборе давления перепуск паром
#define  A33NPPF04R  DBB[5228]   // A3 Реж3 Расход 4 при наборе давления перепуск паром
#define  A33NPPP05R  DBB[5229]   // A3 Реж3 Давление 5 при наборе давления перепуск паром
#define  A33NPPF05R  DBB[5230]   // A3 Реж3 Расход 5 при наборе давления перепуск паром
#define  A33NPPP06R  DBB[5231]   // A3 Реж3 Давление 6 при наборе давления перепуск паром
#define  A33NPPF06R  DBB[5232]   // A3 Реж3 Расход 6 при наборе давления перепуск паром
#define  A33NPPP07R  DBB[5233]   // A3 Реж3 Давление 7 при наборе давления перепуск паром
#define  A33NPPF07R  DBB[5234]   // A3 Реж3 Расход 7 при наборе давления перепуск паром
#define  A33NPPP08R  DBB[5235]   // A3 Реж3 Давление 8 при наборе давления перепуск паром
#define  A33NPPF08R  DBB[5236]   // A3 Реж3 Расход 8 при наборе давления перепуск паром
#define  A33NPPP09R  DBB[5237]   // A3 Реж3 Давление 9 при наборе давления перепуск паром
#define  A33NPPF09R  DBB[5238]   // A3 Реж3 Расход 9 при наборе давления перепуск паром
#define  A33NPPP10R  DBB[5239]   // A3 Реж3 Давление 10 при наборе давления перепуск паром
#define  A33NPPF10R  DBB[5240]   // A3 Реж3 Расход 10 при наборе давления перепуск паром
#define  A33NPOP01R  DBB[5241]   // A3 Реж3 Давление 1 при наборе давления острым паром
#define  A33NPOF01R  DBB[5242]   // A3 Реж3 Расход 1 при наборе давления острым паром
#define  A33NPOP02R  DBB[5243]   // A3 Реж3 Давление 2 при наборе давления острым паром
#define  A33NPOF02R  DBB[5244]   // A3 Реж3 Расход 2 при наборе давления острым паром
#define  A33NPOP03R  DBB[5245]   // A3 Реж3 Давление 3 при наборе давления острым паром
#define  A33NPOF03R  DBB[5246]   // A3 Реж3 Расход 3 при наборе давления острым паром
#define  A33NPOP04R  DBB[5247]   // A3 Реж3 Давление 4 при наборе давления острым паром
#define  A33NPOF04R  DBB[5248]   // A3 Реж3 Расход 4 при наборе давления острым паром
#define  A33NPOP05R  DBB[5249]   // A3 Реж3 Давление 5 при наборе давления острым паром
#define  A33NPOF05R  DBB[5250]   // A3 Реж3 Расход 5 при наборе давления острым паром
#define  A33NPOP06R  DBB[5251]   // A3 Реж3 Давление 6 при наборе давления острым паром
#define  A33NPOF06R  DBB[5252]   // A3 Реж3 Расход 6 при наборе давления острым паром
#define  A33NPOP07R  DBB[5253]   // A3 Реж3 Давление 7 при наборе давления острым паром
#define  A33NPOF07R  DBB[5254]   // A3 Реж3 Расход 7 при наборе давления острым паром
#define  A33NPOP08R  DBB[5255]   // A3 Реж3 Давление 8 при наборе давления острым паром
#define  A33NPOF08R  DBB[5256]   // A3 Реж3 Расход 8 при наборе давления острым паром
#define  A33NPOP09R  DBB[5257]   // A3 Реж3 Давление 9 при наборе давления острым паром
#define  A33NPOF09R  DBB[5258]   // A3 Реж3 Расход 9 при наборе давления острым паром
#define  A33NPOP10R  DBB[5259]   // A3 Реж3 Давление 10 при наборе давления острым паром
#define  A33NPOF10R  DBB[5260]   // A3 Реж3 Расход 10 при наборе давления острым паром
#define  A33SPAP01R  DBB[5261]   // A3 Реж3 Давление 1 при сбросе давления в атмосферу
#define  A33SPAK01R  DBB[5262]   // A3 Реж3 Клапан 1 при сбросе давления в атмосферу
#define  A33SPAP02R  DBB[5263]   // A3 Реж3 Давление 2 при сбросе давления в атмосферу
#define  A33SPAK02R  DBB[5264]   // A3 Реж3 Клапан 2 при сбросе давления в атмосферу
#define  A33SPAP03R  DBB[5265]   // A3 Реж3 Давление 3 при сбросе давления в атмосферу
#define  A33SPAK03R  DBB[5266]   // A3 Реж3 Клапан 3 при сбросе давления в атмосферу
#define  A33SPAP04R  DBB[5267]   // A3 Реж3 Давление 4 при сбросе давления в атмосферу
#define  A33SPAK04R  DBB[5268]   // A3 Реж3 Клапан 4 при сбросе давления в атмосферу
#define  A33SPAP05R  DBB[5269]   // A3 Реж3 Давление 5 при сбросе давления в атмосферу
#define  A33SPAK05R  DBB[5270]   // A3 Реж3 Клапан 5 при сбросе давления в атмосферу
#define  A33SPKP01R  DBB[5271]   // A3 Реж3 Давление 1 при сбросе давления в акумулятор
#define  A33SPKK01R  DBB[5272]   // A3 Реж3 Клапан 1 при сбросе давления в акумулятор
#define  A33SPKP02R  DBB[5273]   // A3 Реж3 Давление 2 при сбросе давления в акумулятор
#define  A33SPKK02R  DBB[5274]   // A3 Реж3 Клапан 2 при сбросе давления в акумулятор
#define  A33SPKP03R  DBB[5275]   // A3 Реж3 Давление 3 при сбросе давления в акумулятор
#define  A33SPKK03R  DBB[5276]   // A3 Реж3 Клапан 3 при сбросе давления в акумулятор
#define  A33SPKP04R  DBB[5277]   // A3 Реж3 Давление 4 при сбросе давления в акумулятор
#define  A33SPKK04R  DBB[5278]   // A3 Реж3 Клапан 4 при сбросе давления в акумулятор
#define  A33SPKP05R  DBB[5279]   // A3 Реж3 Давление 5 при сбросе давления в акумулятор
#define  A33SPKK05R  DBB[5280]   // A3 Реж3 Клапан 5 при сбросе давления в акумулятор
#define  A41NTPP01R  DBB[5501]   // A4 Реж1 Температура 1 при наборе температуры перепуск паром
#define  A41NTPF01R  DBB[5502]   // A4 Реж1 Расход 1 при наборе температуры перепуск паром
#define  A41NTPP02R  DBB[5503]   // A4 Реж1 Температура 2 при наборе температуры перепуск паром
#define  A41NTPF02R  DBB[5504]   // A4 Реж1 Расход 2 при наборе температуры перепуск паром
#define  A41NTPP03R  DBB[5505]   // A4 Реж1 Температура 3 при наборе температуры перепуск паром
#define  A41NTPF03R  DBB[5506]   // A4 Реж1 Расход 3 при наборе температуры перепуск паром
#define  A41NTPP04R  DBB[5507]   // A4 Реж1 Температура 4 при наборе температуры перепуск паром
#define  A41NTPF04R  DBB[5508]   // A4 Реж1 Расход 4 при наборе температуры перепуск паром
#define  A41NTPP05R  DBB[5509]   // A4 Реж1 Температура 5 при наборе температуры перепуск паром
#define  A41NTPF05R  DBB[5510]   // A4 Реж1 Расход 5 при наборе температуры перепуск паром
#define  A41NTOP01R  DBB[5511]   // A4 Реж1 Температура 1 при наборе температуры острым паром
#define  A41NTOF01R  DBB[5512]   // A4 Реж1 Расход 1 при наборе температуры острым паром
#define  A41NTOP02R  DBB[5513]   // A4 Реж1 Температура 2 при наборе температуры острым паром
#define  A41NTOF02R  DBB[5514]   // A4 Реж1 Расход 2 при наборе температуры острым паром
#define  A41NTOP03R  DBB[5515]   // A4 Реж1 Температура 3 при наборе температуры острым паром
#define  A41NTOF03R  DBB[5516]   // A4 Реж1 Расход 3 при наборе температуры острым паром
#define  A41NTOP04R  DBB[5517]   // A4 Реж1 Температура 4 при наборе температуры острым паром
#define  A41NTOF04R  DBB[5518]   // A4 Реж1 Расход 4 при наборе температуры острым паром
#define  A41NTOP05R  DBB[5519]   // A4 Реж1 Температура 5 при наборе температуры острым паром
#define  A41NTOF05R  DBB[5520]   // A4 Реж1 Расход 5 при наборе температуры острым паром
#define  A41NPPP01R  DBB[5521]   // A4 Реж1 Давление 1 при наборе давления перепуск паром
#define  A41NPPF01R  DBB[5522]   // A4 Реж1 Расход 1 при наборе давления перепуск паром
#define  A41NPPP02R  DBB[5523]   // A4 Реж1 Давление 2 при наборе давления перепуск паром
#define  A41NPPF02R  DBB[5524]   // A4 Реж1 Расход 2 при наборе давления перепуск паром
#define  A41NPPP03R  DBB[5525]   // A4 Реж1 Давление 3 при наборе давления перепуск паром
#define  A41NPPF03R  DBB[5526]   // A4 Реж1 Расход 3 при наборе давления перепуск паром
#define  A41NPPP04R  DBB[5527]   // A4 Реж1 Давление 4 при наборе давления перепуск паром
#define  A41NPPF04R  DBB[5528]   // A4 Реж1 Расход 4 при наборе давления перепуск паром
#define  A41NPPP05R  DBB[5529]   // A4 Реж1 Давление 5 при наборе давления перепуск паром
#define  A41NPPF05R  DBB[5530]   // A4 Реж1 Расход 5 при наборе давления перепуск паром
#define  A41NPPP06R  DBB[5531]   // A4 Реж1 Давление 6 при наборе давления перепуск паром
#define  A41NPPF06R  DBB[5532]   // A4 Реж1 Расход 6 при наборе давления перепуск паром
#define  A41NPPP07R  DBB[5533]   // A4 Реж1 Давление 7 при наборе давления перепуск паром
#define  A41NPPF07R  DBB[5534]   // A4 Реж1 Расход 7 при наборе давления перепуск паром
#define  A41NPPP08R  DBB[5535]   // A4 Реж1 Давление 8 при наборе давления перепуск паром
#define  A41NPPF08R  DBB[5536]   // A4 Реж1 Расход 8 при наборе давления перепуск паром
#define  A41NPPP09R  DBB[5537]   // A4 Реж1 Давление 9 при наборе давления перепуск паром
#define  A41NPPF09R  DBB[5538]   // A4 Реж1 Расход 9 при наборе давления перепуск паром
#define  A41NPPP10R  DBB[5539]   // A4 Реж1 Давление 10 при наборе давления перепуск паром
#define  A41NPPF10R  DBB[5540]   // A4 Реж1 Расход 10 при наборе давления перепуск паром
#define  A41NPOP01R  DBB[5541]   // A4 Реж1 Давление 1 при наборе давления острым паром
#define  A41NPOF01R  DBB[5542]   // A4 Реж1 Расход 1 при наборе давления острым паром
#define  A41NPOP02R  DBB[5543]   // A4 Реж1 Давление 2 при наборе давления острым паром
#define  A41NPOF02R  DBB[5544]   // A4 Реж1 Расход 2 при наборе давления острым паром
#define  A41NPOP03R  DBB[5545]   // A4 Реж1 Давление 3 при наборе давления острым паром
#define  A41NPOF03R  DBB[5546]   // A4 Реж1 Расход 3 при наборе давления острым паром
#define  A41NPOP04R  DBB[5547]   // A4 Реж1 Давление 4 при наборе давления острым паром
#define  A41NPOF04R  DBB[5548]   // A4 Реж1 Расход 4 при наборе давления острым паром
#define  A41NPOP05R  DBB[5549]   // A4 Реж1 Давление 5 при наборе давления острым паром
#define  A41NPOF05R  DBB[5550]   // A4 Реж1 Расход 5 при наборе давления острым паром
#define  A41NPOP06R  DBB[5551]   // A4 Реж1 Давление 6 при наборе давления острым паром
#define  A41NPOF06R  DBB[5552]   // A4 Реж1 Расход 6 при наборе давления острым паром
#define  A41NPOP07R  DBB[5553]   // A4 Реж1 Давление 7 при наборе давления острым паром
#define  A41NPOF07R  DBB[5554]   // A4 Реж1 Расход 7 при наборе давления острым паром
#define  A41NPOP08R  DBB[5555]   // A4 Реж1 Давление 8 при наборе давления острым паром
#define  A41NPOF08R  DBB[5556]   // A4 Реж1 Расход 8 при наборе давления острым паром
#define  A41NPOP09R  DBB[5557]   // A4 Реж1 Давление 9 при наборе давления острым паром
#define  A41NPOF09R  DBB[5558]   // A4 Реж1 Расход 9 при наборе давления острым паром
#define  A41NPOP10R  DBB[5559]   // A4 Реж1 Давление 10 при наборе давления острым паром
#define  A41NPOF10R  DBB[5560]   // A4 Реж1 Расход 10 при наборе давления острым паром
#define  A41SPAP01R  DBB[5561]   // A4 Реж1 Давление 1 при сбросе давления в атмосферу
#define  A41SPAK01R  DBB[5562]   // A4 Реж1 Клапан 1 при сбросе давления в атмосферу
#define  A41SPAP02R  DBB[5563]   // A4 Реж1 Давление 2 при сбросе давления в атмосферу
#define  A41SPAK02R  DBB[5564]   // A4 Реж1 Клапан 2 при сбросе давления в атмосферу
#define  A41SPAP03R  DBB[5565]   // A4 Реж1 Давление 3 при сбросе давления в атмосферу
#define  A41SPAK03R  DBB[5566]   // A4 Реж1 Клапан 3 при сбросе давления в атмосферу
#define  A41SPAP04R  DBB[5567]   // A4 Реж1 Давление 4 при сбросе давления в атмосферу
#define  A41SPAK04R  DBB[5568]   // A4 Реж1 Клапан 4 при сбросе давления в атмосферу
#define  A41SPAP05R  DBB[5569]   // A4 Реж1 Давление 5 при сбросе давления в атмосферу
#define  A41SPAK05R  DBB[5570]   // A4 Реж1 Клапан 5 при сбросе давления в атмосферу
#define  A41SPKP01R  DBB[5571]   // A4 Реж1 Давление 1 при сбросе давления в акумулятор
#define  A41SPKK01R  DBB[5572]   // A4 Реж1 Клапан 1 при сбросе давления в акумулятор
#define  A41SPKP02R  DBB[5573]   // A4 Реж1 Давление 2 при сбросе давления в акумулятор
#define  A41SPKK02R  DBB[5574]   // A4 Реж1 Клапан 2 при сбросе давления в акумулятор
#define  A41SPKP03R  DBB[5575]   // A4 Реж1 Давление 3 при сбросе давления в акумулятор
#define  A41SPKK03R  DBB[5576]   // A4 Реж1 Клапан 3 при сбросе давления в акумулятор
#define  A41SPKP04R  DBB[5577]   // A4 Реж1 Давление 4 при сбросе давления в акумулятор
#define  A41SPKK04R  DBB[5578]   // A4 Реж1 Клапан 4 при сбросе давления в акумулятор
#define  A41SPKP05R  DBB[5579]   // A4 Реж1 Давление 5 при сбросе давления в акумулятор
#define  A41SPKK05R  DBB[5580]   // A4 Реж1 Клапан 5 при сбросе давления в акумулятор
#define  A42NTPP01R  DBB[5601]   // A4 Реж2 Температура 1 при наборе температуры перепуск паром
#define  A42NTPF01R  DBB[5602]   // A4 Реж2 Расход 1 при наборе температуры перепуск паром
#define  A42NTPP02R  DBB[5603]   // A4 Реж2 Температура 2 при наборе температуры перепуск паром
#define  A42NTPF02R  DBB[5604]   // A4 Реж2 Расход 2 при наборе температуры перепуск паром
#define  A42NTPP03R  DBB[5605]   // A4 Реж2 Температура 3 при наборе температуры перепуск паром
#define  A42NTPF03R  DBB[5606]   // A4 Реж2 Расход 3 при наборе температуры перепуск паром
#define  A42NTPP04R  DBB[5607]   // A4 Реж2 Температура 4 при наборе температуры перепуск паром
#define  A42NTPF04R  DBB[5608]   // A4 Реж2 Расход 4 при наборе температуры перепуск паром
#define  A42NTPP05R  DBB[5609]   // A4 Реж2 Температура 5 при наборе температуры перепуск паром
#define  A42NTPF05R  DBB[5610]   // A4 Реж2 Расход 5 при наборе температуры перепуск паром
#define  A42NTOP01R  DBB[5611]   // A4 Реж2 Температура 1 при наборе температуры острым паром
#define  A42NTOF01R  DBB[5612]   // A4 Реж2 Расход 1 при наборе температуры острым паром
#define  A42NTOP02R  DBB[5613]   // A4 Реж2 Температура 2 при наборе температуры острым паром
#define  A42NTOF02R  DBB[5614]   // A4 Реж2 Расход 2 при наборе температуры острым паром
#define  A42NTOP03R  DBB[5615]   // A4 Реж2 Температура 3 при наборе температуры острым паром
#define  A42NTOF03R  DBB[5616]   // A4 Реж2 Расход 3 при наборе температуры острым паром
#define  A42NTOP04R  DBB[5617]   // A4 Реж2 Температура 4 при наборе температуры острым паром
#define  A42NTOF04R  DBB[5618]   // A4 Реж2 Расход 4 при наборе температуры острым паром
#define  A42NTOP05R  DBB[5619]   // A4 Реж2 Температура 5 при наборе температуры острым паром
#define  A42NTOF05R  DBB[5620]   // A4 Реж2 Расход 5 при наборе температуры острым паром
#define  A42NPPP01R  DBB[5621]   // A4 Реж2 Давление 1 при наборе давления перепуск паром
#define  A42NPPF01R  DBB[5622]   // A4 Реж2 Расход 1 при наборе давления перепуск паром
#define  A42NPPP02R  DBB[5623]   // A4 Реж2 Давление 2 при наборе давления перепуск паром
#define  A42NPPF02R  DBB[5624]   // A4 Реж2 Расход 2 при наборе давления перепуск паром
#define  A42NPPP03R  DBB[5625]   // A4 Реж2 Давление 3 при наборе давления перепуск паром
#define  A42NPPF03R  DBB[5626]   // A4 Реж2 Расход 3 при наборе давления перепуск паром
#define  A42NPPP04R  DBB[5627]   // A4 Реж2 Давление 4 при наборе давления перепуск паром
#define  A42NPPF04R  DBB[5628]   // A4 Реж2 Расход 4 при наборе давления перепуск паром
#define  A42NPPP05R  DBB[5629]   // A4 Реж2 Давление 5 при наборе давления перепуск паром
#define  A42NPPF05R  DBB[5630]   // A4 Реж2 Расход 5 при наборе давления перепуск паром
#define  A42NPPP06R  DBB[5631]   // A4 Реж2 Давление 6 при наборе давления перепуск паром
#define  A42NPPF06R  DBB[5632]   // A4 Реж2 Расход 6 при наборе давления перепуск паром
#define  A42NPPP07R  DBB[5633]   // A4 Реж2 Давление 7 при наборе давления перепуск паром
#define  A42NPPF07R  DBB[5634]   // A4 Реж2 Расход 7 при наборе давления перепуск паром
#define  A42NPPP08R  DBB[5635]   // A4 Реж2 Давление 8 при наборе давления перепуск паром
#define  A42NPPF08R  DBB[5636]   // A4 Реж2 Расход 8 при наборе давления перепуск паром
#define  A42NPPP09R  DBB[5637]   // A4 Реж2 Давление 9 при наборе давления перепуск паром
#define  A42NPPF09R  DBB[5638]   // A4 Реж2 Расход 9 при наборе давления перепуск паром
#define  A42NPPP10R  DBB[5639]   // A4 Реж2 Давление 10 при наборе давления перепуск паром
#define  A42NPPF10R  DBB[5640]   // A4 Реж2 Расход 10 при наборе давления перепуск паром
#define  A42NPOP01R  DBB[5641]   // A4 Реж2 Давление 1 при наборе давления острым паром
#define  A42NPOF01R  DBB[5642]   // A4 Реж2 Расход 1 при наборе давления острым паром
#define  A42NPOP02R  DBB[5643]   // A4 Реж2 Давление 2 при наборе давления острым паром
#define  A42NPOF02R  DBB[5644]   // A4 Реж2 Расход 2 при наборе давления острым паром
#define  A42NPOP03R  DBB[5645]   // A4 Реж2 Давление 3 при наборе давления острым паром
#define  A42NPOF03R  DBB[5646]   // A4 Реж2 Расход 3 при наборе давления острым паром
#define  A42NPOP04R  DBB[5647]   // A4 Реж2 Давление 4 при наборе давления острым паром
#define  A42NPOF04R  DBB[5648]   // A4 Реж2 Расход 4 при наборе давления острым паром
#define  A42NPOP05R  DBB[5649]   // A4 Реж2 Давление 5 при наборе давления острым паром
#define  A42NPOF05R  DBB[5650]   // A4 Реж2 Расход 5 при наборе давления острым паром
#define  A42NPOP06R  DBB[5651]   // A4 Реж2 Давление 6 при наборе давления острым паром
#define  A42NPOF06R  DBB[5652]   // A4 Реж2 Расход 6 при наборе давления острым паром
#define  A42NPOP07R  DBB[5653]   // A4 Реж2 Давление 7 при наборе давления острым паром
#define  A42NPOF07R  DBB[5654]   // A4 Реж2 Расход 7 при наборе давления острым паром
#define  A42NPOP08R  DBB[5655]   // A4 Реж2 Давление 8 при наборе давления острым паром
#define  A42NPOF08R  DBB[5656]   // A4 Реж2 Расход 8 при наборе давления острым паром
#define  A42NPOP09R  DBB[5657]   // A4 Реж2 Давление 9 при наборе давления острым паром
#define  A42NPOF09R  DBB[5658]   // A4 Реж2 Расход 9 при наборе давления острым паром
#define  A42NPOP10R  DBB[5659]   // A4 Реж2 Давление 10 при наборе давления острым паром
#define  A42NPOF10R  DBB[5660]   // A4 Реж2 Расход 10 при наборе давления острым паром
#define  A42SPAP01R  DBB[5661]   // A4 Реж2 Давление 1 при сбросе давления в атмосферу
#define  A42SPAK01R  DBB[5662]   // A4 Реж2 Клапан 1 при сбросе давления в атмосферу
#define  A42SPAP02R  DBB[5663]   // A4 Реж2 Давление 2 при сбросе давления в атмосферу
#define  A42SPAK02R  DBB[5664]   // A4 Реж2 Клапан 2 при сбросе давления в атмосферу
#define  A42SPAP03R  DBB[5665]   // A4 Реж2 Давление 3 при сбросе давления в атмосферу
#define  A42SPAK03R  DBB[5666]   // A4 Реж2 Клапан 3 при сбросе давления в атмосферу
#define  A42SPAP04R  DBB[5667]   // A4 Реж2 Давление 4 при сбросе давления в атмосферу
#define  A42SPAK04R  DBB[5668]   // A4 Реж2 Клапан 4 при сбросе давления в атмосферу
#define  A42SPAP05R  DBB[5669]   // A4 Реж2 Давление 5 при сбросе давления в атмосферу
#define  A42SPAK05R  DBB[5670]   // A4 Реж2 Клапан 5 при сбросе давления в атмосферу
#define  A42SPKP01R  DBB[5671]   // A4 Реж2 Давление 1 при сбросе давления в акумулятор
#define  A42SPKK01R  DBB[5672]   // A4 Реж2 Клапан 1 при сбросе давления в акумулятор
#define  A42SPKP02R  DBB[5673]   // A4 Реж2 Давление 2 при сбросе давления в акумулятор
#define  A42SPKK02R  DBB[5674]   // A4 Реж2 Клапан 2 при сбросе давления в акумулятор
#define  A42SPKP03R  DBB[5675]   // A4 Реж2 Давление 3 при сбросе давления в акумулятор
#define  A42SPKK03R  DBB[5676]   // A4 Реж2 Клапан 3 при сбросе давления в акумулятор
#define  A42SPKP04R  DBB[5677]   // A4 Реж2 Давление 4 при сбросе давления в акумулятор
#define  A42SPKK04R  DBB[5678]   // A4 Реж2 Клапан 4 при сбросе давления в акумулятор
#define  A42SPKP05R  DBB[5679]   // A4 Реж2 Давление 5 при сбросе давления в акумулятор
#define  A42SPKK05R  DBB[5680]   // A4 Реж2 Клапан 5 при сбросе давления в акумулятор
#define  A43NTPP01R  DBB[5701]   // A4 Реж3 Температура 1 при наборе температуры перепуск паром
#define  A43NTPF01R  DBB[5702]   // A4 Реж3 Расход 1 при наборе температуры перепуск паром
#define  A43NTPP02R  DBB[5703]   // A4 Реж3 Температура 2 при наборе температуры перепуск паром
#define  A43NTPF02R  DBB[5704]   // A4 Реж3 Расход 2 при наборе температуры перепуск паром
#define  A43NTPP03R  DBB[5705]   // A4 Реж3 Температура 3 при наборе температуры перепуск паром
#define  A43NTPF03R  DBB[5706]   // A4 Реж3 Расход 3 при наборе температуры перепуск паром
#define  A43NTPP04R  DBB[5707]   // A4 Реж3 Температура 4 при наборе температуры перепуск паром
#define  A43NTPF04R  DBB[5708]   // A4 Реж3 Расход 4 при наборе температуры перепуск паром
#define  A43NTPP05R  DBB[5709]   // A4 Реж3 Температура 5 при наборе температуры перепуск паром
#define  A43NTPF05R  DBB[5710]   // A4 Реж3 Расход 5 при наборе температуры перепуск паром
#define  A43NTOP01R  DBB[5711]   // A4 Реж3 Температура 1 при наборе температуры острым паром
#define  A43NTOF01R  DBB[5712]   // A4 Реж3 Расход 1 при наборе температуры острым паром
#define  A43NTOP02R  DBB[5713]   // A4 Реж3 Температура 2 при наборе температуры острым паром
#define  A43NTOF02R  DBB[5714]   // A4 Реж3 Расход 2 при наборе температуры острым паром
#define  A43NTOP03R  DBB[5715]   // A4 Реж3 Температура 3 при наборе температуры острым паром
#define  A43NTOF03R  DBB[5716]   // A4 Реж3 Расход 3 при наборе температуры острым паром
#define  A43NTOP04R  DBB[5717]   // A4 Реж3 Температура 4 при наборе температуры острым паром
#define  A43NTOF04R  DBB[5718]   // A4 Реж3 Расход 4 при наборе температуры острым паром
#define  A43NTOP05R  DBB[5719]   // A4 Реж3 Температура 5 при наборе температуры острым паром
#define  A43NTOF05R  DBB[5720]   // A4 Реж3 Расход 5 при наборе температуры острым паром
#define  A43NPPP01R  DBB[5721]   // A4 Реж3 Давление 1 при наборе давления перепуск паром
#define  A43NPPF01R  DBB[5722]   // A4 Реж3 Расход 1 при наборе давления перепуск паром
#define  A43NPPP02R  DBB[5723]   // A4 Реж3 Давление 2 при наборе давления перепуск паром
#define  A43NPPF02R  DBB[5724]   // A4 Реж3 Расход 2 при наборе давления перепуск паром
#define  A43NPPP03R  DBB[5725]   // A4 Реж3 Давление 3 при наборе давления перепуск паром
#define  A43NPPF03R  DBB[5726]   // A4 Реж3 Расход 3 при наборе давления перепуск паром
#define  A43NPPP04R  DBB[5727]   // A4 Реж3 Давление 4 при наборе давления перепуск паром
#define  A43NPPF04R  DBB[5728]   // A4 Реж3 Расход 4 при наборе давления перепуск паром
#define  A43NPPP05R  DBB[5729]   // A4 Реж3 Давление 5 при наборе давления перепуск паром
#define  A43NPPF05R  DBB[5730]   // A4 Реж3 Расход 5 при наборе давления перепуск паром
#define  A43NPPP06R  DBB[5731]   // A4 Реж3 Давление 6 при наборе давления перепуск паром
#define  A43NPPF06R  DBB[5732]   // A4 Реж3 Расход 6 при наборе давления перепуск паром
#define  A43NPPP07R  DBB[5733]   // A4 Реж3 Давление 7 при наборе давления перепуск паром
#define  A43NPPF07R  DBB[5734]   // A4 Реж3 Расход 7 при наборе давления перепуск паром
#define  A43NPPP08R  DBB[5735]   // A4 Реж3 Давление 8 при наборе давления перепуск паром
#define  A43NPPF08R  DBB[5736]   // A4 Реж3 Расход 8 при наборе давления перепуск паром
#define  A43NPPP09R  DBB[5737]   // A4 Реж3 Давление 9 при наборе давления перепуск паром
#define  A43NPPF09R  DBB[5738]   // A4 Реж3 Расход 9 при наборе давления перепуск паром
#define  A43NPPP10R  DBB[5739]   // A4 Реж3 Давление 10 при наборе давления перепуск паром
#define  A43NPPF10R  DBB[5740]   // A4 Реж3 Расход 10 при наборе давления перепуск паром
#define  A43NPOP01R  DBB[5741]   // A4 Реж3 Давление 1 при наборе давления острым паром
#define  A43NPOF01R  DBB[5742]   // A4 Реж3 Расход 1 при наборе давления острым паром
#define  A43NPOP02R  DBB[5743]   // A4 Реж3 Давление 2 при наборе давления острым паром
#define  A43NPOF02R  DBB[5744]   // A4 Реж3 Расход 2 при наборе давления острым паром
#define  A43NPOP03R  DBB[5745]   // A4 Реж3 Давление 3 при наборе давления острым паром
#define  A43NPOF03R  DBB[5746]   // A4 Реж3 Расход 3 при наборе давления острым паром
#define  A43NPOP04R  DBB[5747]   // A4 Реж3 Давление 4 при наборе давления острым паром
#define  A43NPOF04R  DBB[5748]   // A4 Реж3 Расход 4 при наборе давления острым паром
#define  A43NPOP05R  DBB[5749]   // A4 Реж3 Давление 5 при наборе давления острым паром
#define  A43NPOF05R  DBB[5750]   // A4 Реж3 Расход 5 при наборе давления острым паром
#define  A43NPOP06R  DBB[5751]   // A4 Реж3 Давление 6 при наборе давления острым паром
#define  A43NPOF06R  DBB[5752]   // A4 Реж3 Расход 6 при наборе давления острым паром
#define  A43NPOP07R  DBB[5753]   // A4 Реж3 Давление 7 при наборе давления острым паром
#define  A43NPOF07R  DBB[5754]   // A4 Реж3 Расход 7 при наборе давления острым паром
#define  A43NPOP08R  DBB[5755]   // A4 Реж3 Давление 8 при наборе давления острым паром
#define  A43NPOF08R  DBB[5756]   // A4 Реж3 Расход 8 при наборе давления острым паром
#define  A43NPOP09R  DBB[5757]   // A4 Реж3 Давление 9 при наборе давления острым паром
#define  A43NPOF09R  DBB[5758]   // A4 Реж3 Расход 9 при наборе давления острым паром
#define  A43NPOP10R  DBB[5759]   // A4 Реж3 Давление 10 при наборе давления острым паром
#define  A43NPOF10R  DBB[5760]   // A4 Реж3 Расход 10 при наборе давления острым паром
#define  A43SPAP01R  DBB[5761]   // A4 Реж3 Давление 1 при сбросе давления в атмосферу
#define  A43SPAK01R  DBB[5762]   // A4 Реж3 Клапан 1 при сбросе давления в атмосферу
#define  A43SPAP02R  DBB[5763]   // A4 Реж3 Давление 2 при сбросе давления в атмосферу
#define  A43SPAK02R  DBB[5764]   // A4 Реж3 Клапан 2 при сбросе давления в атмосферу
#define  A43SPAP03R  DBB[5765]   // A4 Реж3 Давление 3 при сбросе давления в атмосферу
#define  A43SPAK03R  DBB[5766]   // A4 Реж3 Клапан 3 при сбросе давления в атмосферу
#define  A43SPAP04R  DBB[5767]   // A4 Реж3 Давление 4 при сбросе давления в атмосферу
#define  A43SPAK04R  DBB[5768]   // A4 Реж3 Клапан 4 при сбросе давления в атмосферу
#define  A43SPAP05R  DBB[5769]   // A4 Реж3 Давление 5 при сбросе давления в атмосферу
#define  A43SPAK05R  DBB[5770]   // A4 Реж3 Клапан 5 при сбросе давления в атмосферу
#define  A43SPKP01R  DBB[5771]   // A4 Реж3 Давление 1 при сбросе давления в акумулятор
#define  A43SPKK01R  DBB[5772]   // A4 Реж3 Клапан 1 при сбросе давления в акумулятор
#define  A43SPKP02R  DBB[5773]   // A4 Реж3 Давление 2 при сбросе давления в акумулятор
#define  A43SPKK02R  DBB[5774]   // A4 Реж3 Клапан 2 при сбросе давления в акумулятор
#define  A43SPKP03R  DBB[5775]   // A4 Реж3 Давление 3 при сбросе давления в акумулятор
#define  A43SPKK03R  DBB[5776]   // A4 Реж3 Клапан 3 при сбросе давления в акумулятор
#define  A43SPKP04R  DBB[5777]   // A4 Реж3 Давление 4 при сбросе давления в акумулятор
#define  A43SPKK04R  DBB[5778]   // A4 Реж3 Клапан 4 при сбросе давления в акумулятор
#define  A43SPKP05R  DBB[5779]   // A4 Реж3 Давление 5 при сбросе давления в акумулятор
#define  A43SPKK05R  DBB[5780]   // A4 Реж3 Клапан 5 при сбросе давления в акумулятор
