//---------------------------------------------------------------------------
//  Обновление значений каждый тик системы (18 раз/сек)
vd  far UpdDataT(vd){

    //-----------------------------------------------------------------------
    Mod_AR();
    //-----------------------------------------------------------------------
    // Задание значений переменных массива DBB для отладки
    DebugVal();
    //-----------------------------------------------------------------------

    //-----------------------------------------------------------------------
    // Вызов подпрограмм регуляторов
    if( (Timer(1,18,1))==2 ){ RegRUN=ON; }
    NewSEC=RegRUN;
    Regul_up();
    Regul_03();
    Regul_04();
    Regul_3c();
    Regul_3p();
    Regul_3z();
    Regul_4c();
    Regul_4p();
    Regul_4z();
    L_Signal();
    Mod_BS();
    RegRUN=OFF;
    //-----------------------------------------------------------------------


    //-----------------------------------------------------------------------
    // Передача переменных циклов работы программы контроллера
    TickLP3__V=TLoop;
    SecnLP3__V=SLoop;
    //-----------------------------------------------------------------------
    // Запись данных на диск
    if (WriteDT3_M>0){
        WriteDT3_M=0; WriteData(0); Message(21,0);
        printf("W");
    }
    //-----------------------------------------------------------------------
    // Проверка флага звонка
    if (Bell(3,2)==ON){ O3BELL___V=ON;  ErrBell3_V=ON; }
    if (Bell(4,2)==ON){ O4BELL___V=ON;  ErrBell3_V=ON; }
    // сброс флага звонка
    if (I3BOFF___V>OFF){
        Bell(3,OFF); O3BELL___V=OFF; ErrBell3_V=OFF; ErrBell3_M=OFF;
        printf("B");
    }
    if (I4BOFF___V>OFF){
        Bell(4,OFF); O4BELL___V=OFF; ErrBell3_V=OFF; ErrBell3_M=OFF;
        printf("B");
    }
    if (ErrBell3_M>OFF){
        Bell(3,OFF); Bell(4,OFF);
        O3BELL___V=OFF; O4BELL___V=OFF; ErrBell3_V=OFF; ErrBell3_M=OFF;
        printf("B");
    }
    //-----------------------------------------------------------------------
    // Вывод и установка времени и даты
    TimeCSS3_V=secC; TimeCSM3_V=minC; TimeCSH3_V=houC;
    DateCSD3_V=dayC; DateCSM3_V=monC; DateCSY3_V=yeaC;
    if(TMDTSet3_M>0){
       secC=TimeCSS3_M; minC=TimeCSM3_M; houC=TimeCSH3_M;
       dayC=DateCSD3_M; monC=DateCSM3_M; yeaC=DateCSY3_M;
       SetTime(houC, minC, secC);
       SetDate(yeaC, monC, dayC); Message(12,0); TMDTSet3_M=0;
    }
    //-----------------------------------------------------------------------
    // Передача номера текущего сообщения
    if (FirstCall>PAMSG){
       if (CurMESS3_V!=nMESSAGE){ CurMESS3_V=nMESSAGE; }
    } else {
       MessageCLS();
    }
    //-----------------------------------------------------------------------
    // Если передан флаг выхода из программы
    if (ExitFLG3_M>0){ ExitForLoad=ExitFLG3_M; ExitFLG3_M=0; }
    //-----------------------------------------------------------------------
    // Установка значений переданных оператором (из верхнего уровня)
    SetVal();
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
