// coding: cp866
//----------------------------------------------------------------------------
//  COM2, 7033, N08

    rec=7;

    // Значения НУЛЯ и ДИАПАЗОНА по умолчанию, если они не заданы
    if(AIT332_SDV==0){ AIT332_SDM=100.2; AIT332_SZV=-0.2; }
    if(AIT421_SDV==0){ AIT421_SDM=100.2; AIT421_SZV=-0.2; }
    if(AIT422_SDV==0){ AIT422_SDM=100.2; AIT422_SZV=-0.2; }

    // Первые N секунд берем значения с датчиков с макс фильтром скачков,
    // чтобы  сразу выйти на реальные значения параметров
    if(PAINPC<PAINP ){
       AIT332__FV=AIT332_SDV;
       AIT421__FV=AIT421_SDV;
       AIT422__FV=AIT422_SDV;
    }

    // Получить преобразованные значения с каналов модуля
    AIT332___V=AISet(36,GetMODV(COMU1,rec,0),0,32768,0,AIT332_SDV,AIT332__AV,AIT332__FV)+AIT332_SZV;
    if(AIT332___V<-1) AIT332___V=-1;

    AIT421___V=AISet(37,GetMODV(COMU1,rec,1),0,32768,0,AIT421_SDV,AIT421__AV,AIT421__FV)+AIT421_SZV;
    if(AIT421___V<-1) AIT421___V=-1;

    AIT422___V=AISet(38,GetMODV(COMU1,rec,2),0,32768,0,AIT422_SDV,AIT422__AV,AIT422__FV)+AIT422_SZV;
    if(AIT422___V<-1) AIT422___V=-1;

//----------------------------------------------------------------------------
