// coding: cp866
//----------------------------------------------------------------------------
//  COM2, 7033, N06

    rec=5;

    // Значения НУЛЯ и ДИАПАЗОНА по умолчанию, если они не заданы
    if(AIT311_SDV==0){ AIT311_SDM=100.2; AIT311_SZV=-0.2; }
    if(AIT321_SDV==0){ AIT321_SDM=100.2; AIT321_SZV=-0.2; }
    if(AIT322_SDV==0){ AIT322_SDM=100.2; AIT322_SZV=-0.2; }

    // Первые N секунд берем значения с датчиков с макс фильтром скачков,
    // чтобы  сразу выйти на реальные значения параметров
    if(PAINPC<PAINP ){
       AIT311__FV=AIT311_SDV;
       AIT321__FV=AIT321_SDV;
       AIT322__FV=AIT322_SDV;
    }

    // Получить преобразованные значения с каналов модуля
    AIT311___V=AISet(30,GetMODV(COMU1,rec,0),0,32768,0,AIT311_SDV,AIT311__AV,AIT311__FV)+AIT311_SZV;
    if(AIT311___V<-1) AIT311___V=-1;

    AIT321___V=AISet(31,GetMODV(COMU1,rec,1),0,32768,0,AIT321_SDV,AIT321__AV,AIT321__FV)+AIT321_SZV;
    if(AIT321___V<-1) AIT321___V=-1;

    AIT322___V=AISet(32,GetMODV(COMU1,rec,2),0,32768,0,AIT322_SDV,AIT322__AV,AIT322__FV)+AIT322_SZV;
    if(AIT322___V<-1) AIT322___V=-1;

//----------------------------------------------------------------------------
