// coding: cp866
//----------------------------------------------------------------------------
//  COM2, 7033, N04

    rec=3;

    // Значения НУЛЯ и ДИАПАЗОНА по умолчанию, если они не заданы
    if(AIT101_SDV==0){ AIT101_SDM=100.2; AIT101_SZV=-0.2; }
    if(AIT102_SDV==0){ AIT102_SDM=100.2; AIT102_SZV=-0.2; }
    if(AIT103_SDV==0){ AIT103_SDM=100.2; AIT103_SZV=-0.2; }

    // Первые N секунд берем значения с датчиков с макс фильтром скачков,
    // чтобы  сразу выйти на реальные значения параметров
    if(PAINPC<PAINP ){
       AIT101__FV=AIT101_SDV;
       AIT102__FV=AIT102_SDV;
       AIT103__FV=AIT103_SDV;
    }

    // Получить преобразованные значения с каналов модуля
    AIT101___V=AISet(24,GetMODV(COMU1,rec,0),0,32768,0,AIT101_SDV,AIT101__AV,AIT101__FV)+AIT101_SZV;
    if(AIT101___V<-1) AIT101___V=-1;

    AIT102___V=AISet(25,GetMODV(COMU1,rec,1),0,32768,0,AIT102_SDV,AIT102__AV,AIT102__FV)+AIT102_SZV;
    if(AIT102___V<-1) AIT102___V=-1;

    AIT103___V=AISet(26,GetMODV(COMU1,rec,2),0,32768,0,AIT103_SDV,AIT103__AV,AIT103__FV)+AIT103_SZV;
    if(AIT103___V<-1) AIT103___V=-1;

//----------------------------------------------------------------------------
