// coding: cp866
//----------------------------------------------------------------------------
//  COM2, 7033, N05

    rec=4;

    // Значения НУЛЯ и ДИАПАЗОНА по умолчанию, если они не заданы
    if(AIT104_SDV==0){ AIT104_SDM=100.2; AIT104_SZV=-0.2; }
    if(AIT105_SDV==0){ AIT105_SDM=100.2; AIT105_SZV=-0.2; }
    if(AIT106_SDV==0){ AIT106_SDM=100.2; AIT106_SZV=-0.2; }

    // Первые N секунд берем значения с датчиков с макс фильтром скачков,
    // чтобы  сразу выйти на реальные значения параметров
    if(PAINPC<PAINP ){
       AIT104__FV=AIT104_SDV;
       AIT105__FV=AIT105_SDV;
       AIT106__FV=AIT106_SDV;
    }

    // Получить преобразованные значения с каналов модуля
    AIT104___V=AISet(27,GetMODV(COMU1,rec,0),0,32768,0,AIT104_SDV,AIT104__AV,AIT104__FV)+AIT104_SZV;
    if(AIT104___V<-1) AIT104___V=-1;

    AIT105___V=AISet(28,GetMODV(COMU1,rec,1),0,32768,0,AIT105_SDV,AIT105__AV,AIT105__FV)+AIT105_SZV;
    if(AIT105___V<-1) AIT105___V=-1;

    AIT106___V=AISet(29,GetMODV(COMU1,rec,2),0,32768,0,AIT106_SDV,AIT106__AV,AIT106__FV)+AIT106_SZV;
    if(AIT106___V<-1) AIT106___V=-1;

//----------------------------------------------------------------------------
