//---------------------------------------------------------------------------
// состояние ключей режимов
_i far DIR010S=0, DIR020S=0, DIR031S=0, DIR041S=0, DIR051S=0, DIR061S=0;
_i far DIR070S=0, DIR100S=0, DIR110S=0, DIR120S=0, DIR130S=0, DIR140S=0;
_i far DIR160S=0, DIR170S=0, DIR190S=0, DIR200S=0, DIR210S=0, DIR220S=0;
_i far DIR230S=0, DIR240S=0, DIR260S=0, DIR270S=0, DIR280S=0, DIR290S=0;
_i far DIR300S=0, DIR310S=0, DIR131S=0, DIR161S=0;
//---------------------------------------------------------------------------
