//----------------------------------------------------------------------------
vd  far Signal(vd){

    //------------------------------------------------------------------------
    // состояние продувки 3 зоны БМ
    DISPBM3__S = Control_DI( DISPBM3__V, DISPBM3__S, 200, 201 );
    //------------------------------------------------------------------------
    // состояние продувки 6 зоны БМ
    DISPBM6__S = Control_DI( DISPBM6__V, DISPBM6__S, 202, 203 );
    //------------------------------------------------------------------------
    // состояние продувки холодного дефекатора
    DISPHD___S = Control_DI( DISPHD___V, DISPHD___S, 204, 205 );
    //------------------------------------------------------------------------
    // состояние продувки гарячего дефекатора
    DISPGD___S = Control_DI( DISPGD___V, DISPGD___S, 206, 207 );
    //------------------------------------------------------------------------
    // состояние продувки предсатуратора
    DISPP1___S = Control_DI( DISPP1___V, DISPP1___S, 208, 209 );
    //------------------------------------------------------------------------
    // состояние продувки котла 1 сатурации
    DISP1ST__S = Control_DI( DISP1ST__V, DISP1ST__S, 210, 211 );
    //------------------------------------------------------------------------
    // состояние продувки дефекатора 2 сатурации
    DISPD2S__S = Control_DI( DISPD2S__V, DISPD2S__S, 212, 213 );
    //------------------------------------------------------------------------
    // состояние продувки котла 2 сатурации
    DISP2ST__S = Control_DI( DISP2ST__V, DISP2ST__S, 214, 215 );


    //------------------------------------------------------------------------
    // состояние уровня преддефекатора Бригель-Мюллера
    DILDBM___S = Control_DI( DILDBM___V, DILDBM___S, 216, 217 );
    //------------------------------------------------------------------------
    // состояние уровня мешалки известкового молока
    DILMIM___S = Control_DI( DILMIM___V, DILMIM___S, 218, 219 );
    //------------------------------------------------------------------------
    // состояние привода мешалки известкового молока
    DISMIM___S = Control_DI( DISMIM___V, DISMIM___S, 220, 221 );
    //------------------------------------------------------------------------
    // состояние привода мешалки суспензии вакуум-фильтров
    DISMSVF__S = Control_DI( DISMSVF__V, DISMSVF__S, 222, 223 );
    //------------------------------------------------------------------------
    // состояние шнека сборника продувок
    DISSHZP__S = Control_DI( DISSHZP__V, DISSHZP__S, 224, 225 );


    //------------------------------------------------------------------------
    // состояние давления нагнетания сока с преддефекатора
    DIPSBM___S = Control_DI( DIPSBM___V, DIPSBM___S, 228, 229 );
    //------------------------------------------------------------------------
    // состояние давления нагнетания сока с холодного дефекатора на подогреватель
    DIPSHD___S = Control_DI( DIPSHD___V, DIPSHD___S, 230, 231 );
    //------------------------------------------------------------------------
    // состояние давления нагнетания сока с котла 1 сатурации на подогреватель перед фильтрацией
    DIPS1ST__S = Control_DI( DIPS1ST__V, DIPS1ST__S, 232, 233 );
    //------------------------------------------------------------------------
    // состояние давления нагнетания суспензии фильтров 1 сатурации на вакуум-фильтры
    DIPSVF___S = Control_DI( DIPSVF___V, DIPSVF___S, 234, 235 );
    //------------------------------------------------------------------------
    // состояние давления нагнетания сока на подогреватель перед дефекатором 2 сатурации   
    DIPSD2S__S = Control_DI( DIPSD2S__V, DIPSD2S__S, 236, 237 );
    //------------------------------------------------------------------------
    // состояние давления нагнетания нефильтрованого сока 1 сатурации на фильтры           
    DIPNS1F__S = Control_DI( DIPNS1F__V, DIPNS1F__S, 238, 239 );
    //------------------------------------------------------------------------
    // состояние давления нагнетания суспензии фильтров 2 сатурации на 1 сатурацию           
    DIPS2S1__S = Control_DI( DIPS2S1__V, DIPS2S1__S, 240, 241 );
    //------------------------------------------------------------------------
    // состояние давления нагнетания сульфитированного сока на выпарную станцию              
    DIPSSVP__S = Control_DI( DIPSSVP__V, DIPSSVP__S, 242, 243 );
    //------------------------------------------------------------------------
    // состояние продувки на гарячий дефекатор со сборника продувок                          
    DIPGDZP__S = Control_DI( DIPGDZP__V, DIPGDZP__S, 244, 245 );
    //------------------------------------------------------------------------
    // состояние насоса сборника продувок                          
    DIX0C09__S = Control_DI( DIX0C09__V, DIX0C09__S, 246, 247 );

    //------------------------------------------------------------------------
    // состояние напряжения питания в шкафу КИПиА                                            
    DIS24VK__S = Control_DI( DIS24VK__V, DIS24VK__S, 250, 251 );
    //------------------------------------------------------------------------
    // состояние напряжения питания в шкафу АСУ                                              
    DIS24VA__S = Control_DI( DIS24VA__V, DIS24VA__S, 252, 253 );
    //------------------------------------------------------------------------
    // состояние кнопки звукового сигнала                                                    
    DISZVS___S = Control_DI( DISZVS___V, DISZVS___S, 254, 255 );





    //------------------------------------------------------------------------
    // температура холодного дефекатора
    AITHDF___S=Control_AI(AITHDF___V,
                          AITHDF_AZV,AITHDF_AMV,AITHDF___S, 300,301,302, 1);
    //------------------------------------------------------------------------
    // температура горячего дефекатора
    AITGDF___S=Control_AI(AITGDF___V,
                          AITGDF_AZV,AITGDF_AMV,AITGDF___S, 303,304,305, 1);
    //------------------------------------------------------------------------
    // температура в котле 1 сатурации
    AIT1ST___S=Control_AI(AIT1ST___V,
                          AIT1ST_AZV,AIT1ST_AMV,AIT1ST___S, 306,307,308, 1);
    //------------------------------------------------------------------------
    // температура фильтрованного сока 1 сатурации до подогревателя
    AITF1D___S=Control_AI(AITF1D___V,
                          AITF1D_AZV,AITF1D_AMV,AITF1D___S, 309,310,311, 1);
    //------------------------------------------------------------------------
    // температура сока в котле 2 сатурации
    AIT2ST___S=Control_AI(AIT2ST___V,
                          AIT2ST_AZV,AIT2ST_AMV,AIT2ST___S, 312,313,314, 1);
    //------------------------------------------------------------------------
    // температура подогревателей 1 группы 
    AIT1GR___S=Control_AI(AIT1GR___V,
                          AIT1GR_AZV,AIT1GR_AMV,AIT1GR___S, 315,316,317, 1);
    //------------------------------------------------------------------------
    // температура подогревателей 2 группы 
    AIT2GR___S=Control_AI(AIT2GR___V,
                          AIT2GR_AZV,AIT2GR_AMV,AIT2GR___S, 318,319,320, 1);
    //------------------------------------------------------------------------
    // температура нефильтрованного сока 1 сатурации
    AITNS1___S=Control_AI(AITNS1___V,
                          AITNS1_AZV,AITNS1_AMV,AITNS1___S, 321,322,323, 1);


    //------------------------------------------------------------------------
    // температура подогревателя 1 секции перед выпаркой
    AITNS2___S=Control_AI(AITNS2___V,
                          AITNS2_AZV,AITNS2_AMV,AITNS2___S, 324,325,326, 1);
    //------------------------------------------------------------------------
    // температура подогревателя 2 секции перед выпаркой
    AITNS2___S=Control_AI(AITNS2___V,
                          AITNS2_AZV,AITNS2_AMV,AITNS2___S, 327,328,329, 1);
    //------------------------------------------------------------------------
    // температура фильтрованного сока 1 сатурации после подогревателя
    AITF1P___S=Control_AI(AITF1P___V,
                          AITF1P_AZV,AITF1P_AMV,AITF1P___S, 330,331,332, 1);
    //------------------------------------------------------------------------
    // температура в подогревателе сока перед выпарной станцией 3 секция
    AITDVP___S=Control_AI(AITDVP___V,
                          AITDVP_AZV,AITDVP_AMV,AITDVP___S, 333,334,335, 1);


    //------------------------------------------------------------------------
    // давление сатурационного газа в общем коллекторе
    AIPGOK___S=Control_AI(AIPGOK___V,
                          AIPGOK_AZV,AIPGOK_AMV,AIPGOK___S, 348,349,350, 1);
    //------------------------------------------------------------------------
    // давление в напорном сборнике сока 1 сатурации
    AIPZNS1__S=Control_AI(AIPZNS1__V,
                          AIPZNS1AZV,AIPZNS1AMV,AIPZNS1__S, 351,352,353, 1);
    //------------------------------------------------------------------------
    // давление в напорном сборнике сока 2 сатурации
    AIPZNS2__S=Control_AI(AIPZNS2__V,
                          AIPZNS2AZV,AIPZNS2AMV,AIPZNS2__S, 354,355,356, 1);
    //------------------------------------------------------------------------
    // давление в напорном сборнике контрольной фильтрации
    AIPNZKF__S=Control_AI(AIPNZKF__V,
                          AIPNZKFAZV,AIPNZKFAMV,AIPNZKF__S, 357,358,359, 1);
    //------------------------------------------------------------------------
    // давление воздуха КИПиА
    AIPVKIP__S=Control_AI(AIPVKIP__V,
                          AIPVKIPAZV,AIPVKIPAMV,AIPVKIP__S, 360,361,362, 1);


    //------------------------------------------------------------------------
    // расход дифузионного сока
    AIFDFS___S=Control_AI(AIFDFS___V,
                          AIFDFS_AZV,AIFDFS_AMV,AIFDFS___S, 372,373,374, 1);
    //------------------------------------------------------------------------
    // расход известкового молока на преддефекатор Бригель-Мюллера
    AIFIMBM__S=Control_AI(AIFIMBM__V,
                          AIFIMBMAZV,AIFIMBMAMV,AIFIMBM__S, 375,376,377, 1);
    //------------------------------------------------------------------------
    // расход сока на холодный дефекатор
    AIFSHDF__S=Control_AI(AIFSHDF__V,
                          AIFSHDFAZV,AIFSHDFAMV,AIFSHDF__S, 378,379,380, 1);
    //------------------------------------------------------------------------
    // расход сока на возврат 1 сатурации
    AIFSVZ___S=Control_AI(AIFSVZ___V,
                          AIFSVZ_AZV,AIFSVZ_AMV,AIFSVZ___S, 381,382,383, 1);
    //------------------------------------------------------------------------
    // расход известкового молока на 2 сатурацию
    AIFIM2S__S=Control_AI(AIFIM2S__V,
                          AIFIM2SAZV,AIFIM2SAMV,AIFIM2S__S, 384,385,386, 1);
    //------------------------------------------------------------------------
    // расход фильтрованного сока 1 сатурации
    AIFSD2S__S=Control_AI(AIFSD2S__V,
                          AIFSD2SAZV,AIFSD2SAMV,AIFSD2S__S, 387,388,389, 1);
    //------------------------------------------------------------------------
    // расход суспензии 2 сатурации
    AIFSP2S__S=Control_AI(AIFSP2S__V,
                          AIFSP2SAZV,AIFSP2SAMV,AIFSP2S__S, 390,391,392, 1);


    //------------------------------------------------------------------------
    // уровень нефильтрованного сока 1 сатурации
    AILNS1S__S=Control_AI(AILNS1S__V,
                          AILNS1SAZV,AILNS1SAMV,AILNS1S__S, 396,397,398, 1);
    //------------------------------------------------------------------------
    // уровень фильтрованного сока 1 сатурации
    AILFS1S__S=Control_AI(AILFS1S__V,
                          AILFS1SAZV,AILFS1SAMV,AILFS1S__S, 399,400,401, 1);
    //------------------------------------------------------------------------
    // уровень нефильтрованного сока 2 сатурации
    AILNS2S__S=Control_AI(AILNS2S__V,
                          AILNS2SAZV,AILNS2SAMV,AILNS2S__S, 402,403,404, 1);
    //------------------------------------------------------------------------
    // уровень в сборнике сульфитированного сока
    AILZSS___S=Control_AI(AILZSS___V,
                          AILZSS_AZV,AILZSS_AMV,AILZSS___S, 405,406,407, 1);
    //------------------------------------------------------------------------
    // уровень в сборнике суспензии 2 сатурации
    AILZO2S__S=Control_AI(AILZO2S__V,
                          AILZO2SAZV,AILZO2SAMV,AILZO2S__S, 408,409,410, 1);
    //------------------------------------------------------------------------
    // уровень в сборнике суспензии вакуум-фильтров
    AILZSVF__S=Control_AI(AILZSVF__V,
                          AILZSVFAZV,AILZSVFAMV,AILZSVF__S, 411,412,413, 1);
    //------------------------------------------------------------------------
    // уровень в сборнике продувок
    AILZPR___S=Control_AI(AILZPR___V,
                          AILZPR_AZV,AILZPR_AMV,AILZPR___S, 414,415,416, 1);
    //------------------------------------------------------------------------
    // уровень в сборнике суспензии 1 сатурации
    AILZO1S__S=Control_AI(AILZO1S__V,
                          AILZO1SAZV,AILZO1SAMV,AILZO1S__S, 417,418,419, 1);


    //------------------------------------------------------------------------
    // рН 3 секции преддефекатора Бригель-Мюллера
    AIHBM3___S=Control_AI(AIHBM3___V,
                          AIHBM3_AZV,AIHBM3_AMV,AIHBM3___S, 418,419,420, 1);
    //------------------------------------------------------------------------
    // рН 6 секции преддефекатора Бригель-Мюллера
    AIHBM6___S=Control_AI(AIHBM6___V,
                          AIHBM6_AZV,AIHBM6_AMV,AIHBM6___S, 421,422,423, 1);

    //------------------------------------------------------------------------
    // рН в котле 1 сатурации
    AIH1ST___S=Control_AI(AIH1ST___V,
                          AIH1ST_AZV,AIH1ST_AMV,AIH1ST___S, 430,431,432, 1);
    //------------------------------------------------------------------------
    // рН в котле 2 сатурации
    AIH2ST___S=Control_AI(AIH2ST___V,
                          AIH2ST_AZV,AIH2ST_AMV,AIH2ST___S, 433,434,435, 1);





                                                              

    return;
}
//----------------------------------------------------------------------------

