// coding: cp866
//----------------------------------------------------------------------------
//  COM2, 7080, N0A
    
    rec=10;

    // КТ2 Расход воды на теплообменник
    AIF331_R0V=GetMODV(COMU1,rec+0,0);
//  AIF331_R0V=modcnt;
    if(AIF331_R0V>0){ 
       AIF331VC=AIF331_R0V; if(AIF331FS>0){ AIF331VO=AIF331VC; AIF331FS=0; }
    }

    // КТ2 Расход гор воды на ТП4
    AIF332_R0V=GetMODV(COMU1,rec+1,0);
//  AIF332_R0V=modcnt;
    if(AIF332_R0V>0){ 
       AIF332VC=AIF332_R0V; if(AIF332FS>0){ AIF332VO=AIF332VC; AIF332FS=0; }
    }

//----------------------------------------------------------------------------
