//---------------------------------------------------------------------------
// Температура в емкости вода-ПАВ

#include "..\lib\codlib.h"
#include "..\lib\codipccs.def"
#include "..\lib\codipccs.h"
#include "..\run_prgv.h"

#include "regul_e.h"

ui far RMO=0;                              // запомнен состояние флага Р/А

//---------------------------------------------------------------------------
vd  far Regul_14(vd){
    //-----------------------------------------------------------------------
    ui  RN=4;                         // Номер регулятора
    _f  IL=0;                         // Входная шкала (нижняя граница)
    _f  IH=100;                       // Входная шкала (верхняя граница)
    _f  OL=0.000;                     // Выходная шкала (клапан),%, н.гр.
    _f  OH=100.0;                     // Выходная шкала (клапан),%, в.гр.
    _f  DM=20.00;                     // Макс приращ вых регулятора
    _f  ZN=100*0.001;                 // Зона нечуствительности
    _f  PR=20.00;                     // Процент рассогласования
    _f  CC=20;                        // Контрольный цикл
    ui  TP=1;                         // Тип регулятора
    //-----------------------------------------------------------------------
    // ручное-автомат
    if ( REG14RS__M == SWITCH ){
         AOT270__RM = (AOT270__RM==ON) then_ OFF else_ ON; REG14RS__M=OFF;
    };
    if (AOT270__RM!=AOT270__RV){
        AOT270__RV =AOT270__RM;
        if(AOT270__RV>0){ Message(450); }
        else            { Message(451); AOT270__OM=AOT270__OV=WO_Skip[RN];  }
    };  RMO=AOT270__RV;                    // запомнить флаг Р/А
    //-----------------------------------------------------------------------
    // установка задания
    if (AOT270__ZM <  IL         ){ AOT270__ZM = IL; }
    if (AOT270__ZM >  AIT270_AMV ){ AOT270__ZM = AIT270_AMV; }
        AOT270__ZV =  AOT270__ZM;
    // выход на клапан ручного управления
    if (AOT270__OM < 0  ){ AOT270__OM =0;   }
    if (AOT270__OM > 100){ AOT270__OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOT270_LOV =AOT270_LOM;
    AOT270_HOV =AOT270_HOM;
    // ограничение выхода на приборы снизу и сверху
    AOT270_LPV =AOT270_LPM;
    AOT270_HPV =AOT270_HPM;
    // коэффициенты регулятора
    AOT270__PV =AOT270__PM;
    AOT270__IV =AOT270__IM;
    AOT270__DV =AOT270__DM;
    AOT270__MV =AOT270__MM;
    // если не установлен флаг включения регулятора (нечего греть(нет ПАВ))
    if (DIS275___S==OFF){
        AOT270__ZV=0;          // сбросить задание
        AOT270__OM=0;          // сбросить ручной выход
        AOT270__RV=0;          // флаг ручное-автомат перевести на РУЧНОЕ
    }
    //-----------------------------------------------------------------------
    if (RegRUN==ON){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOT270__OV=Regulator(RN, AIT270___V,
                                AOT270__PV, AOT270__IV, AOT270__DV, AOT270__MV,
                                AOT270__OM, AOT270__RV,
                                AOT270__ZV, AOT270__ZV,
                                IL, IH, OL, OH,
                                DM, ZN, PR, CC, TP
       );
       // ограничение выхода, %
       if (AOT270__OV <  OL+AOT270_LOV){ AOT270__OV=OL+AOT270_LOV; }
       if (AOT270__OV >  OH-AOT270_HOV){ AOT270__OV=OH-AOT270_HOV; }
       if (AOT270__MV >= 0){ AOT270_OOV=100-AOT270__OV; }
       else                { AOT270_OOV=AOT270__OV; }
       //--------------------------------------------------------------------
       // дискретный регулятор
       AOT270__UV=RegulDigit(RN, AOT270_LPV, AOT270_HPV, AOT270__MV,
                                 AOT270__RV, AOT270__UM);
       //--------------------------------------------------------------------
       if(AOT270__MV< 0){
          if((AOT270__ZV-AIT270___V)*AOT270__PV>0){
              if(AOT270__UV==RPLUS){
                 AOT270__UV=RMINUS;
              } else {
                 if(AOT270__UV==RMINUS){ AOT270__UV=RPLUS; }
              }
          }
       }
       //--------------------------------------------------------------------
       // установить выход на клапана в зависимости от выхода регулятора
       if(AOT270__UV==RPLUS ){ DON273O__V=1; DON273C__V=0; }
       if(AOT270__UV==RMINUS){ DON273O__V=0; DON273C__V=1; }
       if(AOT270__UV==RSTOP ){ DON273O__V=0; DON273C__V=0; }
       // если флаг работы регулятора выключен- закрыть подачу пара
       if(DIS275___S==OFF){ DON273O__V=0; DON273C__V=1; }
       // сбросить ручной выход в неопределенное состояние
       AOT270__UM= RNA;
       // рассогласование выхода регулятора
       AOT270__XV= OutX[RN];
       // другие парамметры дискретного регулятора для отладки
       AOT270_CPV= ImpPC[RN];
       AOT270_CWV= ImpWC[RN];
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------
    AOT270__RV=RMO;                              // восстановить флаг Р/А
    return;
}
//---------------------------------------------------------------------------
