//---------------------------------------------------------------------------
// Температура ШБ №2

#include "..\lib\codlib.h"
#include "..\lib\codipccs.def"
#include "..\lib\codipccs.h"
#include "..\run_prgv.h"

#include "regul_e.h"

//---------------------------------------------------------------------------
vd  far Regul_12(vd){
    //-----------------------------------------------------------------------
    ui  RN=2;                         // Номер регулятора
    _f  IL=0;                         // Входная шкала (нижняя граница)
    _f  IH=100;                       // Входная шкала (верхняя граница)
    _f  OL=0.000;                     // Выходная шкала (клапан),%, н.гр.
    _f  OH=100.0;                     // Выходная шкала (клапан),%, в.гр.
    _f  DM=20.00;                     // Макс приращ вых регулятора
    _f  ZN=100*0.001;                 // Зона нечуствительности
    _f  PR=20.00;                     // Процент рассогласования
    _f  CC=20;                        // Контрольный цикл
    ui  TP=1;                         // Тип регулятора
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if ( REG12RS__M == SWITCH ){
         AOT040__RM = (AOT040__RM==ON) then_ OFF else_ ON; REG12RS__M=OFF;
    }
    if (AOT040__RM!=AOT040__RV){
        AOT040__RV =AOT040__RM;
        if(AOT040__RV>0){ Message(430); }
        else            { Message(431); AOT040__OM=AOT040__OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOT040__ZM <  IL         ){ AOT040__ZM = IL; }
    if (AOT040__ZM >  AIT040_AMV ){ AOT040__ZM = AIT040_AMV; }
        AOT040__ZV =  AOT040__ZM;
    // выход на клапан ручного управления
    if (AOT040__OM < 0  ){ AOT040__OM =0;   }
    if (AOT040__OM > 100){ AOT040__OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOT040_LOV =AOT040_LOM;
    AOT040_HOV =AOT040_HOM;
    // ограничение выхода на приборы снизу и сверху
    AOT040_LPV =AOT040_LPM;
    AOT040_HPV =AOT040_HPM;
    // коэффициенты регулятора
    AOT040__PV =AOT040__PM;
    AOT040__IV =AOT040__IM;
    AOT040__DV =AOT040__DM;
    AOT040__MV =AOT040__MM;
    //-----------------------------------------------------------------------
    if (RegRUN==ON){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOT040__OV=Regulator(RN, AIT040___V,
                                AOT040__PV, AOT040__IV, AOT040__DV, AOT040__MV,
                                AOT040__OM, AOT040__RV,
                                AOT040__ZV, AOT040__ZV,
                                IL, IH, OL, OH,
                                DM, ZN, PR, CC, TP
       );
       // ограничение выхода, %
       if (AOT040__OV <  OL+AOT040_LOV){ AOT040__OV=OL+AOT040_LOV; }
       if (AOT040__OV >  OH-AOT040_HOV){ AOT040__OV=OH-AOT040_HOV; }
       if (AOT040__MV >= 0){ AOT040_OOV=100-AOT040__OV; }
       else                { AOT040_OOV=AOT040__OV; }
       //--------------------------------------------------------------------
       // дискретный регулятор
       AOT040__UV=RegulDigit(RN, AOT040_LPV, AOT040_HPV, AOT040__MV,
                                 AOT040__RV, AOT040__UM);
       //--------------------------------------------------------------------
       if(AOT040__MV< 0){
          if((AOT040__ZV-AIT040___V)*AOT040__PV>0){
              if(AOT040__UV==RPLUS){
                 AOT040__UV=RMINUS;
              } else {
                 if(AOT040__UV==RMINUS){ AOT040__UV=RPLUS; }
              }
          }
       }
       //--------------------------------------------------------------------
       // установить выход на клапана в зависимости от выхода регулятора
       if(AOT040__UV==RPLUS ){ DON043O__V=1; DON043C__V=0; }
       if(AOT040__UV==RMINUS){ DON043O__V=0; DON043C__V=1; }
       if(AOT040__UV==RSTOP ){ DON043O__V=0; DON043C__V=0; }
       // сбросить ручной выход в неопределенное состояние
       AOT040__UM= RNA;
       // рассогласование выхода регулятора
       AOT040__XV= OutX[RN];
       // другие парамметры дискретного регулятора для отладки
       AOT040_CPV= ImpPC[RN];
       AOT040_CWV= ImpWC[RN];
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------
    return;
}
//---------------------------------------------------------------------------
