//---------------------------------------------------------------------------
// Подкачка вода-ПАВ

#include "..\lib\codlib.h"
#include "..\lib\codipccs.def"
#include "..\lib\codipccs.h"
#include "..\run_prgv.h"

#include "regul_e.h"

_f far *DONPR10;                 // текущий сигнал (комманда) выхода на исполн
_i far  DONCN10=0;               // счетчик цикла передергивания              
_i far  DONCH10=2;               // заданное кол-во циклов для передергивания 
_i far  DONTM10=2;               // кол-во секунд вкл и паузы
_i far  STEP10X=0;               // запомненный шаг при выключении регулятора

//---------------------------------------------------------------------------
//  Определения для передергивание исполнителей регулятора при несработке
vd  Isp10PD(_f *IOPNT,_i far hM,_i far hS,_i far Step,_i far Step_Back,_i far ClearTON){
    DONPR10= IOPNT;
    DONCH10= hM;
    DONTM10= hS;
    STEP10 = Step; 
    STEP10_PRBK = Step_Back;
    Clear_TO(ClearTON);
    return;
}
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//  Выключение исполнителей регулятора
vd  far Regul_10off(vd){
    DON272___V = OFF;
    DON274___V = OFF;
    DON301___V = OFF;
    DIS275___W = OFF;
    DIS275___S = OFF;
    return;
}
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//  Выполнение действий при выключеном регуляторе
vd  far Regul_10m(vd){
    //-----------------------------------------------------------------------
    if ( STEP10 == 101 ){
         REG10SW__V=1001;
         Regul_10off();
         COUN_PADZC=COUN_PADZW;
         STEP10 =  102;
    }
    //-----------------------------------------------------------------------
    if ( STEP10 == 102 ){
         REG10SW__V = 1002;
         REG10R___M = OFF;
         return;
    }
    //-----------------------------------------------------------------------
    STEP10=101;
    return;
}
//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
vd  far Regul_10(vd){
    // установки для работы регулятора, определяемые оператором 

    // время ожидания засыпки ПАВ
    if (TIME_PAVZM <  0){ TIME_PAVZM =10; }
    if (TIME_PAVZM != TIME_PAVZV){ TIME_PAVZV = TIME_PAVZM; }    // 10 MIN
    // время перемешивания ПАВ
    if (TIME_PPM1M <  0){ TIME_PPM1M =20; }
    if (TIME_PPM1M != TIME_PPM1V){ TIME_PPM1V = TIME_PPM1M; }    // 20 MIN

    // температура вода-ПАВ
    if (TEMP_PAVDM <  0){ TEMP_PAVDM =30; }
    if (TEMP_PAVDM != TEMP_PAVDV){ TEMP_PAVDV = TEMP_PAVDM; }    // 30 C

    // время набора нижн уровня емкости вода-ПАВ
    if (TIME_PLLVW <  0){ TIME_PLLVW = 2; }                      // 2 MIN
    // время набора верх уровня емкости вода-ПАВ
    if (TIME_PHLVW <  0){ TIME_PHLVW = 5; }                      // 5 MIN

    // время набора нижн уровня нижн. мешалки ал.пасты
    if (TIME_PALNW <  0){ TIME_PALNW = 2; }                      // 2 MIN
    // время набора верх уровня нижн. мешалки ал.пасты
    if (TIME_PANNW <  0){ TIME_PANNW = 5; }                      // 5 MIN

    // время набора нижн уровня верх. мешалки ал.пасты
    if (TIME_PALVW <  0){ TIME_PALVW = 2; }                      // 2 MIN
    // время набора верх уровня верх. мешалки ал.пасты
    if (TIME_PANVW <  0){ TIME_PANVW = 5; }                      // 5 MIN

    // время выключения насоса
    if (TIME_PNOFM <  0){ TIME_PNOFM = 2; }                      // 2 MIN
    if (TIME_PNOFM != TIME_PNOFV){ TIME_PNOFV = TIME_PNOFM; }    // 10 MIN

    //  Контроль нижнего уровня емкости вода-ПАВ
    if (CTRL_LLVPM <  0){ CTRL_LLVPV = ON; CTRL_LLVPM = OFF; }   // ON
    if (CTRL_LLVPM == SWITCH){ 
        CTRL_LLVPV = (CTRL_LLVPV!=ON) then_ ON else_ OFF; CTRL_LLVPM=OFF;
    }
    //  Контроль верхнего уровня емкости вода-ПАВ
    if (CTRL_HLVPM <  0){ CTRL_HLVPV = ON; CTRL_HLVPM = OFF; }   // ON
    if (CTRL_HLVPM == SWITCH){ 
        CTRL_HLVPV = (CTRL_HLVPV!=ON) then_ ON else_ OFF; CTRL_HLVPM=OFF;
    }
    //  Контроль нижнего уровня нижн мешалки ал.пасты
    if (CTRL_LLM1M <  0){ CTRL_LLM1V = ON; CTRL_LLM1M = OFF; }   // ON
    if (CTRL_LLM1M == SWITCH){ 
        CTRL_LLM1V = (CTRL_LLM1V!=ON) then_ ON else_ OFF; CTRL_LLM1M=OFF;
    }
    //  Контроль верхнего уровня нижн мешалки ал.пасты
    if (CTRL_HLM1M <  0){ CTRL_HLM1V = ON; CTRL_HLM1M = OFF; }   // ON
    if (CTRL_HLM1M == SWITCH){ 
        CTRL_HLM1V = (CTRL_HLM1V!=ON) then_ ON else_ OFF; CTRL_HLM1M=OFF;
    }
    //  Контроль нижнего уровня верхн мешалки ал.пасты
    if (CTRL_LLM2M <  0){ CTRL_LLM2V = ON; CTRL_LLM2M = OFF; }   // ON
    if (CTRL_LLM2M == SWITCH){ 
        CTRL_LLM2V = (CTRL_LLM2V!=ON) then_ ON else_ OFF; CTRL_LLM2M=OFF;
    }
    //  Контроль верхнего уровня верхн мешалки ал.пасты
    if (CTRL_HLM2M <  0){ CTRL_HLM2V = ON; CTRL_HLM2M = OFF; }   // ON
    if (CTRL_HLM2M == SWITCH){ 
        CTRL_HLM2V = (CTRL_HLM2V!=ON) then_ ON else_ OFF; CTRL_HLM2M=OFF;
    }

    // Счетчик количества дозировок пасты
    if (COUN_PADZW <  0){ COUN_PADZW = 4;  }                     // 4 DOZ
    // определение состояния флага засыпки ПАВ (от оператора)
    if(DIS275___W==SWITCH){
       DIS275___W=(DIS275___W==ON) then_ OFF else_ ON;
    }

    // включение-выключение регулятора
    if ( REG10RS__M == SWITCH ){ 
         REG10R___M = (REG10R___M==ON) then_ OFF else_ ON; REG10RS__M=OFF;
    }
    if (REG10R___M!= REG10R___V){ 
        REG10R___M =(REG10R___M==ON) then_ ON else_ OFF;
        REG10R___V = REG10R___M; 
        if(REG10R___V>0){
           if(STEP10P==15){ Message(413); STEP10=STEP10X; }   // снять паузу
           else           { Message(410); STEP10=   0; }      // вкл  регулятор
        } else {
           if(STEP10P==11){ Message(411); STEP10= 101; }      // выкл регулятор
           else           { Message(412); STEP10= 15;  }      // пауза
        }
    }
    // если регулятор выключен
    if ( REG10R___V == OFF ){ Regul_10m(); return; }
    //-----------------------------------------------------------------------



    // КОЛИЧЕСТВО ДОЗИРОВОК пасты
    //-----------------------------------------------------------------------
    if (RegRUN==ON){
       // если вес больше 10 кг и флаг счетчика=0 увеличить счетчик загрузки
       if(AIW290___V>10  and FLAG_PADZC==0)  { FLAG_PADZZ++; }
       else                                  { FLAG_PADZZ=0; }
       // если вес меньше 2 кг и флаг счетчика=1 увеличить счетчик выгрузки
       if(AIW290___V<2   and FLAG_PADZC==1)  { FLAG_PADZV++; }
       else                                  { FLAG_PADZV=0; }
       //---------
       // если вес удерживается более 5 сек - считаем, что дозатор загружен
       if(AIW290___V>10  and FLAG_PADZC==0 and FLAG_PADZZ== 5 ){
          FLAG_PADZC=1;
       }
       // если вес удерживается более 5 сек - считаем, что дозатор выгружен
       // (прошла одна дозировка пасты)
       if(AIW290___V<2   and FLAG_PADZC==1 and FLAG_PADZV== 5 ){
          FLAG_PADZC=0;  COUN_PADZC++;
       }
       //---------
       if(FLAG_PADZZ>100){ FLAG_PADZZ=100; }
       if(FLAG_PADZV>100){ FLAG_PADZV=100; }
    }
    //-----------------------------------------------------------------------



    // ПРОВЕРКА УСЛОВИЙ включения регулятора
    //-----------------------------------------------------------------------
    if ( STEP10 == 0 ){
        if(STEP10P!=0){
           Clear_TO(191);
           Clear_TO(192);
           Clear_TO(193);
           Clear_TO(194);
           Clear_TO(195);
           Clear_TO(196);
           Clear_TO(197);
           Clear_TO(198);
           Clear_TO(199);
        }; STEP10P =0;
        Regul_10off();
        // если нет сигнала нижнего уровня в емкости вода-ПАВ
        // и включен контроль уровня - выйти
        REG10SW__V=1;
        if(DIL270___V==OFF and CTRL_LLVPV==ON){ return;  }
        // если нет сигнала нижнего уровня в нижн.мешалке ал.пасты
        // и включен контроль уровня - выйти
        REG10SW__V=2;
        if(DIL300___V==OFF and CTRL_LLM1V==ON){ return;  }
        // если емкость вода-ПАВ переведена на ручное управление- выйти
        REG10SW__V=3;
        if(DIR270___V==MANUAL){ return;  }
        // если нижн. мешалка ал.пасты переведена на ручное управление- выйти
        REG10SW__V=4;
        if(DIR300___V==MANUAL){ return;  }

        // проверка состояния исполнителей регулятора:
        REG10SW__V=5;
        // исполнители емкости вода-ПАВ
        if (DIS272___V==ON or DIS274___V==ON){ 
            switch(Check_TO(191,60*SEC, ZERO,'=',ON, 1)){
                case RUN: { return;; }
                case BAD: { Message(269); Bell(1); Clear_TO(191); return;; }
            }
        };  Clear_TO(191);
        // исполнители нижн мешалки ал.пасты
        if (DIS301___V==ON){ 
            switch(Check_TO(192,60*SEC, ZERO,'=',ON, 1)){
                case RUN: { return;; }
                case BAD: { Message(269); Bell(1); Clear_TO(192); return;; }
            }
        };  Clear_TO(192);
        TIME_PHLVCMin=0;            // обнулить счетчики времени набора 
        TIME_PHLVC   =0;            // в емкость вода-ПАВ
        TIME_PLLVCMin=0;
        TIME_PLLVC   =0;
        COUN_PADZC   =0;            // обнулить кол-во дозировок
        STEP10=1;
        return;
    }
    //------------------------------------------------------------------------



    // НАБОР ВОДЫ в емкость вода-ПАВ
    //------------------------------------------------------------------------
    if (STEP10 == 1 ){
        if(STEP10P!=1){
            ;;
        }; STEP10P =1;
        if(RegRUN==OFF){ return; }
        REG10SW__V=10;

        // открыть клапан набора воды
        // вода           ПАВ паста         насос             пар
        DON272___V=ON;;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;

        //-------------------------------------------------------------------
        // счетчик ожидания выключения сигнала нижнего уровня емкости вода-ПАВ:
        switch ( Check_TO(199, TIME_PLLVW*MIN, DIL270___V,'=',OFF, TIME_LSTBV )){
            case RUN:{ TIME_PLLVCMin++; TIME_PLLVC=TIME_PLLVCMin/MIN; break;; }
            // если за заданное время сигнал нижнего уровня емкости вода-ПАВ
            // остался сработанным
            case BAD:{ 
                        Bell(1); Message (234); Clear_TO(199); break;;  
                     }
            // за заданное время сигнал нижнего уровня емк вода-ПАВ пропал
            case END:{ 
                        if(CTRL_LLVPV==OFF){
                           TIME_PLLVCMin++; TIME_PLLVC=TIME_PLLVCMin/MIN;
                        } else {
                           Clear_TO(199);
                        }; break;;
                     }
        } 
        //--------------------------------------------------------------------

        //--------------------------------------------------------------------
        // счетчик ожидания включения сигнала верх уровня емкости вода-ПАВ:
        switch ( Check_TO(198, TIME_PHLVW*MIN, DIH270___V,'=',ON, TIME_LSTBV )){
            case RUN:{ TIME_PHLVCMin++; TIME_PHLVC=TIME_PHLVCMin/MIN; break;; }
            // если за заданное время сигнал верх уровня емкости вода-ПАВ
            // остался сработанным
            case BAD:{ 
                        Bell(1); Message(235); Message(680); Clear_TO(198); 
                        REG10R___M=OFF; break;
                     }
            // за заданное время сигнал нижнего уровня емк вода-ПАВ пропал
            case END:{ 
                        // если выкл контр вер ур меш отходов- считать время
                        if(CTRL_HLVPV==OFF){
                           TIME_PHLVCMin++; TIME_PHLVC=TIME_PHLVCMin/MIN;
                        }; break;;
                     }
        };  Clear_TO(198);
        //--------------------------------------------------------------------

        // ожидать появления сигнала верхнего уровня емкости вода-ПАВ
        switch ( Check_TO(191, TIME_PHLVW*MIN, DIH270___V,'=',ON, TIME_LSTBV )){
            case RUN:{ return;; }
        };  Clear_TO(191);

        // закрыть клапан набора воды в емк вода-ПАВ
        // вода           ПАВ паста         насос             пар              
        DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;

        // набрали воду в емкость вода-ПАВ - перейти на следующий шаг
        STEP10 = 2;
        return;
    }
    //------------------------------------------------------------------------



    // ЗАПРОС ОПЕРАТОРУ: Подать пар в емкость вода-ПАВ? (ДА/НЕТ)
    //------------------------------------------------------------------------
    if ( STEP10 == 2 ){
         if(STEP10P!=2){
           ;;
         }; STEP10P =2;
         if(RegRUN==OFF){ return; }
         REG10SW__V=20;
         // вода           ПАВ паста         насос             пар              
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;
         //
         if(REG10ZO1_W==END){ REG10ZO1_W=OFF; Clear_TO(191); }
         switch(Check_TO(191,1*MIN, REG10ZO1_W,'=',YES, 1)){
            case RUN:{ return;; }
            case BAD:{ 
                       Bell(1); Message(236); Clear_TO(191); REG10ZO1_W=REQ;
                       return;
                     }
         }; Clear_TO(191);
         REG10SW__V=21;
         REG10ZO1_W=OFF;
         // если есть сигнал от оператора о засыпке ПАВ перейти на след шаг
         DIS275___S=ON;      // установить флаг для регулятора температуры(14)
         DIS275___W=OFF;
         STEP10 = 3;
         return;
    }
    //------------------------------------------------------------------------



    // ОЖИДАНИЕ заданной ТЕМПЕРАТУРЫ в емкости вода-ПАВ
    //------------------------------------------------------------------------
    if ( STEP10 == 3 ){
         if(STEP10P!=3){
            ;;
         }; STEP10P =3;
         if(RegRUN==OFF){ return; }
         // вода           ПАВ паста         насос             пар              
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=ON;
         // проверка температуры емкости вода-ПАВ
         REG10SW__V=30;
         switch ( Check_TO(191, 20*MIN, AIT270___V,'>',TEMP_PAVDV, 5)){
             case RUN:{ return;; }
             case BAD:{ Clear_TO(191); return;; }
         };  Clear_TO(191);
         // если для нижней мешалки ал.пасты включен контроль НУ и нет 
         // сигнала НУ- ждать пока не появится сигнал или не выкл. контроль.
         REG10SW__V=31;
         if(CTRL_LLM1V==ON && DIL300___V==OFF){ return; }
         // если мешалка на ручном управлении- ждать...
         REG10SW__V=32;
         if(DIR300___V==MANUAL){ return; }
         // если не работает привод мешалки- ждать...
         REG10SW__V=33;
         if(DIS300___V==OFF){ return; }
         // переход на запрос оператору
         STEP10  = 4;
    }
    //------------------------------------------------------------------------



    // ЗАПРОС ОПЕРАТОРУ: начать набор ПАВ в нижнюю мешалку ал.пасты?
    //------------------------------------------------------------------------
    if ( STEP10 == 4 ){
         if(STEP10P!=4){
           ;;
         }; STEP10P =4;
         if(RegRUN==OFF){ return; }
         REG10SW__V=40;
         // вода           ПАВ паста         насос             пар              
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=ON;
         //                                                                   
         if(REG10ZO2_W==END){ REG10ZO2_W=OFF; Clear_TO(191); }
         switch(Check_TO(191,1*MIN, REG10ZO2_W,'=',YES, 1)){
            case RUN:{ return;; }
            case BAD:{ 
                       Bell(1); Message(239); Clear_TO(191); REG10ZO2_W=REQ;
                       return;
                     }
         }; Clear_TO(191);
         REG10SW__V=41;
         REG10ZO2_W=OFF;
         // закрыть клапан подачи пара
         DIS275___S=OFF;
         STEP10 = 5;
         return;
    }
    //------------------------------------------------------------------------



    // НАБОР ПАВ в нижнюю мешалку ал.пасты
    //------------------------------------------------------------------------
    if ( STEP10 == 5 ){
         if(STEP10P!=5){
            Clear_TO(198);
            Clear_TO(199);
            TIME_PALNC=0;
            TIME_PALNCMin=0;
            TIME_PANNC=0;
            TIME_PANNCMin=0;
         }; STEP10P=5;
         if(RegRUN==OFF){ return; }
         REG10SW__V=50;
         // закрыть клапан подачи пара
         DIS275___S=OFF;
         // открыть клапан набора ПАВ в нижнюю мешалку ал.пасты
         // вода           ПАВ паста         насос             пар            
         DON272___V=OFF;   DON274___V=ON;;   DON301___V=OFF;   DIS275___S=OFF;
         // если во время набора ПАВ в нижн мешалку ал.суспензии, 
         // выключился привод мешалки- выкл регулятор
         if(DIS300___V==OFF){
            Bell(1); Message(490); Message(680); Regul_10off(); 
            REG10R___M=OFF; return;
         }
         // если во время набора ПАВ в нижн мешалку ал.суспензии, 
         // перевели ключ в состоян. "Ручное"- выкл регулятор
         if(DIR300___V==MANUAL){
            Bell(1); Message(491); Message(680); Regul_10off(); 
            REG10R___M=OFF; return;
         }
         //-------------------------------------------------------------------
         // счетчик ожидания выключения сигнала нижнего уровня нижн мешалки:
         switch ( Check_TO(199, TIME_PALNW*MIN, DIL300___V,'=',OFF, TIME_LSTBV )){
             case RUN:{ TIME_PALNCMin++; TIME_PALNC=TIME_PALNCMin/MIN; break;; }
             // если за заданное время сигнал нижнего уровня нижн мешалки
             // остался сработанным
             case BAD:{ 
                         Bell(1); Message (240); Clear_TO(199); break;;  
                      }
             // за заданное время сигнал нижнего уровня нижн мешалки пропал
             case END:{ 
                         if(CTRL_LLM1V==OFF){
                            TIME_PALNCMin++; TIME_PALNC=TIME_PALNCMin/MIN;
                         } else {
                            Clear_TO(199);
                         }; break;;
                      }
         } 
         //-------------------------------------------------------------------

         //-------------------------------------------------------------------
         // счетчик ожидания включения сигнала верх уровня нижн мешалки ал.пас:
         switch ( Check_TO(198, TIME_PANNW*MIN, DIH300___V,'=',ON, TIME_LSTBV )){
             case RUN:{ TIME_PANNCMin++; TIME_PANNC=TIME_PANNCMin/MIN; return; }
             // если за заданное время сигнал верх уровня нижн мешалки ал.пасты
             // остался сработанным- выключить регулятор
             case BAD:{ 
                         Bell(1); Message(235); Message(680); Clear_TO(241); 
                         REG10R___M=OFF; break;;  
                      }
             // за заданное время сигнал нижнего уровня емк вода-ПАВ пропал
             case END:{ 
                         if(CTRL_HLM1V==OFF){
                            TIME_PANNCMin++; TIME_PANNC=TIME_PANNCMin/MIN;
                         }; break;;
                      }
         };  Clear_TO(198);
         //-------------------------------------------------------------------
         // закрыть клапан набора ПАВ
         // вода           ПАВ паста         насос             пар              
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;
         STEP10 = 6;
         return;
    }
    //------------------------------------------------------------------------



    // ЗАПРОС ОПЕРАТОРУ: начать перемешивание ПАВ?
    //------------------------------------------------------------------------
    if ( STEP10 == 6 ){
         if(STEP10P!=6){
           ;;
         }; STEP10P =6;
         if(RegRUN==OFF){ return; }
         REG10SW__V=60;
         // вода           ПАВ паста         насос             пар
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;
         //
         if(REG10ZO3_W==END){ REG10ZO3_W=OFF; Clear_TO(191); }
         switch(Check_TO(191,1*MIN, REG10ZO3_W,'=',YES, 1)){
            case RUN:{ return;; }
            case BAD:{ 
                       Bell(1); Message(242); Clear_TO(191); REG10ZO3_W=REQ;
                       return;
                     }
         }; Clear_TO(191);
         REG10SW__V=61;
         REG10ZO3_W=OFF;
         STEP10 = 7;
         return;
    }
    //------------------------------------------------------------------------



    // ПЕРЕМЕШИВАНИЕ ПАВ
    //------------------------------------------------------------------------
    if ( STEP10 == 7 ){
         if(STEP10P!=7){
            TIME_PPM1C=0;
            TIME_PPM1CMin=0;
            Clear_TO(191);
            Clear_TO(192);
         }; STEP10P =7;
         if(RegRUN==OFF){ return; }
         REG10SW__V=70;
         // вода           ПАВ паста         насос             пар
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;
         // если мешалка остановилась- обнулить время перемешивания
         switch ( Check_TO(191, 30*SEC, DIS300___V,'=',OFF, 1)){
             case RUN:{ break; }
             case END:{ TIME_PPM1C=0; TIME_PPM1CMin=0; Clear_TO(191); break; }
         }
         // считать время перемешивания ПАВ
         switch ( Check_TO(192, TIME_PPM1V*MIN, ZERO,'=',ON, 1)){
             case RUN:{ TIME_PPM1CMin++; TIME_PPM1C=TIME_PPM1CMin/MIN; return; }
             case BAD:{ break;; }
         }
         // если включен контроль нижнего уровня верхн мешалки ал.пасты
         // и нет сигнала нижнего уровня  верх.мешалки ал.пасты- ждать
         // (в мешалке что-то есть, качать не надо)
         REG10SW__V=71;
         if(CTRL_LLM2V==ON and DIL280___V==OFF){ return; }
         // если включен контроль верхнего уровня верхн мешалки ал.пасты
         // и есть сигнал верхнего уровня  верх.мешалки ал.пасты- ждать
         // (в полную мешалку качать не надо)
         REG10SW__V=72;
         if(CTRL_HLM2V==ON and DIH280___V==ON){ return; }
         // если включен контроль нижнего уровня нижней мешалки ал.пасты
         // и есть сигнал нижнего уровня- ждать
         // (из пустой мешалки качать нечего)
         REG10SW__V=73;
         if(CTRL_LLM1V==ON and DIL300___V==ON){ return; }
         // если не работает привод нижней мешалки ал.пасты- ждать
         REG10SW__V=74;
         if(DIS300___V==OFF){ return; }
         // если не работает привод верхней мешалки ал.пасты- ждать
         REG10SW__V=75;
         if(DIS280___V==OFF){ return; }
         // если нижняя мешалка ал.пасты на РУЧНОМ режиме- ждать
         REG10SW__V=76;
         if(DIR300___V==OFF){ return; }
         // если с верхней мешалки ал.пасты идет загузка пасты 
         // в промежуточную емкость- ждать
         REG10SW__V=77;
         if(DIS281___V==ON ){ return; }
         // если верхняя мешалка на ручном управлении- ждать (сделать запрос)
         REG10SW__V=78;
         if(DIR280___V==OFF){ return; }
         // по окончании перемешивания перейти на следующий шаг
         REG10SW__V=79;
         STEP10 = 8;
         return;
    }
    //------------------------------------------------------------------------



    // ЗАПРОС ОПЕРАТОРУ: Мешалка ПАВ верхняя: РУЧНОЕ УПРАВЛЕНИЕ. ПРОДОЛЖИТЬ?
    //------------------------------------------------------------------------
    if ( STEP10 == 8 ){
         if(STEP10P!=8){
           ;;
         }; STEP10P =8;
         if(RegRUN==OFF){ return; }
         REG10SW__V=80;
         // вода           ПАВ паста         насос             пар
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;
         // если верхняя мешалка ал.пасты на автоматич. управлении-
         // перейти на следующий шаг
         if(DIR280___V==AUTO){ STEP10=9; REG10ZO4_W=OFF; return; }
         // ожидать ответ от оператора
         REG10SW__V=81;
         if(REG10ZO4_W==END){ REG10ZO4_W=OFF; Clear_TO(191); }
         switch(Check_TO(191,1*MIN, REG10ZO4_W,'=',YES, 1)){
            case RUN:{ return;; }
            case BAD:{ 
                       Bell(1); Message(150); Clear_TO(191); REG10ZO3_W=REQ;
                       return;
                     }
         }; Clear_TO(191);
         REG10SW__V=82;
         REG10ZO4_W=OFF;
         STEP10 = 9;
         return;
    }
    //------------------------------------------------------------------------



    // ПЕРЕКАЧКА АЛ.ПАСТЫ в верхнюю мешалку ал.пасты
    //------------------------------------------------------------------------
    if ( STEP10 == 9 ){
         if(STEP10P!=9){
            Clear_TO(191);
            Clear_TO(192);
            Clear_TO(193);
            Clear_TO(194);
            Clear_TO(195);
            Clear_TO(198);
            Clear_TO(199);
            TIME_PALVC=0;
            TIME_PALVCMin=0;
            TIME_PANVC=0;
            TIME_PANVCMin=0;
         }; STEP10P=9;
         if(RegRUN==OFF){ return; }
         REG10SW__V=90;
         // Включить насос нижней мешалки ал.пасты
         // вода           ПАВ паста         насос             пар            
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=ON;;   DIS275___S=OFF;

         //-------------------------------------------------------------------
         // если во время перекачки ПАВ в верх мешалку ал.суспензии, 
         // выключился привод мешалки- выкл регулятор
         switch ( Check_TO(191, 5*SEC, DIS280___V,'=',ON, 2)){
             case RUN:{ break;; }
             case END:{ Clear_TO(191); break;; }
             case BAD:{ 
                        Bell(1); Message(492); Message(680); Regul_10off(); 
                        REG10R___M=OFF; Clear_TO(191); return; 
                      }
         }
         //-------------------------------------------------------------------
         // если во время перекачки ПАВ в верх мешалку ал.суспензии, 
         // ключ нижн мешалки перевели в состоян. "Ручное"- выкл регулятор
         switch ( Check_TO(192, 5*SEC, DIR300___V,'=',ON, 2)){
             case RUN:{ break;; }
             case END:{ Clear_TO(192); break;; }
             case BAD:{ 
                        Bell(1); Message(493); Message(680); Regul_10off(); 
                        REG10R___M=OFF; Clear_TO(192); return; 
                      }
         }
         //-------------------------------------------------------------------
         // если во время перекачки ПАВ в верх мешалку ал.суспензии, 
         // включился сигнал нижнего уровня нижней мешалки ал.пасты или 
         // выключили контроль этого уровня-перейти на ожидание выключ. насоса
         if(CTRL_LLM2V==OFF){ Message(494); STEP10=10; return; }
         switch ( Check_TO(193, 5*SEC, DIL300___V,'=',OFF, 2)){
             case RUN:{ break;; }
             case END:{ Clear_TO(193); break;; }
             case BAD:{ Message (495); Clear_TO(193); STEP10=10; return; }
         }
         //-------------------------------------------------------------------
         // если ключ регулятра дозировки в положении AUTO и включился клапан
         // закачки ал.пасты в промежуточную емкость- приостановить перекачку,
         // перейти на шаг ожидания закрытия клапана
         if(DIR280___V==OFF){
            switch ( Check_TO(194, 5*SEC, DIS281___V,'=',ON, 1)){
                case RUN:{ break;; }
                case END:{ Clear_TO(194); break;; }
                case BAD:{ Message (496); Clear_TO(194); STEP10=12; return; }
            }
         }
         //-------------------------------------------------------------------

         //-------------------------------------------------------------------
         // счетчик ожидания выключения сигнала нижнего уровня верх мешалки:
         switch ( Check_TO(199, TIME_PALVW*MIN, DIL280___V,'=',OFF, TIME_LSTBV )){
             case RUN:{ TIME_PALVCMin++; TIME_PALVC=TIME_PALVCMin/MIN; break;; }
             // если за заданное время сигнал нижнего уровня верх мешалки
             // остался сработанным
             case BAD:{ 
                         Bell(1); Message (294); Clear_TO(199); break;;  
                      }
             // за заданное время сигнал нижнего уровня нижн мешалки пропал
             case END:{ 
                         if(CTRL_LLM2V==OFF){
                            TIME_PALVCMin++; TIME_PALVC=TIME_PALNCMin/MIN;
                         } else {
                            Clear_TO(199);
                         }; break;;
                      }
         } 
         //-------------------------------------------------------------------

         //-------------------------------------------------------------------
         // счетчик ожидания включения сигнала верх уровня верх мешалки ал.пас:
         switch ( Check_TO(198, TIME_PANVW*MIN, DIH280___V,'=',ON, TIME_LSTBV )){
             case RUN:{ TIME_PANVCMin++; TIME_PANVC=TIME_PANVCMin/MIN; return; }
             // если за заданное время сигнал верх уровня верх мешалки пасты
             // остался сработанным- выключить регулятор
             case BAD:{ 
                         Bell(1); Message(293); Message(680); Clear_TO(241); 
                         REG10R___M=OFF; break;;  
                      }
             // за заданное время сигнал нижнего уровня емк вода-ПАВ пропал
             case END:{ 
                         if(CTRL_HLM2V==OFF){
                            TIME_PANVCMin++; TIME_PANVC=TIME_PANVCMin/MIN;
                         }; break;;
                      }
         };  Clear_TO(198);
         //-------------------------------------------------------------------
         // Если закончилось допустимое время перекачки или сработал верхний
         // уровень верхней мешалки ал.пасты- перейти на шаг выключения насоса
         STEP10 = 11;
         return;
    }
    //------------------------------------------------------------------------



    // ТАЙМЕР выключения насоса ниж мешалки ал.пасты при перекачки ал.пасты
    //------------------------------------------------------------------------
    if ( STEP10 == 10 ){
         if(STEP10P!=10){
            Clear_TO(191);
            TIME_PNOFC=0;
            TIME_PNOFCMin=0;
         }; STEP10P=10;
         if(RegRUN==OFF){ return; }
         REG10SW__V=100;
         //-------------------------------------------------------------------
         // счетчик ожидания выключения насоса нижн мешалки ал.пасты:
         switch ( Check_TO(191, TIME_PNOFV*MIN, ZERO,'=',ON, TIME_LSTBV )){
             case RUN:{ TIME_PNOFCMin++; TIME_PNOFC=TIME_PNOFCMin/MIN; return; }
             case BAD:{ Clear_TO(191); break;; }
         } 
         //-------------------------------------------------------------------
         STEP10 = 11;
         return;
    }
    //------------------------------------------------------------------------



    // ВЫКЛЮЧЕНИЕ НАСОСА перекачки ал.пасты из нижней мешалки ал.пасты
    //------------------------------------------------------------------------
    if ( STEP10 == 11 ){
         if(STEP10P!=11){
            ;;
         }; STEP10P=11;
         if(RegRUN==OFF){ return; }
         REG10SW__V=110;
         // Выключить насос нижней мешалки ал.пасты
         // вода           ПАВ паста         насос             пар            
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;
         // Подкачка ал.пасты закончена- выключить регулятор
         REG10R___M=OFF;
         return;
    }
    //------------------------------------------------------------------------



    // ОЖИДАНИЕ окончания загрузки миксера ал.пасты при перекачке
    //------------------------------------------------------------------------
    if ( STEP10 == 12 ){
         if(RegRUN==OFF){ return; }
         REG10SW__V=120;
         //-------------------------------------------------------------------
         // Выключить насос нижней мешалки ал.пасты
         // вода           ПАВ паста         насос             пар            
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;
         //-------------------------------------------------------------------
         // счетчик ожидания закрытия клапана загрузки миксера ал.пасты
         switch ( Check_TO(195, 5*SEC, DIS281___V,'=',OFF, 2 )){
             case RUN:{ return; }
             case BAD:{ Clear_TO(195); return; }
         };  Clear_TO(195);
         //-------------------------------------------------------------------
         // если клапан закрылся- вернуться на шаг перекачки (возобновить)
         STEP10=9;
         return;
    }
    //------------------------------------------------------------------------



    // ПАУЗА работы регулятора
    //------------------------------------------------------------------------
    if ( STEP10 == 15 ){
         if(STEP10P!=15){
            STEP10X =STEP10P;
         }; STEP10P =15;
         if(RegRUN==OFF){ return; }
         REG10SW__V=150;
         //-------------------------------------------------------------------
         // Выключить насос нижней мешалки ал.пасты
         // вода           ПАВ паста         насос             пар            
         DON272___V=OFF;   DON274___V=OFF;   DON301___V=OFF;   DIS275___S=OFF;
         return;
    }
    //------------------------------------------------------------------------



    //------------------------------------------------------------------------
    // ПЕРЕДЕРГИВАНИЕ КЛАПАНОВ
    //------------------------------------------------------------------------
    if ( STEP10 ==70 ){
        if(STEP10P!=70){
           ;;
        }; STEP10P =70;
        if(DONCN10>=DONCH10){ STEP10 = STEP10_PRBK; return; }
        REG10SW__V = 700;
        if(RegRUN==OFF){ return; }
        if(Check_TO(210, DONTM10*SEC, ZERO,'=',ON, 1 )==RUN){ return; }
           Clear_TO(210);
       *DONPR10=(*DONPR10!=ON)?ON:OFF;
        DONCN10++;
        STEP10 = STEP10_PRBK;
        return;
    }
    //------------------------------------------------------------------------

    //------------------------------------------------------------------------
    // если задан несуществующий шаг регулятора - регулятор в ручной режим
    Regul_10m();
    return;
}
//----------------------------------------------------------------------------
