//---------------------------------------------------------------------------
//  coding=cp866; version=2013013112; title="";
#include "..\_libpath.inc"
#include "..\prg\run_prgv.h"

#include "other_e.h"

_i far DIR211S=0, DIR213S=0;

//---------------------------------------------------------------------------
//  Выключение исполнителей при переходе с режима РУЧНОЕ<>АВТОМАТ
vd  far AutoManM(vd){

    // Если состояние ключа изменилось- дать комманду на закрытие всех
    // исполнителей, связанных с этим ключом
    // И если объект, управляемый переводимым ключом, является основным
    // в работе регулятора- дать комманду на выключение регулятора

    // ШБ N1,2
    if(DIR211___V != DIR211S){
       REG01R___M  = OFF;
       DON211KA_V  = OFF; DON211KB_V = OFF; DON211NV_V = OFF;
       if(DIR211___V==OFF){ Message(122,NOKV); }
       else               { Message(123,NOKV); }
    }; DIR211S=DIR211___V;
  
    // ШБ N3,4
    if(DIR213___V != DIR213S){
       REG01R___M  = OFF;
       DON213A__V  = OFF; DON213B__V = OFF; DON213V__V = OFF;
       if(DIR213___V==OFF){ Message(124,NOKV); }
       else               { Message(125,NOKV); }
    }; DIR213S=DIR213___V;

    return;
}
//---------------------------------------------------------------------------
