//---------------------------------------------------------------------------
// состояние ключей режимов
ex _i far DIR010S, DIR020S, DIR031S, DIR041S, DIR051S, DIR061S;
ex _i far DIR070S, DIR100S, DIR110S, DIR120S, DIR130S, DIR140S;
ex _i far DIR160S, DIR170S, DIR190S, DIR200S, DIR210S, DIR220S;
ex _i far DIR230S, DIR240S, DIR260S, DIR270S, DIR280S, DIR290S;
ex _i far DIR300S, DIR310S, DIR131S, DIR161S;

//---------------------------------------------------------------------------
// шаги регуляторов
ex _i far STEP01;
ex _i far STEP01_BACK;
ex _i far STEP02;
ex _i far STEP03;
ex _i far STEP04;
ex _i far STEP05;
ex _i far STEP06;
ex _i far STEP07;
ex _i far STEP08;
ex _i far STEP09;
ex _i far STEP10;

//---------------------------------------------------------------------------
//  флаги сработки исполнителей
ex _f far DIS213W;

//---------------------------------------------------------------------------
// пустая переменная для временных циклов
ex _f far ZERO;

//---------------------------------------------------------------------------
