//---------------------------------------------------------------------------
// pH в котле 1 сатурации

//---------------------------------------------------------------------------
vd  far Reg_03(vd){
    //-----------------------------------------------------------------------
    ui RN=3;                               // Номер регулятора                
    _f IL=7.5;                             // Входная шкала (нижняя граница)  
    _f IH=12.5;                            // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOH1ST__RM!=AOH1ST__RV){ 
        AOH1ST__RV =AOH1ST__RM; 
        if(AOH1ST__RV>0){ Message(104); }
        else            { Message(105); AOH1ST__OM=AOH1ST__OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOH1ST__ZM <  IL         ){ AOH1ST__ZM = IL; }
    if (AOH1ST__ZM >  AIH1ST_AMV ){ AOH1ST__ZM = AIH1ST_AMV; }
        AOH1ST__ZV =  AOH1ST__ZM;
    // выход на клапан ручного управления
    if (AOH1ST__OM < 0  ){ AOH1ST__OM =0;   }
    if (AOH1ST__OM > 100){ AOH1ST__OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOH1ST_LOV =AOH1ST_LOM;
    AOH1ST_HOV =AOH1ST_HOM;
    // ограничение выхода на приборы снизу и сверху
    AOH1ST_LPV =AOH1ST_LPM;
    AOH1ST_HPV =AOH1ST_HPM;
    // коэффициенты регулятора
    AOH1ST__PV =AOH1ST__PM;
    AOH1ST__IV =AOH1ST__IM;
    AOH1ST__DV =AOH1ST__DM;
    AOH1ST__MV =AOH1ST__MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOH1ST__OV=Regulator(RN, AIH1ST___V,
                              AOH1ST__PV, AOH1ST__IV, AOH1ST__DV, AOH1ST__MV,
                              AOH1ST__OM, AOH1ST__RV,
                              AOH1ST__ZV, AOH1ST__ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOH1ST__OV <  OL+AOH1ST_LOV){ AOH1ST__OV=OL+AOH1ST_LOV; }
       if (AOH1ST__OV >  OH-AOH1ST_HOV){ AOH1ST__OV=OH-AOH1ST_HOV; }
       if (AOH1ST__MV >= 0){ AOH1ST_OOV=100-AOH1ST__OV; }
       else                { AOH1ST_OOV=AOH1ST__OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
