//---------------------------------------------------------------------------
// Т подогревателей 2 группы

//---------------------------------------------------------------------------
vd  far Reg_06(vd){
    //-----------------------------------------------------------------------
    ui RN=6;                               // Номер регулятора                
    _f IL=0;                               // Входная шкала (нижняя граница)  
    _f IH=100;                             // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOTNS12_RM!=AOTNS12_RV){ 
        AOTNS12_RV =AOTNS12_RM; 
        if(AOTNS12_RV>0){ Message(110); }
        else            { Message(111); AOTNS12_OM=AOTNS12_OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOTNS12_ZM <  IL         ){ AOTNS12_ZM = IL; }
    if (AOTNS12_ZM >  AIT2GR_AMV ){ AOTNS12_ZM = AIT2GR_AMV; }
        AOTNS12_ZV =  AOTNS12_ZM;
    // выход на клапан ручного управления
    if (AOTNS12_OM < 0  ){ AOTNS12_OM =0;   }
    if (AOTNS12_OM > 100){ AOTNS12_OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOTNS12LOV =AOTNS12LOM;
    AOTNS12HOV =AOTNS12HOM;
    // ограничение выхода на приборы снизу и сверху
    AOTNS12LPV =AOTNS12LPM;
    AOTNS12HPV =AOTNS12HPM;
    // коэффициенты регулятора
    AOTNS12_PV =AOTNS12_PM;
    AOTNS12_IV =AOTNS12_IM;
    AOTNS12_DV =AOTNS12_DM;
    AOTNS12_MV =AOTNS12_MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOTNS12_OV=Regulator(RN, AIT2GR___V,
                              AOTNS12_PV, AOTNS12_IV, AOTNS12_DV, AOTNS12_MV,
                              AOTNS12_OM, AOTNS12_RV,
                              AOTNS12_ZV, AOTNS12_ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOTNS12_OV <  OL+AOTNS12LOV){ AOTNS12_OV=OL+AOTNS12LOV; }
       if (AOTNS12_OV >  OH-AOTNS12HOV){ AOTNS12_OV=OH-AOTNS12HOV; }
       if (AOTNS12_MV >= 0){ AOTNS12OOV=100-AOTNS12_OV; }
       else                { AOTNS12OOV=AOTNS12_OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
