//---------------------------------------------------------------------------
// Т нефильтрованного сока 1 сатурации

//---------------------------------------------------------------------------
vd  far Reg_07(vd){
    //-----------------------------------------------------------------------
    ui RN=7;                               // Номер регулятора                
    _f IL=0;                               // Входная шкала (нижняя граница)  
    _f IH=100;                             // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOTNS13_RM!=AOTNS13_RV){ 
        AOTNS13_RV =AOTNS13_RM; 
        if(AOTNS13_RV>0){ Message(112); }
        else            { Message(113); AOTNS13_OM=AOTNS13_OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOTNS13_ZM <  IL         ){ AOTNS13_ZM = IL; }
    if (AOTNS13_ZM >  AITNS1_AMV ){ AOTNS13_ZM = AITNS1_AMV; }
        AOTNS13_ZV =  AOTNS13_ZM;
    // выход на клапан ручного управления
    if (AOTNS13_OM < 0  ){ AOTNS13_OM =0;   }
    if (AOTNS13_OM > 100){ AOTNS13_OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOTNS13LOV =AOTNS13LOM;
    AOTNS13HOV =AOTNS13HOM;
    // ограничение выхода на приборы снизу и сверху
    AOTNS13LPV =AOTNS13LPM;
    AOTNS13HPV =AOTNS13HPM;
    // коэффициенты регулятора
    AOTNS13_PV =AOTNS13_PM;
    AOTNS13_IV =AOTNS13_IM;
    AOTNS13_DV =AOTNS13_DM;
    AOTNS13_MV =AOTNS13_MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOTNS13_OV=Regulator(RN, AITNS1___V,
                              AOTNS13_PV, AOTNS13_IV, AOTNS13_DV, AOTNS13_MV,
                              AOTNS13_OM, AOTNS13_RV,
                              AOTNS13_ZV, AOTNS13_ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOTNS13_OV <  OL+AOTNS13LOV){ AOTNS13_OV=OL+AOTNS13LOV; }
       if (AOTNS13_OV >  OH-AOTNS13HOV){ AOTNS13_OV=OH-AOTNS13HOV; }
       if (AOTNS13_MV >= 0){ AOTNS13OOV=100-AOTNS13_OV; }
       else                { AOTNS13OOV=AOTNS13_OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
