//---------------------------------------------------------------------------
// pH в 6 секции преддефекатора Бригель-Мюллера

//---------------------------------------------------------------------------
vd  far Reg_01(vd){
    //-----------------------------------------------------------------------
    ui RN=1;                               // Номер регулятора                
    _f IL=7.5;                             // Входная шкала (нижняя граница)  
    _f IH=12.5;                            // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOHBM6__RM!=AOHBM6__RV){ 
        AOHBM6__RV =AOHBM6__RM; 
        if(AOHBM6__RV>0){ Message(100); }
        else            { Message(101); AOHBM6__OM=AOHBM6__OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOHBM6__ZM <  IL         ){ AOHBM6__ZM = IL; }
    if (AOHBM6__ZM >  AIHBM6_AMV ){ AOHBM6__ZM = AIHBM3_AMV; }
        AOHBM6__ZV =  AOHBM6__ZM;
    // выход на клапан ручного управления
    if (AOHBM6__OM < 0  ){ AOHBM6__OM =0;   }
    if (AOHBM6__OM > 100){ AOHBM6__OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOHBM6_LOV =AOHBM6_LOM;
    AOHBM6_HOV =AOHBM6_HOM;
    // ограничение выхода на приборы снизу и сверху
    AOHBM6_LPV =AOHBM6_LPM;
    AOHBM6_HPV =AOHBM6_HPM;
    // коэффициенты регулятора
    AOHBM6__PV =AOHBM6__PM;
    AOHBM6__IV =AOHBM6__IM;
    AOHBM6__DV =AOHBM6__DM;
    AOHBM6__MV =AOHBM6__MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOHBM6__OV=Regulator(RN, AIHBM6___V,
                              AOHBM6__PV, AOHBM6__IV, AOHBM6__DV, AOHBM6__MV,
                              AOHBM6__OM, AOHBM6__RV,
                              AOHBM6__ZV, AOHBM6__ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOHBM6__OV <  OL+AOHBM6_LOV){ AOHBM6__OV=OL+AOHBM6_LOV; }
       if (AOHBM6__OV >  OH-AOHBM6_HOV){ AOHBM6__OV=OH-AOHBM6_HOV; }
       if (AOHBM6__MV >= 0){ AOHBM6_OOV=100-AOHBM6__OV; }
       else                { AOHBM6_OOV=AOHBM6__OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
