//---------------------------------------------------------------------------
// Т фильтрованного сока 1 сатурации

//---------------------------------------------------------------------------
vd  far Reg_08(vd){
    //-----------------------------------------------------------------------
    ui RN=8;                               // Номер регулятора                
    _f IL=0;                               // Входная шкала (нижняя граница)  
    _f IH=100;                             // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOTFS1S_RM!=AOTFS1S_RV){ 
        AOTFS1S_RV =AOTFS1S_RM; 
        if(AOTFS1S_RV>0){ Message(114); }
        else            { Message(115); AOTFS1S_OM=AOTFS1S_OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOTFS1S_ZM <  IL         ){ AOTFS1S_ZM = IL; }
    if (AOTFS1S_ZM >  AITF1P_AMV ){ AOTFS1S_ZM = AITF1P_AMV; }
        AOTFS1S_ZV =  AOTFS1S_ZM;
    // выход на клапан ручного управления
    if (AOTFS1S_OM < 0  ){ AOTFS1S_OM =0;   }
    if (AOTFS1S_OM > 100){ AOTFS1S_OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOTFS1SLOV =AOTFS1SLOM;
    AOTFS1SHOV =AOTFS1SHOM;
    // ограничение выхода на приборы снизу и сверху
    AOTFS1SLPV =AOTFS1SLPM;
    AOTFS1SHPV =AOTFS1SHPM;
    // коэффициенты регулятора
    AOTFS1S_PV =AOTFS1S_PM;
    AOTFS1S_IV =AOTFS1S_IM;
    AOTFS1S_DV =AOTFS1S_DM;
    AOTFS1S_MV =AOTFS1S_MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOTFS1S_OV=Regulator(RN, AITF1P___V,
                              AOTFS1S_PV, AOTFS1S_IV, AOTFS1S_DV, AOTFS1S_MV,
                              AOTFS1S_OM, AOTFS1S_RV,
                              AOTFS1S_ZV, AOTFS1S_ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOTFS1S_OV <  OL+AOTFS1SLOV){ AOTFS1S_OV=OL+AOTFS1SLOV; }
       if (AOTFS1S_OV >  OH-AOTFS1SHOV){ AOTFS1S_OV=OH-AOTFS1SHOV; }
       if (AOTFS1S_MV >= 0){ AOTFS1SOOV=100-AOTFS1S_OV; }
       else                { AOTFS1SOOV=AOTFS1S_OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
