//---------------------------------------------------------------------------
// Расход диффузионного сока

//---------------------------------------------------------------------------
vd  far Reg_02(vd){
    //-----------------------------------------------------------------------
    ui RN=2;                               // Номер регулятора                
    _f IL=0;                               // Входная шкала (нижняя граница)  
    _f IH=160;                             // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOFDFS__RM!=AOFDFS__RV){ 
        AOFDFS__RV =AOFDFS__RM; 
        if(AOFDFS__RV>0){ Message(102); }
        else            { Message(103); AOFDFS__OM=AOFDFS__OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOFDFS__ZM <  IL ){ AOFDFS__ZM = IL; }
    if (AOFDFS__ZM >  AIFDFS_AMV ){ AOFDFS__ZM = AIFDFS_AMV; }
//  if (AOFDFS__ZM >  IH ){ AOFDFS__ZM = IH; }
        AOFDFS__ZV =  AOFDFS__ZM;
    // выход на клапан ручного управления
    if (AOFDFS__OM < 0  ){ AOFDFS__OM =0;   }
    if (AOFDFS__OM > 100){ AOFDFS__OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOFDFS_LOV =AOFDFS_LOM;
    AOFDFS_HOV =AOFDFS_HOM;
    // ограничение выхода на приборы снизу и сверху
    AOFDFS_LPV =AOFDFS_LPM;
    AOFDFS_HPV =AOFDFS_HPM;
    // коэффициенты регулятора
    AOFDFS__PV =AOFDFS__PM;
    AOFDFS__IV =AOFDFS__IM;
    AOFDFS__DV =AOFDFS__DM;
    AOFDFS__MV =AOFDFS__MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOFDFS__OV=Regulator(RN, AIFDFS___V,
                              AOFDFS__PV, AOFDFS__IV, AOFDFS__DV, AOFDFS__MV,
                              AOFDFS__OM, AOFDFS__RV,
                              AOFDFS__ZV, AOFDFS__ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOFDFS__OV <  OL+AOFDFS_LOV){ AOFDFS__OV=OL+AOFDFS_LOV; }
       if (AOFDFS__OV >  OH-AOFDFS_HOV){ AOFDFS__OV=OH-AOFDFS_HOV; }
       if (AOFDFS__MV >= 0){ AOFDFS_OOV=100-AOFDFS__OV; }
       else                { AOFDFS_OOV=AOFDFS__OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
