//---------------------------------------------------------------------------
// pH в котле 2 сатурации

//---------------------------------------------------------------------------
vd  far Reg_04(vd){
    //-----------------------------------------------------------------------
    ui RN=4;                               // Номер регулятора                
    _f IL=8;                               // Входная шкала (нижняя граница)  
    _f IH=13;                              // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOH2ST__RM!=AOH2ST__RV){ 
        AOH2ST__RV =AOH2ST__RM; 
        if(AOH2ST__RV>0){ Message(106); }
        else            { Message(107); AOH2ST__OM=AOH2ST__OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOH2ST__ZM <  IL         ){ AOH2ST__ZM = IL; }
    if (AOH2ST__ZM >  AIH2ST_AMV ){ AOH2ST__ZM = AIH2ST_AMV; }
        AOH2ST__ZV =  AOH2ST__ZM;
    // выход на клапан ручного управления
    if (AOH2ST__OM < 0  ){ AOH2ST__OM =0;   }
    if (AOH2ST__OM > 100){ AOH2ST__OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOH2ST_LOV =AOH2ST_LOM;
    AOH2ST_HOV =AOH2ST_HOM;
    // ограничение выхода на приборы снизу и сверху
    AOH2ST_LPV =AOH2ST_LPM;
    AOH2ST_HPV =AOH2ST_HPM;
    // коэффициенты регулятора
    AOH2ST__PV =AOH2ST__PM;
    AOH2ST__IV =AOH2ST__IM;
    AOH2ST__DV =AOH2ST__DM;
    AOH2ST__MV =AOH2ST__MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOH2ST__OV=Regulator(RN, AIH2ST___V,
                              AOH2ST__PV, AOH2ST__IV, AOH2ST__DV, AOH2ST__MV,
                              AOH2ST__OM, AOH2ST__RV,
                              AOH2ST__ZV, AOH2ST__ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOH2ST__OV <  OL+AOH2ST_LOV){ AOH2ST__OV=OL+AOH2ST_LOV; }
       if (AOH2ST__OV >  OH-AOH2ST_HOV){ AOH2ST__OV=OH-AOH2ST_HOV; }
       if (AOH2ST__MV >= 0){ AOH2ST_OOV=100-AOH2ST__OV; }
       else                { AOH2ST_OOV=AOH2ST__OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
