//---------------------------------------------------------------------------
// Т подогревателей 1 группы

//---------------------------------------------------------------------------
vd  far Reg_05(vd){
    //-----------------------------------------------------------------------
    ui RN=5;                               // Номер регулятора                
    _f IL=0;                               // Входная шкала (нижняя граница)  
    _f IH=100;                             // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOTNS11_RM!=AOTNS11_RV){ 
        AOTNS11_RV =AOTNS11_RM; 
        if(AOTNS11_RV>0){ Message(108); }
        else            { Message(109); AOTNS11_OM=AOTNS11_OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOTNS11_ZM <  IL         ){ AOTNS11_ZM = IL; }
    if (AOTNS11_ZM >  AIT1GR_AMV ){ AOTNS11_ZM = AIT1GR_AMV; }
        AOTNS11_ZV =  AOTNS11_ZM;
    // выход на клапан ручного управления
    if (AOTNS11_OM < 0  ){ AOTNS11_OM =0;   }
    if (AOTNS11_OM > 100){ AOTNS11_OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOTNS11LOV =AOTNS11LOM;
    AOTNS11HOV =AOTNS11HOM;
    // ограничение выхода на приборы снизу и сверху
    AOTNS11LPV =AOTNS11LPM;
    AOTNS11HPV =AOTNS11HPM;
    // коэффициенты регулятора
    AOTNS11_PV =AOTNS11_PM;
    AOTNS11_IV =AOTNS11_IM;
    AOTNS11_DV =AOTNS11_DM;
    AOTNS11_MV =AOTNS11_MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOTNS11_OV=Regulator(RN, AIT1GR___V,
                              AOTNS11_PV, AOTNS11_IV, AOTNS11_DV, AOTNS11_MV,
                              AOTNS11_OM, AOTNS11_RV,
                              AOTNS11_ZV, AOTNS11_ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOTNS11_OV <  OL+AOTNS11LOV){ AOTNS11_OV=OL+AOTNS11LOV; }
       if (AOTNS11_OV >  OH-AOTNS11HOV){ AOTNS11_OV=OH-AOTNS11HOV; }
       if (AOTNS11_MV >= 0){ AOTNS11OOV=100-AOTNS11_OV; }
       else                { AOTNS11OOV=AOTNS11_OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
