//---------------------------------------------------------------------------
// Т сока перед выпаркою (3 секция)

//---------------------------------------------------------------------------
vd  far Reg_09(vd){
    //-----------------------------------------------------------------------
    ui RN=9;                               // Номер регулятора                
    _f IL=0;                               // Входная шкала (нижняя граница)  
    _f IH=130;                             // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOTDVP__RM!=AOTDVP__RV){ 
        AOTDVP__RV =AOTDVP__RM; 
        if(AOTDVP__RV>0){ Message(116); }
        else            { Message(117); AOTDVP__OM=AOTDVP__OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOTDVP__ZM <  IL         ){ AOTDVP__ZM = IL; }
    if (AOTDVP__ZM >  AITDVP_AMV ){ AOTDVP__ZM = AITDVP_AMV; }
        AOTDVP__ZV =  AOTDVP__ZM;
    // выход на клапан ручного управления
    if (AOTDVP__OM < 0  ){ AOTDVP__OM =0;   }
    if (AOTDVP__OM > 100){ AOTDVP__OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOTDVP_LOV =AOTDVP_LOM;
    AOTDVP_HOV =AOTDVP_HOM;
    // ограничение выхода на приборы снизу и сверху
    AOTDVP_LPV =AOTDVP_LPM;
    AOTDVP_HPV =AOTDVP_HPM;
    // коэффициенты регулятора
    AOTDVP__PV =AOTDVP__PM;
    AOTDVP__IV =AOTDVP__IM;
    AOTDVP__DV =AOTDVP__DM;
    AOTDVP__MV =AOTDVP__MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOTDVP__OV=Regulator(RN, AITDVP___V,
                              AOTDVP__PV, AOTDVP__IV, AOTDVP__DV, AOTDVP__MV,
                              AOTDVP__OM, AOTDVP__RV,
                              AOTDVP__ZV, AOTDVP__ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOTDVP__OV <  OL+AOTDVP_LOV){ AOTDVP__OV=OL+AOTDVP_LOV; }
       if (AOTDVP__OV >  OH-AOTDVP_HOV){ AOTDVP__OV=OH-AOTDVP_HOV; }
       if (AOTDVP__MV >= 0){ AOTDVP_OOV=100-AOTDVP__OV; }
       else                { AOTDVP_OOV=AOTDVP__OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
