//---------------------------------------------------------------------------
// Давление сатурационного газа

//---------------------------------------------------------------------------
vd  far Reg_10(vd){
    //-----------------------------------------------------------------------
    ui RN=10;                              // Номер регулятора                
    _f IL=0;                               // Входная шкала (нижняя граница)  
    _f IH=1;                               // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOPGOK__RM!=AOPGOK__RV){ 
        AOPGOK__RV =AOPGOK__RM; 
        if(AOPGOK__RV>0){ Message(118); }
        else            { Message(119); AOPGOK__OM=AOPGOK__OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOPGOK__ZM <  IL         ){ AOPGOK__ZM = IL; }
    if (AOPGOK__ZM >  AIPGOK_AMV ){ AOPGOK__ZM = AIPGOK_AMV; }
        AOPGOK__ZV =  AOPGOK__ZM;
    // выход на клапан ручного управления
    if (AOPGOK__OM < 0  ){ AOPGOK__OM =0;   }
    if (AOPGOK__OM > 100){ AOPGOK__OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOPGOK_LOV =AOPGOK_LOM;
    AOPGOK_HOV =AOPGOK_HOM;
    // ограничение выхода на приборы снизу и сверху
    AOPGOK_LPV =AOPGOK_LPM;
    AOPGOK_HPV =AOPGOK_HPM;
    // коэффициенты регулятора
    AOPGOK__PV =AOPGOK__PM;
    AOPGOK__IV =AOPGOK__IM;
    AOPGOK__DV =AOPGOK__DM;
    AOPGOK__MV =AOPGOK__MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOPGOK__OV=Regulator(RN, AIPGOK___V,
                              AOPGOK__PV, AOPGOK__IV, AOPGOK__DV, AOPGOK__MV,
                              AOPGOK__OM, AOPGOK__RV,
                              AOPGOK__ZV, AOPGOK__ZV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOPGOK__OV <  OL+AOPGOK_LOV){ AOPGOK__OV=OL+AOPGOK_LOV; }
       if (AOPGOK__OV >  OH-AOPGOK_HOV){ AOPGOK__OV=OH-AOPGOK_HOV; }
       if (AOPGOK__MV >= 0){ AOPGOK_OOV=100-AOPGOK__OV; }
       else                { AOPGOK_OOV=AOPGOK__OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
