//---------------------------------------------------------------------------
// Расход известкового молока на 2 сатурацию

//---------------------------------------------------------------------------
vd  far Reg_13(vd){
    //-----------------------------------------------------------------------
    ui RN=13;                              // Номер регулятора                
    _f IL=0;                               // Входная шкала (нижняя граница)  
    _f IH=100.00;                          // Входная шкала (верхняя граница) 
    _f OL=0.000;                           // Выходная шкала (клапан),%, н.гр.
    _f OH=100.0;                           // Выходная шкала (клапан),%, в.гр.
    _f DM=10.00;                           // Макс приращ вых регулятора      
    _f ZN=IH*0.001;                        // Зона нечуствительности          
    _f PR=20.00;                           // Процент рассогласования         
    ui CC=20;                              // Контрольный цикл                
    ui TP=1;                               // Тип регулятора                  
    _f KRZ=0;                              // Корректировка задания
    //-----------------------------------------------------------------------
    // проверка диапазонов
    if (AOFIM2S_RM!=AOFIM2S_RV){ 
        AOFIM2S_RV =AOFIM2S_RM; 
        if(AOFIM2S_RV>0){ Message(124); }
        else            { Message(125); AOFIM2S_OM=AOFIM2S_OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // Коррекция
    AOFIM2SZKV=AOFIM2SZKM;                  // Задание коррекции
    AOFIM2SPKV=AOFIM2SPKM;                  // Процент коррекции (соотношение)
    // Включение-выключение коррекции
    if(AOFIM2SRKM==SWITCH){
       AOFIM2SRKV=(AOFIM2SRKV==ON) then_ OFF else_ ON;  AOFIM2SRKM = OFF;
    }
    // Выход коррекции
    AOFIM2SOKV=-((AOFIM2SZKV-AIFSD2S__V)*AOFIM2SPKV);
    // Если коррекция выключена- выход коррекции равен 0
    if(AOFIM2SRKV==OFF){ KRZ=0; }
    else               { KRZ=AOFIM2SOKV; }
    //-----------------------------------------------------------------------

    //-----------------------------------------------------------------------
    // установка задания
    if (AOFIM2S_ZM <  IL         ){ AOFIM2S_ZM = IL; }
    if (AOFIM2S_ZM >  AIFIM2SAMV ){ AOFIM2S_ZM = AIFIM2SAMV; }
    AOFIM2S_ZV =  AOFIM2S_ZM;
    // задание с учетом коррекции
    AOFIM2SZNV =  AOFIM2S_ZV+KRZ;
    if (AOFIM2SZNV <  IL         ){ AOFIM2SZNV = IL; }
    if (AOFIM2SZNV >  AIFIM2SAMV ){ AOFIM2SZNV = AIFIM2SAMV; }
    // выход на клапан ручного управления
    if (AOFIM2S_OM < 0  ){ AOFIM2S_OM =0;   }
    if (AOFIM2S_OM > 100){ AOFIM2S_OM =100; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOFIM2SLOV =AOFIM2SLOM;
    AOFIM2SHOV =AOFIM2SHOM;
    // ограничение выхода на приборы снизу и сверху
    AOFIM2SLPV =AOFIM2SLPM;
    AOFIM2SHPV =AOFIM2SHPM;
    // коэффициенты регулятора
    AOFIM2S_PV =AOFIM2S_PM;
    AOFIM2S_IV =AOFIM2S_IM;
    AOFIM2S_DV =AOFIM2S_DM;
    AOFIM2S_MV =AOFIM2S_MM;
    //-----------------------------------------------------------------------
    if (RegRUN>0){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOFIM2S_OV=Regulator(RN, AIFIM2S__V,
                              AOFIM2S_PV, AOFIM2S_IV, AOFIM2S_DV, AOFIM2S_MV,
                              AOFIM2S_OM, AOFIM2S_RV,
                              AOFIM2SZNV, AOFIM2SZNV,
                                IL,  IH,  OL,  OH,
                                DM,  ZN,  PR,  CC,  TP
       );
       // ограничение выхода, %
       if (AOFIM2S_OV <  OL+AOFIM2SLOV){ AOFIM2S_OV=OL+AOFIM2SLOV; }
       if (AOFIM2S_OV >  OH-AOFIM2SHOV){ AOFIM2S_OV=OH-AOFIM2SHOV; }
       if (AOFIM2S_MV >= 0){ AOFIM2SOOV=100-AOFIM2S_OV; }
       else                { AOFIM2SOOV=AOFIM2S_OV; }
       //--------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
