//----------------------------------------------------------------------------
//  Получить значения с аналоговых модулей (i7017,i7033)
vd  far InpDataS(vd){
    _i  rec=0;

    #include "mod\ai\c2n10r00.c"
    #include "mod\ai\c2n19r09.c"
    #include "mod\ai\c2n1Ar10.c"
    #include "mod\ai\c2n29r19.c"

    return;
}
//----------------------------------------------------------------------------


//----------------------------------------------------------------------------
//  Получить значения с других аналоговых модулей
vd  far InpDataA(vd){

    return;
}
//----------------------------------------------------------------------------
