//---------------------------------------------------------------------------
//  Обновление значений каждый тик системы (18 раз/сек)
vd  far UpdDataT(vd){

    //-----------------------------------------------------------------------
    Mod_AR();
    //-----------------------------------------------------------------------
    // Задание значений переменных массива DBB для отладки
    DebugVal();
    //-----------------------------------------------------------------------

    //-----------------------------------------------------------------------
    // Вызов подпрограмм регуляторов
    if( (Timer(1,18,1))==2 ){ RegRUN=ON; }
    NewSEC=RegRUN;
    Regul_up();
    Regul_01();
    Regul_02();
    Regul_1c();
    Regul_1p();
    Regul_1z();
    Regul_2c();
    Regul_2p();
    Regul_2z();
    L_Signal();
    Mod_BS();
    RegRUN=OFF;
    //-----------------------------------------------------------------------


    //-----------------------------------------------------------------------
    // Передача переменных циклов работы программы контроллера
    TickLP1__V=TLoop;
    SecnLP1__V=SLoop;
    //-----------------------------------------------------------------------
    // Запись данных на диск
    if (WriteDT1_M>0){
        WriteDT1_M=0; WriteData(0); Message(20,0);
        printf("W");
    }
    //-----------------------------------------------------------------------
    // Проверка флага звонка
    if (Bell(1,2)==ON){ O1BELL___V=ON;  ErrBell1_V=ON; }
    if (Bell(2,2)==ON){ O2BELL___V=ON;  ErrBell1_V=ON; }
    // сброс флага звонка
    if (I1BOFF___V>OFF){
        Bell(1,OFF); O1BELL___V=OFF; ErrBell1_V=OFF; ErrBell1_M=OFF;
        printf("B");
    }
    if (I2BOFF___V>OFF){
        Bell(2,OFF); O2BELL___V=OFF; ErrBell1_V=OFF; ErrBell1_M=OFF;
        printf("B");
    }
    if (ErrBell1_M>OFF){
        Bell(1,OFF); Bell(2,OFF);
        O1BELL___V=OFF; O2BELL___V=OFF; ErrBell1_V=OFF; ErrBell1_M=OFF;
        printf("B");
    }
    //-----------------------------------------------------------------------
    // Вывод и установка времени и даты
    TimeCSS1_V=secC; TimeCSM1_V=minC; TimeCSH1_V=houC;
    DateCSD1_V=dayC; DateCSM1_V=monC; DateCSY1_V=yeaC;
    if(TMDTSet1_M>0){
       secC=TimeCSS1_M; minC=TimeCSM1_M; houC=TimeCSH1_M;
       dayC=DateCSD1_M; monC=DateCSM1_M; yeaC=DateCSY1_M;
       SetTime(houC, minC, secC);
       SetDate(yeaC, monC, dayC); Message(12,0); TMDTSet1_M=0;
    }
    //-----------------------------------------------------------------------
    // Передача номера текущего сообщения
    if (FirstCall>PAMSG){
       if (CurMESS1_V!=nMESSAGE){ CurMESS1_V=nMESSAGE; }
    } else {
       MessageCLS();
    }
    //-----------------------------------------------------------------------
    // Если передан флаг выхода из программы
    if (ExitFLG1_M>0){ ExitForLoad=ExitFLG1_M; ExitFLG1_M=0; }
    //-----------------------------------------------------------------------
    // Установка значений переданных оператором (из верхнего уровня)
    SetVal();
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
