; coding:cp866
;-----------------------------------------------------------------------------
; Примечания: 

;-----------------------------------------------------------------------------
; Windows определения:
;-----------------------------------------------------------------------------
; Имя принтера, как определено в Windows:
; Name   \\192.168.1.104\HPLaserJ
; Name  '\\192.168.1.104\HP LaserJet 1200 Series PCL 6'
  Name  'doPDF v7' 
; Name  'Canon iP1600'
; Name  \\192.168.0.1\CanoniP1
;----------------------------------
; Имя шрифта:
  FontName  'Courier New'
; Размер шрифта:
  FontSize  100
; Размер толщины:
  FontBold  200
; Наклонный:
  FontItal  0
; Подчеркнутый:
  FontUndr  0
; Зачеркнутый:
  FontSout  0
; Направление:
  FontOrnt  0
; Качество:
  FontQual  0
; Набор символов:
  CHARSET   255
; #define   ANSI_CHARSET        0
; #define   DEFAULT_CHARSET     1
; #define   SYMBOL_CHARSET      2
; #define   SHIFTJIS_CHARSET    128
; #define   HANGEUL_CHARSET     129
; #define   HANGUL_CHARSET      129
; #define   GB2312_CHARSET      134
; #define   CHINESEBIG5_CHARSET 136
; #define   GREEK_CHARSET       161
; #define   TURKISH_CHARSET     162
; #define   HEBREW_CHARSET      177
; #define   ARABIC_CHARSET      178
; #define   BALTIC_CHARSET      186
; #define   RUSSIAN_CHARSET     204
; #define   THAI_CHARSET        222
; #define   EASTEUROPE_CHARSET  238
; #define   OEM_CHARSET         255
; #define   JOHAB_CHARSET       130
; #define   VIETNAMESE_CHARSET  163
; #define   MAC_CHARSET         77 
;----------------------------------
; Отступ слева:
  OffsetX   400
; Отступ сверху:
  OffsetY   400
;-----------------------------------------------------------------------------



;-----------------------------------------------------------------------------
; Дополнительные определения:
;-----------------------------------------------------------------------------
; EndString #0D#0A
;-----------------------------------------------------------------------------

;-----------------------------------------------------------------------------
; ESC-комманды:
;-----------------------------------------------------------------------------
; инициализация принтера
; Init  @
;-----------------------------------------------------------------------------
; ориентация страницы "портрет"
; Orientation   &l0O
; ориентация страницы "ландшафт"
; Orientation   &l1O
;-----------------------------------------------------------------------------
; символов на дюйм
; Pitch         (s12H
;-----------------------------------------------------------------------------
; высота символов (1/72 дюйма)
; CharH         (s05V
;-----------------------------------------------------------------------------
; символьных строк на дюйм
; LineSpace     &l05D
;-----------------------------------------------------------------------------
; толщина символов нормальная
; CharB         &(s0B
; толщина символов двойная
; CharB         &(s3B
;-----------------------------------------------------------------------------
; размер пропорциональный
; Spacing       (s1P
; размер фиксированный
; Spacing       (s0P
;-----------------------------------------------------------------------------
; строка вывода строки на принтер
; PrintStr      &p
;-----------------------------------------------------------------------------
