// coding=cp866; version=2013013112; title="";
//---------------------------------------------------------------------------
// Дозировка сухого


#include "..\prg\_libpath.inc"
#include "..\prg\run_prgv.h"

#include "regul_e.h"


_f far *DONPR06v;
_i far  DONCN06v=0;                // счетчик цикла передергивания
_i far  DONCH06v=2;                // заданное кол-во циклов для передергивания
_i far  DONTM06v=2;                // кол-во секунд вкл и паузы

_i far  FLVB_ON_v=0;               // флаг очередности включения вибр-возд
_i far  IS06vERR=0;                // флаг ошибки сработки исполнителей




//---------------------------------------------------------------------------
//  Определения для передергивания исполнителей регулятора при несработке
vd  Isp06vPD(_f *IOPNT,_i far hM,_i far hS,_i far Step,_i far Step_Back,_i far ClearTON){
    DONPR06v= IOPNT;             // номер канала исполнителя для передергивания
    DONCH06v= hM;                // сколько  раз дергать
    DONTM06v= hS;                // кол-во секунд продолжения выполнения комманд
    STEP06v = Step;              // шаг регулятора для процедуры передергивания
    STEP06v_PRBK = Step_Back;    // шаг возврата из процедуры передергивания
    Clear_TO(ClearTON);          // обнулить таймер с заданным номером
    return;
}
//---------------------------------------------------------------------------





//---------------------------------------------------------------------------

//  В режиме [К] управлять исполнителями вручную нельзя

vd  far ModeKO_06v(vd){
    if(REG06cR__V==ON){
    DON221B__M =  OFF; // вибратор
    DON229B1_M =  OFF; // клапан вяжущие
    DON228B__M =  OFF; // шнек
    DON229B2_M =  OFF; // клапан
    //
    DON221E__M =  OFF; // вибратор выгрузки ДВ
    DON220E__M =  OFF; // клапан выгрузки ДВяж
}   }
//---------------------------------------------------------------------------
//  Выключение исполнителей регулятора
vd  far Regul_06v_off(vd){
    DON221B__V =  OFF; // вибратор
    DON229B1_V =  OFF; // клапан вяжущие
    DON228B__V =  OFF; // шнек
    DON229B2_V =  OFF; // клапан
    //
    DON221E__V =  OFF; // вибратор выгрузки ДВ
    DON220E__V =  OFF; // клапан выгрузки ДВяж
}
//---------------------------------------------------------------------------





//---------------------------------------------------------------------------

//  Выполнение действий при выключеном регуляторе

vd  far Regul_06v_manual(vd){
    //-----------------------------------------------------------------------
    if ( STEP06v == 101 ){
         REG06cSW_V=1001;
         if(RegRUN==OFF){ return; }
         Regul_06v_off();
         FLAG_0605A_v=OFF;
         FLAG_05WTA_v=OFF;
         STEP06v = 102;
         return;
    }
    //-----------------------------------------------------------------------
    if ( STEP06v == 102 ){
         STEP06vP = 102;
         REG06cSW_V=1002;
         REG06vR__M=OFF;
         AIW219FV_V=0;
         return;
    }
    //-----------------------------------------------------------------------
    STEP06v=101;
    return;
}
//---------------------------------------------------------------------------





//---------------------------------------------------------------------------
//  Определение шага запуска регулятора
vd  far Regul_06v(vd){

    ex vd far Regul_06c_manual(vd);
    ex vd far Regul_06c_off(vd);

    //------------------------------------------
    //  выбор режима выгрузки из дозатора сухого
    VGR_SHALLV=ON;; VGR_SHRECV=OFF; VGR_SHIZLV=OFF;

    //----------------------------------
    //  передача значения контроля ВГБМ для загрузки ДС
    if( CRVGBM___M>0){
        if(CRVGBM___V>0 && CRVGBM___M>0){ CRVGBM___V=0; Message(363,NOKV); CRVGBM___M=0; }
        if(CRVGBM___V<1 && CRVGBM___M>0){ CRVGBM___V=1; Message(362,NOKV); CRVGBM___M=0; }
        CRVGBM___M=0;
    }
    
    //----------------------------------
    // загрузка-выгрузка (из регулятора загрузки цемента)
        
    //----------------------------------
    // общий-локальный (из регулятора загрузки цемента)
    
    //----------------------------------
    // если регулятор выключен - выйти (проверка в регуляторе загрузки цемента)

    //----------------------------------
    // если во время выгрузки сухого поднялся герметизатор
    if (STEP06v>=32 and STEP06v<=33 and DISVGBMG_V==OFF){ Bell(1,1); Message(115,NOKV); return; }





    //--------------------------------------------------------------------------
    //
    //  ОПРЕДЕЛЕНИЕ СОСТОЯНИЯ РЕГУЛЯТОРА
    //
    //--------------------------------------------------------------------------

    if ( STEP06v == 0 ){

        if(STEP06vP!=0){
           ;;
        }; STEP06vP =0;
        if (RegRUN==OFF){ return; }

        Regul_06v_off();


        //-------------------------------
        //  ключ дозатора сухого (если в режиме наладки(=1)- выйти)
        REG06cSW_V =2;
        if(DIR216___V==1){ return; }

        // дополнительный сигнал на закрытие всех исполнителей
        // состояние проверять не надо (будем смотреть по весу)
        Regul_06v_off();




        //-------------------------------
        //  ЗАГРУЗКА :
        
        REG06cSW_V =9;

        //-------------------------------
        //  регулятор включен на загрузку для ЛОКАЛЬНОЙ работы
        //  (определение шага в регуляторе дозировки цемента)

        //-------------------------------
        //  регулятор включен для ОБЩЕЙ работы и дозатор сухого выгружен
        //  и у оператора нажата кнопка для загрузки
        //  (определение шага в регуляторе дозировки цемента)

        //-------------------------------


        //-------------------------------
        //  ВЫГРУЗКА общая
        //  Если дозатор сухого загружен и дозатор мокрого выгружен и паста набрана
        //  и включен общий регулятор и -  перейти на шаг выгрузки
        //  (определение шага в регуляторе дозировки цемента)

        //-------------------------------
        //  ВЫГРУЗКА локальная
        //  Если включен локальный регулятор и включена выгрузка
        //  и дозатор мокрого выгружен или регулятор 07 выключен -
        //  перейти на шаг выгрузки
        //  (определение шага в регуляторе дозировки цемента)

        //-------------------------------


        Clear_TO(24);

        return;
    }
    //-----------------------------------------------------------------------




   // ДОЗИРОВКА ВЯЖУЩЕГО

   //------------------------------------------------------------------------
   if ( STEP06v == 7 ){
       if(STEP06vP!=7){
          Regul_06v_off();
          CRVYGS___V=0;
          AIW219FV_V=0;
          AIW219NV_V=AIW219___V;
       }; STEP06vP =7;
       if(RegRUN==OFF){ return; }
       REG06cSW_V = 70;                // текущ подшаг регулятора
       Clear_TO(24);
       STEP06v=8;
       return;
   }
   //------------------------------------------------------------------------



   //------------------------------------------------------------------------
   if ( STEP06v == 8 ){
        if(STEP06vP!=8){
           Regul_06v_off();
           AIW219___O=AIW219___V;
           AIW219___C=0;
        }; STEP06vP =8;
        REG06cSW_V = 80;
        STEP06v=9;
        return;
   }
   //------------------------------------------------------------------------



   //------------------------------------------------------------------------
   if ( STEP06v == 9 ){
        if(STEP06vP!=9){
           Regul_06v_off();
           Clear_TO(24);
        }; STEP06vP =9;
        if(RegRUN==OFF){ return; }
        REG06cSW_V = 90;

        //  если дозировка в режиме Наладка- на шаг 15 (окончание загрузки)
        if (DIR216___V ==  1){ STEP06v = 15; return; }

        //  если вес дозатора больше рецептного веса вяжущего - перейти на шаг 15
        if (AIW219___V>=TRVYGS_VIB-LOAD_VGGRW){ STEP06v= 15; return; }

        REG06cSW_V = 91;
        //  проверка закрытия клапана выгрузки
        switch ( Check_TO  (24, TIME_ISPKV*SEC, DIS220F__V,'=',OFF,  1 )){
            case RUN: { return;; }
            case BAD: { Clear_TO(24); Message(638,KVIT); Bell(1,1); return;; }
        }

        Clear_TO(24);
        STEP06v = 10;
        return;
   }
   //------------------------------------------------------------------------



   //------------------------------------------------------------------------
   // ОТКРЫТИЕ исполнителей набора вяжущего
   if ( STEP06v ==10 ){
        if(STEP06vP!=10){
           Clear_TO(24);
           Clear_TO(25);
           Clear_TO(26);
           Clear_TO(27);
           Clear_TO(28);
        }; STEP06vP =10;
        if(RegRUN==OFF){ return; }
        DONVG_FR_V =0;
        AIW219VO_V =TRVYGS_VIB-LOAD_VGGRW;
        AIW219VZ_V =TRVYGS_VIB;

        // открыть клапан вяжущего после шнека
        REG06cSW_V = 101;
        DON229B2_V = ON;
        // кл после шнека
        switch ( Check_TO  (24, TIME_ISPKV*SEC, DIS229B2_V,'=',ON,  1 )){
            case RUN: { return;; }
            case BAD: {
                        if(DONCN06v>2){
                           Message(670,KVIT); DONCN06v=0; return;;
                        }; Isp06vPD(&DON229B2_V,3,TIME_ISPPW,70, 10, 24); return;;
                      }
            case END: { DONCN06v=0; break;; }
        }

        //  включить шнек дозировки вяжущего
        REG06cSW_V = 102;
        switch ( Check_TO  (25, TMISPVYG_W*SEC, ZERO,'=',ON, 1 )){
            case RUN: { return; }
        }
        DON228B__V = ON;
        switch ( Check_TO  (26, TIME_ISPRV*SEC, DIS228B__V,'=',ON,  1 )){
            case RUN: { return;; }
            case BAD: {
                        if(DONCN06v>2){
                           Message(670,KVIT); DONCN06v=0; return;
                        }; Isp06vPD(&DON228B__V,3,TIME_ISPPW,70, 10, 26); return;
                      }
            case END: { DONCN06v=0; break;; }
        }

        //  открыть клапан вяжущего на шнек
        REG06cSW_V = 103;
        switch ( Check_TO  (27, TMISPVYG_W*SEC, ZERO,'=',ON, 1 )){
            case RUN: { return; }
        }
        DON229B1_V = ON;
        switch ( Check_TO  (28, TIME_ISPKV*SEC, DIS229B1_V,'=',ON,  1 )){
            case RUN: { return;; }
            case BAD: {
                        if(DONCN06v>2){
                           Message(670,KVIT); DONCN06v=0; return;
                        }; Isp06vPD(&DON229B1_V,3,TIME_ISPPW,70, 10, 28); return;;
                      }
            case END: { DONCN06v=0; break;; }
        }

        Clear_TO(24);
        Clear_TO(25);
        Clear_TO(26);
        Clear_TO(27);
        Clear_TO(28);

        STEP06v = 11;
        return;
   }
   //------------------------------------------------------------------------



   //------------------------------------------------------------------------
   // ПРОВЕРКА НАБОРА ВЕСА ВЯЖУЩЕГО
   //------------------------------------------------------------------------
   if ( STEP06v == 11 ){
        if(STEP06vP!=11){
           AIW219___O=AIW219___V;      // запомнить текущий вес
           AIW219___C=0;               // счетчик циклов повторов
           TMVB_VB__C=0;               // счет врем провер веса включ вибрат
           TIME_VVONC=0;               // счет врем включ вибратора
           FLVB_ON_v=0;                // флаг включения вибратора|воздуха
        }; STEP06vP=11;
        REG06cSW_V=110;
        CNST_VB__C=0;

        AIW219VO_V =TRVYGS_VIB-LOAD_VGGRW;
        AIW219VZ_V =TRVYGS_VIB;

        //  если текущий вес больше общего заданного для набора вяжущего минус
        //  заданный вес отсечки для клапана на шнек(ГРУБО) - команда на закрытие
        //  клапана подачи вяжущего на шнек
        if( AIW219___V>=TRVYGS_VIB-VSOTSVYG_W ){ DON229B1_V=OFF; }

        //  если текущий вес больше общего заданного для набора вяжущего минус
        //  заданный вес отсечки - комм закрыт клапан подачи вяжущ на шнек
        if (AIW219___V>=TRVYGS_VIB-LOAD_VGGRW){
             DON229B1_V=OFF;
             DON229B2_V=ON;;
             DON228B__V=OFF;
             STEP06v=12; return;
        }


        //-------------------------------------------------------------------
        //  Вибратор вяжущих
        if (RegRUN==ON){
            // счетчик времени включения вибратора
            if(FLVB_ON_v>0){
                TIME_VVONC++;
                if(TIME_VVONC>=TIME_VVONW){ DON221B__V=OFF; FLVB_ON_v=0; TIME_VVONC=0; }
                TMVB_VB__C=0;
            }

            //  проверка веса для включения вибратора
            VSVB_VB__C=AIW219___V-AIW219___O;

            // счетчик времени проверки веса набора для включения вибратора
            TMVB_VB__C++;
            if (TMVB_VB__C>= TMVB_VB__W){
                // если запомненный вес + вес включения вибратора больше
                // текущего веса дозатора (нет набора)
                if(AIW219___O+VSVB_VB__W>AIW219___V){
                      DON221B__V=ON;;
                      FLVB_ON_v=1;
                      TIME_VVONC=0;
                      // увеличить счетчик ненабора веса
                      AIW219___C++;
                } else {
                // если набор веса идет нормально- сбросить счетчик ненабора
                   AIW219___C=0;
                }
                TMVB_VB__C=0;               // сбросить счет проверки веса
                AIW219___O=AIW219___V;      // запомнить текущий вес дозатора
            }
        }
        //-------------------------------------------------------------------
        return;
   }
   //------------------------------------------------------------------------



   //------------------------------------------------------------------------
   // ПРОВЕРКА закрытия исполнителей набора вяжущего
   //------------------------------------------------------------------------
   if ( STEP06v == 12 ){
        if(STEP06vP!=12){
           Clear_TO(24);
           Clear_TO(25);
           Clear_TO(26);
           Clear_TO(27);
           Clear_TO(28);
           IS06vERR =0;
           TMST_VBV_C=0;
           AIW219___C=0;
           AIW219___O=AIW219___V;
        }; STEP06vP =12;
        if(RegRUN==OFF){ return; }
        Regul_06v_off();

        AIW219FV_V=12;

        //  клапан вяжущего на шнек
        REG06cSW_V = 120;
        switch ( Check_TO  (24, TIME_ISPKV*SEC, DIS229B1_V,'=',OFF,  1 )){
            case RUN: { return;; }
            case BAD: {
                        if(DONCN06v>1){ IS06vERR=1; DONCN06v=0; break;; }
                        Isp06vPD(&DON229B1_V,3,TIME_ISPPW,70, 12, 24); return;;
                      }
            case END: { DONCN06v=0; break;; }
        }
        //  клапан вяжущего после шнека
        switch ( Check_TO  (25, TIME_ISPKV*SEC, DIS229B2_V,'=',OFF,  1 )){
            case RUN: { return;; }
            case BAD: {
                        if(DONCN06v>1){ IS06vERR=2; DONCN06v=0; break;; }
                        Isp06vPD(&DON229B2_V,3,TIME_ISPPW,70, 12, 25); return;;
                      }
            case END: { DONCN06v=0; break;; }
        }
        //  шнек вяжущих
        switch ( Check_TO  (26, TIME_ISPKV*SEC, DIS228B__V,'=',OFF,  1 )){
            case RUN: { return;; }
            case BAD: {
                        if(DONCN06v>1){ IS06vERR=3; DONCN06v=0; break;; }
                        Isp06vPD(&DON228B__V,3,TIME_ISPPW,70, 12, 26); return;;
                      }
            case END: { DONCN06v=0; break;; }
        }
        DONCN06v=0;

        //  ждать время стабилизации веса
        REG06cSW_V=121;
        AIW219___O=AIW219___V;
        switch ( Check_TO  (27, TMST_VBV_W*SEC, ZERO,'=',ON, 1)){
            case RUN: { TMST_VBV_C++; return;; }
            case BAD: { break;;  }
        }

        Clear_TO(24);
        Clear_TO(25);
        Clear_TO(26);
        Clear_TO(27);
        Clear_TO(28);

        //  если вес не стабилизировался после заданного кол-ва проверок
        if(CNST_VB__C>=CNST_VB__W){ Bell(1,1); Message(145,NOKV); return; }

        //  если после 2ой проверки передергивания, клапана дозировки не закр
        if(AIW219___C>1){ AIW219___C=0; Bell(1,1); Message(142,NOKV); return; }
        //  разрешить 2ю проверку, если были ошибки закрытия исполнителей
        if(IS06vERR  >0){ AIW219___C++; return; }

        //  если текущий вес равен рецептному для набора вяжущего минус 10
        //  - перейти на следующий шаг (окончания загрузки)
        if (AIW219___V>=TRVYGS_VIB-10){
            STEP06v=15; return;
        }

        return;
   }
   //------------------------------------------------------------------------



   //------------------------------------------------------------------------
   // ВЫКЛЮЧЕНИЕ РЕГУЛЯТОРА
   if ( STEP06v == 15 ){
        if(STEP06vP!=15){
           ;;
        }; STEP06vP =15;
        AIW219VO_V =0;
        // переключение шага в регуляторе дозировки цемента (regul06c.c)
        return;
   }
   //------------------------------------------------------------------------



   //------------------------------------------------------------------------
   //  ВЫГРУЗКА
   if ( STEP06v == 31 ){
        if(STEP06vP!=31){
           Regul_06v_off();

           Clear_TO(24);
           Clear_TO(25);
           Clear_TO(26);
           Clear_TO(27);
           Clear_TO(28);
           Clear_TO(29);
        }; STEP06vP =31;
        if(RegRUN==OFF){ return; }
        AIW219PVZV =AIW219___V;

        if (STEP06c!=34) return;

        // ротор включен?
        REG06cSW_V= 312;
        switch ( Check_TO  (24, 1*MIN, DISVGBMR_V,'=',ON,  1 )){
            case RUN: { return;; }
            case BAD: { Clear_TO(24); Message(386,KVIT); Bell(1,1); return;; }
        }

        // герметизатор опущен?
        REG06cSW_V= 313;
        switch ( Check_TO  (25, 1*MIN, DISVGBMG_V,'=',ON,  1 )){
            case RUN: { return;; }
            case BAD: { Clear_TO(25); Message(387,KVIT); Bell(1,1); return;; }
        }

        // открыть клапан выгрузки вяжущих
        REG06cSW_V= 316;
        DON220E__V= ON;
        switch ( Check_TO  (26, TIME_ISPKV*SEC, DIS220E__V,'=',ON, 1 )){
            case RUN: { return;; }
        }

        Clear_TO(24);
        Clear_TO(25);
        Clear_TO(26);

        CNT_VIGRUZ_S=0;

        STEP06v =  32;
        return;
   }
   //------------------------------------------------------------------------


   //------------------------------------------------------------------------
   // Проверка выгрузки дозатора вяжущих
   if ( STEP06v == 32 ){
        if(STEP06vP!=32){
           Clear_TO(24);
           AIW219___O=AIW219___V;
           AIW219___S=AIW219___V;
           AIW219___C=0;
           TIME_PONVC=0;
           // включить вибратор
           DON221E__V= ON;
        }; STEP06vP =32;
        REG06cSW_V =320;

        // через заданный в настройках вес -
        // выключить вибратор, закрыть клапан выгрузки
        if(AIW219___O-AIW219___V>=LOAD_SVPVW){
           DON221E__V=OFF; DON220E__V=OFF;
        }

        AIW219VO_V =AIW219PVZV-TRVYGS_VIB;

        // если выгрузка дозатора прошла -
        // выключить вибратор, закрыть клапан выгрузки и перейти на следующий шаг
        if(AIW219VO_V > AIW219___V && AIW219___V < 5 ){
           DON221E__V=OFF;
           DON220E__V=OFF;
           Message(302,NOKV);
           STEP06v=33;
           return;
        }

        LOAD_SVPVC=AIW219___O-AIW219___V;

        if(RegRUN==OFF){ return; }

        if(DIS220E__V==OFF||DON220F__V==OFF){
           DON221E__V =OFF;
           TIME_PONVC++; if(TIME_PONVC>10000){ TIME_PONVC=0; }
           switch ( Check_TO  (24, TIME_PONVW*SEC, ZERO,'=',ON, 1 )){
               case RUN: { return; }
           };  Clear_TO(24);
           TIME_PONVC=0;
           AIW219___O = AIW219___V;
           DON221E__V = ON;
           DON220E__V = ON;
        }

        TMST_VIS_C++;
        if (TMST_VIS_C>= TMST_VIS_W){
            if(AIW219___V+VSST_VIS_W>AIW219___O){
               AIW219___C++; DON220E__V=ON; DON221E__V=ON;
            } else {
               AIW219___C=0;
            }
            TMST_VIS_C=0;
            AIW219___O=AIW219___V;
        }

        // если в дозаторе есть какой-то небольшой вес и он стабилен -
        // выключить вибратор, закрыть клапан выгрузки и перейти на следующий шаг
        if(AIW219___V<10&&AIW219___C>1){
           if(AIW219___C>2){
              DON221E__V=OFF;
              DON220E__V=OFF;
              STEP06v=33;
              return;
           }
        }
        return;
   }
   //------------------------------------------------------------------------
   // закрытие всех исполнителей и проверка стабилизации веса
   if ( STEP06v == 33 ){
        if(STEP06vP!=33){
           Clear_TO(24); Clear_TO(25); Clear_TO(26);
           Regul_06c_off();
           TIME_SHVVC=0;
           TMST_VIS_C=0;
        }; STEP06vP =33;
        if(RegRUN==OFF){ return; }
        REG06cSW_V =331;

        DON211B1_V=2;

        switch ( Check_TO  (24, TMST_VIS_W*SEC, ZERO,'=',ON, 1 )){
            case RUN: { TMST_VIS_C++; return;; }
            case BAD: { AIW219___O=AIW219___V; break;; }
        }

        if(AIW219___V+VSST_VIS_W<AIW219___O){ Message(304,KVIT); }

        REG06cSW_V =332;
        switch ( Check_TO  (25, TIME_SHVVW*SEC, ZERO,'=',ON, 1 )){
            case RUN: { TIME_SHVVC++; return;; }
        }

        Clear_TO(24); Clear_TO(25); Clear_TO(26);
        Regul_06c_off();

        STEP06v=34;
        return;
   }
   //------------------------------------------------------------------------
   // Ожидание действий (шага) от регулятора загрузки цемента
   if ( STEP06v == 34 ){
        if(STEP06vP!=34){
        }; STEP06vP =34;
        if(RegRUN==OFF){ return; }
   }
   //-----------------------------------------------------------------------



   //-----------------------------------------------------------------------
   // ПЕРЕДЕРГИВАНИЕ КЛАПАНОВ
   //-----------------------------------------------------------------------
   if ( STEP06v ==70 ){
        if(STEP06vP!=70){
           ;;
        }; STEP06vP =70;
        if(DONCN06v>=DONCH06v){ STEP06v = STEP06v_PRBK; return; }
        REG06cSW_V =700;
        if(RegRUN==OFF){ return; }
        if(Check_TO(206, DONTM06v*SEC, ZERO,'=',ON, 1 )==RUN){ return; }
           Clear_TO(206);
       *DONPR06v=(*DONPR06v!=ON)?ON:OFF;
        DONCN06v++;
        STEP06v = STEP06v_PRBK;
        return;
   }
   //-----------------------------------------------------------------------

   return;
}
//---------------------------------------------------------------------------
