// coding=cp866; version=2013013112; title="";
//---------------------------------------------------------------------------
// Дозировка воды

#include "..\prg\_libpath.inc"
#include "..\prg\run_prgv.h"

#include "regul_e.h"

_f far *DONPR07v;
_i far  DONCN07v=0;                 // счетчик цикла передергивания             
_i far  DONCH07v=2;                 // заданное кол-во циклов для передергивания
_i far  DONTM07v=2;                 // кол-во секунд вкл и паузы

_f far  CNTTEMPv=0;                 // временный счетчик

//---------------------------------------------------------------------------
//  Определения для передергивания исполнителей регулятора при несработке
vd  Isp07vPD(_f *IOPNT,_i far hM,_i far hS,_i far Step,_i far Step_Back,_i far ClearTON){
    DONPR07v= IOPNT;
    DONCH07v= hM;
    DONTM07v= hS;
    STEP07v = Step; 
    STEP07v_PRBK = Step_Back;
    Clear_TO(ClearTON);
    return;
}
//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
vd  far Regul_07v(vd){

    ex vd far Regul_07off_V(vd);
    ex vd far Regul_07off_O(int);
    ex vd far Regul_07off_S(int);

    //  доп переменные для клапана воды
    _f  DISKLVD=0;

    REG07vS1_V=STEP07v;
    if (REG07vS1_M>0){
        REG07vS1_V=REG07vS1_M; REG07vS1_M=0; STEP07v=REG07vS1_V;
    }

    // ПРОВЕРКА УСЛОВИЙ включения регулятора
    //-----------------------------------------------------------------------
    if (STEP07v==0){
        if(STEP07vP!=0){
        }; STEP07vP =0;
        if (RegRUN==OFF){ return; }
        return;
    }
    //-----------------------------------------------------------------------


    // Определение направления (загрузка-выгрузка) работы регулятора
    //-----------------------------------------------------------------------
    if (STEP07v==1){
        if(STEP07vP!=1){
        }; STEP07vP =1;
        if (RegRUN==OFF){ return; }
        return;
    }
    //-----------------------------------------------------------------------



    //-----------------------------------------------------------------------
    // НАБОР ВОДЫ 
    //-----------------------------------------------------------------------

    if (STEP07v==22){
        if(STEP07vP!=22){
           Clear_TO(75); Regul_07off_V();
           AIW251___O = AIW251___V;         // запомнить текущий вес дозатора
           AIW251NV_V = AIW251___V;         // запомнить текущий вес дозатора
           AIW251VD_V = AIW251___V;
        }; STEP07vP =22;
        REG07SW__V =221;

        // определить вес отсечки, задания и блокировки
        // если выбрана дозировка покомпонентно
        AIW251VO_V = TRVODD_VIB-VSOT_VDDGW;
        AIW251VZ_V = TRVODD_VIB;

        // проверить вес набора воды:
        // если вес дозатора больше веса отсечки- перейти на набор след комп
        if(AIW251___V > AIW251VO_V){ Regul_07off_V(); STEP07v=24; return; }

        if(RegRUN==OFF){ return; }

        // дать комманду на открытие клапана воды
        DON251H1_V=ON; DON251G1_V=OFF; DISKLVD=DIS251H1_V;
        // если гор вода выбрана первой для набора и включен режим температур
        if(AIWVDGQ__V==1&&KQ_ON____V==1){ DON251G1_V=ON; DON251H1_V=OFF; DISKLVD=DIS251G1_V; }
        // проверка открытия клапана
        switch ( Check_TO  (75, TIME_ISPKV*SEC, DISKLVD,'=',ON, 1 )){
            case RUN: return;;
            case BAD: { 
                        if(DONCN07v>2){ Bell(1,1); Message(151,KVIT); DONCN07v=0; return; }
                      }
            case END: { DONCN07v=0; break;; }
        }
        Clear_TO(75);

        STEP07v=23;
        return;
    }
    //-----------------------------------------------------------------------


    // ПРОВЕРКА ВЕСА НАБОРА ВОДЫ 
    //-----------------------------------------------------------------------
    if (STEP07v==23){
        if(STEP07vP!=23){
           TMST_VD__C = 0;
           VSST_VD__C = 0;
           AIW251___O = AIW251___V;         // запомнить текущий вес дозатора
        }; STEP07vP =23;
        REG07SW__V =231;

        //  определить вес отсечки, задания и блокировки
        //  если выбрана дозировка покомпонентно
        AIW251VO_V = TRVODD_VIB-VSOT_VDDGW;
        AIW251VZ_V = TRVODD_VIB;

        // если текущий вес больше рецептного минус вес отсечки
        if (AIW251___V >= AIW251VO_V){ Regul_07off_V(); STEP07v=24; return; }

        if (RegRUN==OFF){ return; }

        // Если включен режим дозировки с учетом температур
        if(KQ_ON____V==1){
           // переключение клапанов для набора другой воды
           if(AIWVDGQ__V==1){
              if(AIW251___V>AIWVDG___V){   // гв выбрана первой, г-выкл,х-вкл
                 DON251G1_V=0;
                 DON251H1_V=1;
              }
           } else {
              if(AIW251___V>AIWVDH___V){   // хв выбрана первой, х-выкл,г-вкл
                 DON251G1_V=1;
                 DON251H1_V=0;
              }
        }  }

        // увеличить счетчик времени проверки веса набора воды
           TMST_VD__C++;
        if(TMST_VD__C>TMST_VD__W){
           // если запомненный вес дозатора + заданный вес стабилизации больше
           // чем текущий вес дозатора (нет набора веса)
           if(AIW251___O+VSST_VD__W>AIW251___V){
              // увеличить счетчик проверок веса стабилизации
              VSST_VD__C++;
              // если счетчик проверок веса стабилизации >2 
              if(VSST_VD__C>2){ Bell(1,1); Message(152,KVIT); VSST_VD__C=0; return; }
           } else {
           // если вес набирается нормально- обнулить счетчик проверок веса
              VSST_VD__C=0;
           }
           // запомнить текущий вес дозатора
           AIW251___O=AIW251___V;
           // обнулить счетчик времени стабилизации
           TMST_VD__C=0;
        }
        return;
    }
    //-----------------------------------------------------------------------


    // ПРОВЕРКА ЗАКРЫТИЯ КЛАПАНА набора воды и стабилизации веса
    //-----------------------------------------------------------------------
    if (STEP07v==24){
        if(STEP07vP!=24){
           Clear_TO(75); Clear_TO(76); Clear_TO(77);
           TMST_VD__C=0;
           CNST_VDD_C=0;
           AIW251___O=AIW251___V;           // запомнить текущий вес дозатора
        }; STEP07vP =24;
        REG07SW__V =241;
        Regul_07off_V();

        if (RegRUN==OFF){ return; }

        //  проверить закрытие клапана набора воды
        switch ( Check_TO  (75, TIME_ISPKV*SEC, DIS251H1_V,'=',OFF, 1 )){
            case RUN: { return;; }
            case BAD: { 
                        if(DONCN07v>2){ Bell(1,1); Message(153,KVIT); DONCN07v=0; return; }
                        Isp07vPD(&DON251H1_V,3,TIME_ISPPW,70, STEP07vP, 75); return;
                      }
            case END: { DONCN07v=0; AIW251___O=AIW251___V; break;; }
        }
        switch ( Check_TO  (76, TIME_ISPKV*SEC, DIS251G1_V,'=',OFF, 1 )){
            case RUN: { return;; }
            case BAD: { 
                        if(DONCN07v>2){ Bell(1,1); Message(153,KVIT); DONCN07v=0; return; }
                        Isp07vPD(&DON251G1_V,3,TIME_ISPPW,70, STEP07vP, 76); return;
                      }
            case END: { DONCN07v=0; AIW251___O=AIW251___V; break;; }
        }
        Regul_07off_V();

        //  ждать время стабилизации веса
        REG07SW__V =242;
        switch ( Check_TO  (77, TMST_VD__W*SEC, ZERO,'=',ON, 1)){
            case RUN: { TMST_VD__C++; return;; }
            case BAD: { break;;  }
        }

        Clear_TO(75); Clear_TO(76); Clear_TO(77);

        //  проверка веса стабилизации:
        //  если запомненный вес дозатора + вес стабилизации меньше текущего
        //  веса дозатора (вес продолжает набираться(нет стабилизации веса))
        if(AIW251___O+VSST_VD__W<AIW251___V){
           CNST_VDD_C++;
           //  если счетчик проверок стабилизации больше заданного-
           //  сообщение, звонок, выключить регулятор
           if(CNST_VDD_C>CNST_VDD_W){
              Bell(1,1); Message(154,KVIT); Message(677,KVIT); REG07R___M=OFF; return;
           }
        }
        STEP07v=30;
        return;
    }
    //-----------------------------------------------------------------------




    // ОПРЕДЕЛЕНИЕ ПЕРЕХОДА после окончания выгрузки или загрузки
    //-----------------------------------------------------------------------
    if (STEP07v==30){
        if(STEP07vP!=30){
        }; STEP07vP =30;

        // Если включен общий регулятор и в дозаторе воды более 20кг - 
        // перейти на выгрузку воды
        if (RegPublicV==ON and REG07GL__V==ON and AIW251___V>20){ STEP07v=51; }

        // Если включен общий регулятор и выгрузка вяжущего закончена
        if (RegPublicV==ON and REG07GL__V==ON and (STEP06v>=33 and STEP06v<=34)){
            // начать набор воды
            STEP07v=22; return;
        }

        return;
    }
    //-----------------------------------------------------------------------



    // STEP07v > 40 - выгрузка


    //  ВЫГРУЗКА ИЗ ДОЗАТОРА ВОДЫ В ВГБМ
    //-----------------------------------------------------------------------
    //  проверка готовности ВГБМ
    if (STEP07v==51){
        if(STEP07vP!=51){
           Clear_TO(75); Clear_TO(76);
        }; STEP07vP =51;
        Regul_07off_V();

        if (RegRUN==OFF){ return; }

        //  если ВГБМ не включена - звонок
        REG07SW__V=511;
        switch ( Check_TO  (75, 1*MIN, DISVGBMR_V,'=',ON, 1 )){
            case RUN: { return; }
            case BAD: { Clear_TO(75); Message(386,NOKV); return; }
        };  Clear_TO(75);

        //  если герметизатор не опущен - звонок
        REG07SW__V=512;
        switch ( Check_TO  (76, 1*MIN, DISVGBMG_V,'=',ON, 1 )){
            case RUN: { return; }
            case BAD: { Clear_TO(76); Message(387,NOKV); return; }
        }

        Clear_TO(75); Clear_TO(76);
        STEP07v=52;

        return;
    }
    //-----------------------------------------------------------------------


    //-----------------------------------------------------------------------
    // промывка ВГБМ
    if (STEP07v==52){
        if (STEP07vP!=52){
            AIW251___O = AIW251___V;                        // вес дозатора воды
            VDPRVGBM_R = AIW251___V * 0.01 * VDPRVGBM_V;    // вес промывки ВГБМ
            VDPRDSL__R = AIW251___V * 0.01 * VDPRDSL__V;    // вес промывки ДШлама
            VDZGVGBM_R = AIW251___V * 0.01 * VDZGVGBM_V;    // вес доп воды
        };  STEP07vP=52; REG07SW__V = 521;

        // Если ВГБМ не включена - перейти на шаг проверки ВГБМ
        if (DISVGBMR_V==OFF){ STEP07v=51; return; }
        // Если герметизатор не опущен - перейти на шаг проверки ВГБМ
        if (DISVGBMG_V==OFF){ STEP07v=51; return; }

        // Если выгрузочный клапан ВГБМ не закрыт (здесь =1) и форма не ЗАЛИТА (=1)
        if (DIS2x12__V<1 or DIS2x13__V<1){
            // Закрыть клапан промывки ВГБМ
            // Остаточный вес промывки ВГБМ добавится к дополнительной воде
            // Закрыть клапан промывки и перейти на следующий шаг
            // DON2x02__V=OFF; STEP07v=53;
            
            // ждать закрытие клапана и окончания заливки формы (ФОРМА ГОТОВА)
            return;
        }
        
        // Ожидание шага загрузки или выгрузки регулятора дозатора мокрого (шлама)
        // если выгрузка пасты не закончена - ждать выгрузку пасты (!!!???)
        REG07SW__V=521;
        if (RegPublicV==ON and REG07GL__V==ON and STEP07<5) return;

        // Открыть клапан промывки ВГБМ и включить насос промывки
        DON2x02__V=ON; DON2x04__V=ON;
        
        // Если вес дозатора меньше, чем запомненный вес минус вес промывки ВГБМ
        // Закрыть клапан промывки и перейти на следующий шаг
        if (AIW251___V < AIW251___O-VDPRVGBM_R){ DON2x02__V=OFF; STEP07v=53; }
        return;
    }
    //-----------------------------------------------------------------------


    //-----------------------------------------------------------------------
    // выгрузка дополнительной воды в ВГБМ
    if (STEP07v==53){
        if(STEP07vP!=53){
        }; STEP07vP =53;

        // Ожидание шага выгрузки регулятора дозатора мокрого (шлама)
        REG07SW__V=531;
        if (RegPublicV==ON and REG07GL__V==ON and STEP07>0 and STEP07<52) return;

        if (RegRUN==OFF){ return; }

        //  открыть клапан выгрузки в ВГБМ и включить насос
        REG07SW__V =532;
        DON2x07__V = ON;
        DON2x04__V = ON;
        switch ( Check_TO  (75, TIME_ISPKV*SEC, DIS2x07__V,'=',ON, 1)){
            case RUN: { return;; }
            case BAD: { 
                        if(DONCN07v>2){ Bell(1,1); Message(159,KVIT); DONCN07v=0; return; }
                        Isp07vPD(&DON2x07__V,3,TIME_ISPPW,70, STEP07vP, 75); return;
                      }
            case END: { DONCN07v=0; break;; }
        };  Clear_TO(75);
        
        MK_VG_KL_OPEN=0; 
        AIW251___P=AIW251___V;
        STEP07v=54;
        return;
    }
    //-----------------------------------------------------------------------


    // ПРОВЕРКА ВЕСА ВЫГРУЗКИ дозатора воды
    //-----------------------------------------------------------------------
    if (STEP07v==54){
        if (STEP07vP!=54){
            AIW251___P=AIW251___V;
            VSST_MKVIC=0;
            TMST_MKVIC=0;
            CNST_MKVIC=0;
        };  STEP07vP =54;
        REG07SW__V =541;

        //  если текущий вес дозатора меньше или равен нулю- перейти на след шаг
        if (AIW251___V<=0 or CNST_MKVIC>=CNST_MKVIW){ DON2x02__V=OFF; STEP07v=55; return; }

        //  Если вес дозатора меньше, чем запомненный вес дозатора минус (вес промывки + вес доп воды),
        //  Закрыть клапан дозировки и перейти на следующий шаг
        if (AIW251___V < AIW251___O - (VDPRVGBM_R+VDZGVGBM_R) ){ DON2x02__V=OFF; STEP07v=55; }

        if (RegRUN==OFF){ return; }

        //  если подошло время проверки стабилизации веса дозатора мокрого
        TMST_MKVIC++;
        if (TMST_MKVIC>TMST_MKVIW){
            //  если вес стабилизировался- увеличить счетчик стабилизац веса
            if (AIW251___V+VSST_MKVIW>AIW251___P){ CNST_MKVIC++; }
            else                                 { CNST_MKVIC=0; }
            AIW251___P=AIW251___V; TMST_MKVIC=0;
        }
        return;
    }
    //-----------------------------------------------------------------------


    //-----------------------------------------------------------------------
    // ожидание выгрузки шлама
    if (STEP07v==55){
        if (STEP07vP!=55){
            DON2x07__V=OFF; // закрыть клапан выгрузки в ВГБМ
        };  STEP07vP =55;
        if (RegRUN==OFF){ return; }
        REG07SW__V =551;
        // если включен общий регулятор - ждать выгрузку шлама
        if(RegPublicV==ON and REG07GL__V==ON and STEP07>=52 and STEP07<55) return;
        STEP07v=56;
        return;
    }
    //-----------------------------------------------------------------------


    //-----------------------------------------------------------------------
    // промывка дозатора шлама
    if (STEP07v==56){
        if(STEP07vP!=56){
           Clear_TO(75); Clear_TO(76);
        }; STEP07vP =56;

        // открыть клапан воды в дозатор шлама, включить насос промывки
        DON2x01__V=ON;
        DON2x04__V=ON;

        if (RegRUN==OFF){ return; }
 
        REG07SW__V =561;

        //  если вес дозатора больше нуля - увеличить счетчик
        if (AIW251___V>0){ CNTTO[75]++; }
        else             { STEP07v=59;  }
        //  если счетчик > ??сек (максимальное время промывки) - перейти на след шаг
        if (CNTTO[75]>30){ STEP07v=59;  }
        return;
    }
    //-----------------------------------------------------------------------

    // резерв
    if (STEP07v==57 or STEP07v==58){ STEP07v=59; return; }


    // ПЕРЕДЕРГИВАНИЕ КЛАПАНА ВЫГРУЗКИ
    //-----------------------------------------------------------------------
    if (STEP07v==59){
        if(STEP07vP!=59){
           CNST_MKVIC=0;
           Clear_TO(75); Clear_TO(76);
        }; STEP07vP =59;
        
        if (RegRUN==OFF){ return; }

        REG07SW__V =591;
        MK_VG_KL_OPEN++;

        if(DON2x07__V ==ON & MK_VG_KL_OPEN%3==0){
           DON2x07__V = OFF;
           switch ( Check_TO  (75, 2, DON2x07__V,'=',OFF, 1 )){
               case RUN: return;;
           };  Clear_TO(75);
        }

        if(DIS2x07__V ==OFF & MK_VG_KL_OPEN%3==0){
           DON2x07__V = ON;
           switch ( Check_TO  (76, 5, DIS2x07__V,'=',ON, 1 )){
               case RUN: return;;
           };  Clear_TO(76);
        }

        if (MK_VG_KL_OPEN>7){ STEP07v=60; }
        return;
    }
    //-----------------------------------------------------------------------


    // ЗАКРЫТЬ все КЛАПАНА дозатора воды
    //-----------------------------------------------------------------------
    if (STEP07v==60){
        if(STEP07vP!=60){
           ;;
        }; STEP07vP =60;
        // закрыть и выключить все исполнители дозатора воды
        Regul_07off_V();
        if (RegRUN==OFF){ return; }
        // проверка закрытия клапана выгрузки
        REG07SW__V = 601;
        switch ( Check_TO  (75, TIME_ISPKV*SEC, DIS2x07__V,'=',OFF, 1 )){
            case RUN: return;;
            case BAD: { 
                        if(DONCN07v>2){ Bell(1,1); Message(160,KVIT); DONCN07v=0; return; }
                        Isp07vPD(&DON2x07__V,3,TIME_ISPPW,70, STEP07vP, 75); return;
                      }
            case END: { DONCN07v=0; break;; }
        };  Clear_TO(75);

        STEP07v=30;
        return;
    }
    //-----------------------------------------------------------------------

    // резерв
    if (STEP07v>60 and STEP07v<70){ STEP07v=60; return; }


    //-----------------------------------------------------------------------
    // ПЕРЕДЕРГИВАНИЕ КЛАПАНОВ
    //-----------------------------------------------------------------------
    if (STEP07v==70){
        if(STEP07vP!=70){
           ;;
        }; STEP07vP =70;
        if(DONCN07v>=DONCH07v){ STEP07v=STEP07v_PRBK; return; }
        REG07SW__V =700;
        if(RegRUN==OFF){ return; }
        if(Check_TO(207, DONTM07v*SEC, ZERO,'=',ON, 1 )==RUN){ return; }
           Clear_TO(207);
       *DONPR07v=(*DONPR07v!=ON)?ON:OFF;
        DONCN07v++;
        STEP07v=STEP07v_PRBK;
        return;
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
