// coding=cp866; version=2013013112; title="";
//---------------------------------------------------------------------------
// Температура шлама (AIT064,AIT065)

#include "..\prg\_libpath.inc"
#include "..\prg\run_prgv.h"

#include "regul_e.h"

//---------------------------------------------------------------------------
vd  far Regul_11(vd){
    //-----------------------------------------------------------------------
    ui  RN=1;                         // Номер регулятора
    _f  IL=0;                         // Входная шкала (нижняя граница)
    _f  IH=100;                       // Входная шкала (верхняя граница)
    _f  OL=0.000;                     // Выходная шкала (клапан),%, н.гр.
    _f  OH=100.0;                     // Выходная шкала (клапан),%, в.гр.
    _f  DM=20.00;                     // Макс приращ вых регулятора
    _f  ZN=100*0.001;                 // Зона нечуствительности
    _f  PR=20.00;                     // Процент рассогласования
    _f  CC=20;                        // Контрольный цикл
    ui  TP=1;                         // Тип регулятора

    //-----------------------------------------------------------------------
    // текущая Т регулирования в зависимости от выбранной емкости
    if(OBJM64___V>0) AIT050___V=AIT064___V; else AIT050___V=AIT065___V;

    // проверка диапазонов
    if ( REG11RS__M == SWITCH ){
         AOT050__RM = (AOT050__RM==ON) then_ OFF else_ ON; REG11RS__M=OFF;
    }
    if (AOT050__RM!=AOT050__RV){
        AOT050__RV =AOT050__RM;
        if(AOT050__RV==AUTO){ Message(420,NOKV); }
        else                { Message(421,NOKV); AOT050__OM=AOT050__OV=WO_Skip[RN]; }
    }
    //-----------------------------------------------------------------------
    // установка задания
    if (AOT050__ZM < IL ){ AOT050__ZM = IL; }
    if (AOT050__ZM > IH ){ AOT050__ZM = IH; }
    AOT050__ZV =  AOT050__ZM;
    // выход на клапан ручного управления
    if (AOT050__OM < OL ){ AOT050__OM = OL; }
    if (AOT050__OM > OH ){ AOT050__OM = OH; }
    //-----------------------------------------------------------------------
    // ограничение выхода регулятора снизу и сверху
    AOT050_LOV =AOT050_LOM;
    AOT050_HOV =AOT050_HOM;
    AOT050_LPV =AOT050_LPM;
    AOT050_HPV =AOT050_HPM;
    // коэффициенты регулятора
    AOT050__PV =AOT050__PM;
    AOT050__IV =AOT050__IM;
    AOT050__DV =AOT050__DM;
    AOT050__MV =AOT050__MM;
    //-----------------------------------------------------------------------
    if (RegRUN==ON){
       //--------------------------------------------------------------------
       // аналоговый регулятор
       AOT050__OV=Regulator(RN, AIT050___V,
                                AOT050__PV, AOT050__IV, AOT050__DV, AOT050__MV,
                                AOT050__OM, AOT050__RV,
                                AOT050__ZV, AOT050__ZV,
                                IL, IH, OL, OH,
                                DM, ZN, PR, CC, TP
       );

       // ограничение выхода, %
       if (AOT050__OV <  OL+AOT050_LOV){ AOT050__OV=OL+AOT050_LOV; }
       if (AOT050__OV >  OH-AOT050_HOV){ AOT050__OV=OH-AOT050_HOV; }
       if (AOT050__MV >= 0){ AOT050__OV=100-AOT050__OV; }
       //--------------------------------------------------------------------
       // дискретный регулятор
       AOT050__UV=RegulDigit(RN,AOT050_LPV,AOT050_HPV,AOT050__MV,AOT050__RV,AOT050__UM);
       //--------------------------------------------------------------------
       if(AOT050__MV< 0){
          if((AOT050__ZV-AIT050___V)*AOT050__PV>0){
              if(AOT050__UV==RPLUS){
                 AOT050__UV=RMINUS;
              } else {
                 if(AOT050__UV==RMINUS){ AOT050__UV=RPLUS; }
              }
          }
       }
       //--------------------------------------------------------------------
       // если сработан концевик крайнего положения клапана - 
       // снять выходной сигнал на привод управления клапаном в сторону сработанного концевика 
       if(DIS064PC_V==ON && AOT050__UV==RMINUS) AOT050__UV=RSTOP;
       if(DIS064PO_V==ON && AOT050__UV==RPLUS ) AOT050__UV=RSTOP;
       //--------------------------------------------------------------------
       // установить выход на клапана в зависимости от выхода регулятора
       if(AOT050__UV==RPLUS ){ DON064PO_V=1; DON064PC_V=0; }
       if(AOT050__UV==RMINUS){ DON064PO_V=0; DON064PC_V=1; }
       if(AOT050__UV==RSTOP ){ DON064PO_V=0; DON064PC_V=0; }
       // сбросить ручной выход в неопределенное состояние
       AOT050__UM= RNA;
       // рассогласование выхода регулятора
       AOT050__XV= OutX[RN];
       // другие парамметры дискретного регулятора для отладки
       AOT050_CPV= ImpLC[RN];
       AOT050_CWV= ImpWC[RN];
       //--------------------------------------------------------------------
    }
    return;
}
//---------------------------------------------------------------------------
