// coding=cp866; version=2013013112; title="";
//---------------------------------------------------------------------------
// Действия выполняемые после прохода всех регуляторов

#include "..\_libpath.inc"
#include "..\prg\run_prgv.h"

#include "regul_e.h"

//---------------------------------------------------------------------------
vd  far Regul_55(vd){

    // насос конденсата работает параллельно клапану конденсата
    DON092N__V=DON092K__V;


    return;
}
//---------------------------------------------------------------------------
