//---------------------------------------------------------------------------
vd  far EveryCyc(vd){
    // читать ответы от модулей УСО
    if(RunLocal>0){ ReadANS(COMU1); }
    if(RunLocal>0){ ReadANS(COMU2); }
    // если нет связи по сети NetBIOS - включаем связь по COM порту
    if(RunLocal>0&&NBLiveTO_V>50){ ReadANS(COMWS); }
    // послать комманды запросов на модули УСО
#ifndef TESTVAGI
    if(BusyTer==0){ SendCMD(COMU1); }
    if(BusyTer==0){ SendCMD(COMU2); }
#endif
    return;
}
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
vd  far First_in_Cycle(vd){
    if (NBStat>0){
        WS_NB__NetChange();
    }
    return;
}
//---------------------------------------------------------------------------
vd  far Last__in_Cycle(vd){
    return;
}
//---------------------------------------------------------------------------
