//----------------------------------------------------------------------------
//  Получить значения с аналоговых модулей (i7033)
vd  far InpDataS(vd){
    _i rec=0;

    #include "mod\ai\c1n01r00.c"
    #include "mod\ai\c1n02r01.c"

    // фильтрация сигналов
    DIL140___V = BFiltr( 0, DIL140___L, 4 );
    DIL170___V = BFiltr( 1, DIL170___L, 4 );
    DIL200___V = BFiltr( 2, DIL200___L, 4 );
    DIL210___V = BFiltr( 3, DIL210___L, 4 );
    DIL220___V = BFiltr( 4, DIL220___L, 4 );
    DIL060___V = BFiltr( 5, DIL060___L, 4 );
    DIL270___V = BFiltr( 8, DIL270___L, 4 );
    DIL280___V = BFiltr( 9, DIL280___L, 4 );
    DIL300___V = BFiltr(10, DIL300___L, 4 );
    DIM200___V = BFiltr(11, DIM200___L, 4 );

    DIH140___V = BFiltr(12, DIH140___L, 4 );
    DIH170___V = BFiltr(13, DIH170___L, 4 );
    DIH210___V = BFiltr(14, DIH210___L, 4 );
    DIH220___V = BFiltr(15, DIH220___L, 4 );
    DIH270___V = BFiltr(17, DIH270___L, 4 );
    DIH280___V = BFiltr(18, DIH280___L, 4 );
    DIH300___V = BFiltr(19, DIH300___L, 4 );

    return;
}
//----------------------------------------------------------------------------


//----------------------------------------------------------------------------
//  Получить значения с аналоговых модулей (ТП-001)
vd  far InpDataA(vd){
    _i rec=0;

    #include "mod\ai\c2n01r00.c"

    return;
}
//----------------------------------------------------------------------------
