#define  SystemAU01  DBB[  12]   // 
#define  SystemAU02  DBB[  13]   // 
#define  CurMESSAGE  DBB[  14]   // Номер текущего сообщения
#define  DateCompil  DBB[  15]   // Дата  компиляции
#define  TimeCompil  DBB[  16]   // Время компиляции
#define  NetLive__V  DBB[  17]   // Состояние сети
#define  TickLoop_V  DBB[  18]   // Количество пустых циклов за тик
#define  SecnLoop_V  DBB[  19]   // Количество пустых циклов за секунду
#define  ErrBell__V  DBB[  20]   // Флаг ошибки программы CS
#define  ErrBell__M  DBB[  21]   // Снятие сигнала ошибки программы CS
#define  DebugFlagV  DBB[  22]   // Режим отладки
#define  ExitFlag_M  DBB[  23]   // Флаг выхода из программы CS
#define  WriteDataM  DBB[  24]   // Флаг записи данных программы CS
#define  SCNT_____V  DBB[  25]   // Секунды работы PCCS
#define  HCNT_____V  DBB[  26]   // Часы работы PCCS
#define  ALARM____V  DBB[  27]   // Флаг вывода сообщений
#define  ALARM____M  DBB[  27]   // Флаг вывода сообщений
#define  CPLive___M  DBB[  29]   // Флаг работы сети COM пота
#define  NBLive___M  DBB[  30]   // Флаг работы сети NetBIOS
#define  CPLive___V  DBB[  31]   // Флаг работы сети COM пота
#define  NBLive___V  DBB[  32]   // Флаг работы сети NetBIOS
#define  TimeCSS__M  DBB[  41]   // Время: секунды контроллера
#define  TimeCSS__V  DBB[  42]   // Время: секунды контроллера
#define  TimeCSM__M  DBB[  43]   // Время: минуты контроллера
#define  TimeCSM__V  DBB[  44]   // Время: минуты контроллера
#define  TimeCSH__M  DBB[  45]   // Время: часы контроллера
#define  TimeCSH__V  DBB[  46]   // Время: часы контроллера
#define  DateCSD__M  DBB[  47]   // Дата: день контроллера
#define  DateCSD__V  DBB[  48]   // Дата: день контроллера
#define  DateCSM__M  DBB[  49]   // Дата: месяц контроллера
#define  DateCSM__V  DBB[  50]   // Дата: месяц контроллера
#define  DateCSY__M  DBB[  51]   // Дата: год контроллера
#define  DateCSY__V  DBB[  52]   // Дата: год контроллера
#define  TMDTSet__M  DBB[  53]   // Флаг  установки времени и даты
#define  DAWC  DBB[  54]   // Текущий день недели контроллера
#define  CPLiveTO_V  DBB[  55]   // Таймаут работы сети по COM порту
#define  NBLiveTO_V  DBB[  56]   // Таймаут работы сети по NetBIOS
#define  COM1HSMD_M  DBB[  60]   // Количество секунд для подсчета состояния модулей
#define  COM1HSMD_V  DBB[  61]   // Количество секунд для подсчета состояния модулей
#define  COM2HSMD_M  DBB[  62]   // Количество секунд для подсчета состояния модулей
#define  COM2HSMD_V  DBB[  63]   // Количество секунд для подсчета состояния модулей
#define  COM1OK01_V  DBB[  70]   // Количество правильных ответов модуля N01
#define  COM1OK02_V  DBB[  71]   // Количество правильных ответов модуля N02
#define  COM1OK03_V  DBB[  72]   // Количество правильных ответов модуля N03
#define  COM1OK04_V  DBB[  73]   // Количество правильных ответов модуля N04
#define  COM1OK05_V  DBB[  74]   // Количество правильных ответов модуля N05
#define  COM1OK06_V  DBB[  75]   // Количество правильных ответов модуля N06
#define  COM1OK07_V  DBB[  76]   // Количество правильных ответов модуля N07
#define  COM1OK08_V  DBB[  77]   // Количество правильных ответов модуля N08
#define  COM1OK09_V  DBB[  78]   // Количество правильных ответов модуля N09
#define  COM1OK0A_V  DBB[  79]   // Количество правильных ответов модуля N0A
#define  COM1OK0B_V  DBB[  80]   // Количество правильных ответов модуля N0B
#define  COM1OK0C_V  DBB[  81]   // Количество правильных ответов модуля N0C
#define  COM1OK0D_V  DBB[  82]   // Количество правильных ответов модуля N0D
#define  COM1OK0E_V  DBB[  83]   // Количество правильных ответов модуля N0E
#define  COM1OK0F_V  DBB[  84]   // Количество правильных ответов модуля N0F
#define  COM1OK10_V  DBB[  85]   // Количество правильных ответов модуля N10
#define  COM1OK11_V  DBB[  86]   // Количество правильных ответов модуля N11
#define  COM1OK12_V  DBB[  87]   // Количество правильных ответов модуля N12
#define  COM1OK13_V  DBB[  88]   // Количество правильных ответов модуля N13
#define  COM1OK14_V  DBB[  89]   // Количество правильных ответов модуля N14
#define  COM1OK15_V  DBB[  90]   // Количество правильных ответов модуля N15
#define  COM1OK16_V  DBB[  91]   // Количество правильных ответов модуля N16
#define  COM2OK01_V  DBB[  92]   // Количество правильных ответов модуля TP1 N1
#define  COM2OK02_V  DBB[  93]   // Количество правильных ответов модуля TP1 N2
#define  COM2OK03_V  DBB[  94]   // Количество правильных ответов модуля TP1 N3
#define  ch0095___v  DBB[  95]   //  
#define  COM1ER01_V  DBB[ 100]   // Количество ошибочных ответов модуля N01
#define  COM1ER02_V  DBB[ 101]   // Количество ошибочных ответов модуля N02
#define  COM1ER03_V  DBB[ 102]   // Количество ошибочных ответов модуля N03
#define  COM1ER04_V  DBB[ 103]   // Количество ошибочных ответов модуля N04
#define  COM1ER05_V  DBB[ 104]   // Количество ошибочных ответов модуля N05
#define  COM1ER06_V  DBB[ 105]   // Количество ошибочных ответов модуля N06
#define  COM1ER07_V  DBB[ 106]   // Количество ошибочных ответов модуля N07
#define  COM1ER08_V  DBB[ 107]   // Количество ошибочных ответов модуля N08
#define  COM1ER09_V  DBB[ 108]   // Количество ошибочных ответов модуля N09
#define  COM1ER0A_V  DBB[ 109]   // Количество ошибочных ответов модуля N0A
#define  COM1ER0B_V  DBB[ 110]   // Количество ошибочных ответов модуля N0B
#define  COM1ER0C_V  DBB[ 111]   // Количество ошибочных ответов модуля N0C
#define  COM1ER0D_V  DBB[ 112]   // Количество ошибочных ответов модуля N0D
#define  COM1ER0E_V  DBB[ 113]   // Количество ошибочных ответов модуля N0E
#define  COM1ER0F_V  DBB[ 114]   // Количество ошибочных ответов модуля N0F
#define  COM1ER10_V  DBB[ 115]   // Количество ошибочных ответов модуля N10
#define  COM1ER11_V  DBB[ 116]   // Количество ошибочных ответов модуля N11
#define  COM1ER12_V  DBB[ 117]   // Количество ошибочных ответов модуля N12
#define  COM1ER13_V  DBB[ 118]   // Количество ошибочных ответов модуля N13
#define  COM1ER14_V  DBB[ 119]   // Количество ошибочных ответов модуля N14
#define  COM1ER15_V  DBB[ 120]   // Количество ошибочных ответов модуля N15
#define  COM1ER16_V  DBB[ 121]   // Количество ошибочных ответов модуля N16
#define  COM2ER01_V  DBB[ 122]   // Количество ошибочных ответов модуля TP1 N1
#define  COM2ER02_V  DBB[ 123]   // Количество ошибочных ответов модуля TP1 N2
#define  COM2ER03_V  DBB[ 124]   // Количество ошибочных ответов модуля TP1 N3
#define  ch0125___v  DBB[ 125]   // 
#define  COM2ER01FL  DBB[ 141]   // Флаг ошибки работы прибора дозатора сухого
#define  COM2ER02FL  DBB[ 142]   // Флаг ошибки работы прибора дозатора мокрого
#define  COM2ER03FL  DBB[ 143]   // Флаг ошибки работы прибора дозатора пасты
#define  DZT01ON__M  DBB[ 151]   // Флаг включ прибора дозатора TP1 N1 в оч опроса
#define  DZT01ON__V  DBB[ 152]   // Флаг включ прибора дозатора TP1 N1 в оч опроса
#define  DZT02ON__M  DBB[ 153]   // Флаг включ прибора дозатора TP1 N2 в оч опроса
#define  DZT02ON__V  DBB[ 154]   // Флаг включ прибора дозатора TP1 N2 в оч опроса
#define  DZT03ON__M  DBB[ 155]   // Флаг включ прибора дозатора TP1 N3 в оч опроса
#define  DZT03ON__V  DBB[ 156]   // Флаг включ прибора дозатора TP1 N3 в оч опроса
#define  DZT04ON__M  DBB[ 157]   // Флаг включ прибора дозатора TP1 N4 в оч опроса
#define  DZT04ON__V  DBB[ 158]   // Флаг включ прибора дозатора TP1 N4 в оч опроса
#define  AIT050___V  DBB[ 200]   // Температура в бассейне шлама N1
#define  AIT040___V  DBB[ 201]   // Температура в бассейне шлама N2
#define  AIT030___V  DBB[ 202]   // Температура в бассейне шлама N3
#define  AIT220___V  DBB[ 203]   // Температура в бункере шлама
#define  AIT270___V  DBB[ 204]   // Температура в емкости вода-ПАВ
#define  AIT200___V  DBB[ 205]   // Температура на выходе сборника воды
#define  AIX0300__V  DBB[ 206]   // Резерв AIX0300
#define  AIW290___V  DBB[ 207]   // Вес дозатора пасты
#define  AIW230___V  DBB[ 208]   // Вес дозатора мокрого
#define  AIW190___V  DBB[ 209]   // Вес дозатора сухого
#define  AIX0304__V  DBB[ 210]   // Резерв AIX0304
#define  AIX0305__V  DBB[ 211]   // Резерв AIX0305
#define  AIX0306__V  DBB[ 212]   // Резерв AIX0306
#define  AIX0307__V  DBB[ 213]   // Резерв AIX0307
#define  DIH050___V  DBB[ 214]   // Верхний уровень в бассейне шлама N1
#define  DIL050___V  DBB[ 215]   // Нижний уровень в бассейне шлама N1
#define  DIS050___V  DBB[ 216]   // Состояние привода мешалки бассейна шлама N1
#define  DIH020___V  DBB[ 217]   // Уровень пн.насоса бассейна шлама N1
#define  DIS051___V  DBB[ 218]   // Сост клапана выгрузки шлама из бассейна шлама N1
#define  DIX0405__V  DBB[ 219]   // Резерв DIX0405
#define  DIR051___V  DBB[ 220]   // Сост ключа Р/А клапана выгрузки шлама из бассейна шлама N1
#define  DIR020___V  DBB[ 221]   // Сост ключа Р/А управления бассейном шлама N1
#define  DIS052___V  DBB[ 222]   // Сост пн.клапана выгрузки шлама из бассейна шлама N1
#define  DIS022___V  DBB[ 223]   // Сост пн.клапана выгрузки перед пн.насосом бассейна шлама N1
#define  DIS021___V  DBB[ 224]   // Сост пн.клапана подачи воздуха в пн.насос бассейна шлама N1
#define  DIS203___V  DBB[ 225]   // Сост клапана дозировки воды ТОЧНО
#define  DIS223___V  DBB[ 226]   // Сост клапана дозировки шлама ТОЧНО
#define  DIX0413__V  DBB[ 227]   // Резерв DIX0413
#define  DIH040___V  DBB[ 228]   // Верхний уровень в бассейне шлама N2
#define  DIL040___V  DBB[ 229]   // Нижний уровень в бассейне шлама N2
#define  DIS040___V  DBB[ 230]   // Состояние привода мешалки бассейна шлама N2
#define  DIH010___V  DBB[ 231]   // Уровень пн.насоса бассейна шлама N2,3
#define  DIS041___V  DBB[ 232]   // Сост клапана выгрузки шлама из бассейна шлама N2
#define  DIX0505__V  DBB[ 233]   // Резерв DIX0505
#define  DIR041___V  DBB[ 234]   // Сост ключа Р/А клапана выгрузки шлама из бассейна шлама N2
#define  DIR010___V  DBB[ 235]   // Сост ключа Р/А управления бассейном шлама N2
#define  DIS042___V  DBB[ 236]   // Сост пн.клапана выгрузки шлама из бассейна шлама N2
#define  DIS012___V  DBB[ 237]   // Сост пн.клапана выгрузки перед пн.насосом бассейна шлама N2,3
#define  DIS011___V  DBB[ 238]   // Сост пн.клапана подачи воздуха в пн.насос бассейна шлама N2,3
#define  DIX0511__V  DBB[ 239]   // Резерв DIX0511
#define  DIX0512__V  DBB[ 240]   // Резерв DIX0512
#define  DIX0513__V  DBB[ 241]   // Резерв DIX0513
#define  DIH030___V  DBB[ 242]   // Верхний уровень в бассейне шлама N3
#define  DIL030___V  DBB[ 243]   // Нижний уровень в бассейне шлама N3
#define  DIS030___V  DBB[ 244]   // Состояние привода мешалки бассейна шлама N3
#define  DIS031___V  DBB[ 245]   // Сост клапана выгрузки шлама из бассейна шлама N3
#define  DIX0604__V  DBB[ 246]   // Резерв DIX0604
#define  DIR031___V  DBB[ 247]   // Сост ключа Р/А клапана выгрузки шлама из бассейна шлама N3
#define  DIS032___V  DBB[ 248]   // Сост пн.клапана выгрузки шлама из бассейна шлама N3
#define  DIX0607__V  DBB[ 249]   // Резерв DIX0607
#define  DIX0608__V  DBB[ 250]   // Резерв DIX0608
#define  DIX0609__V  DBB[ 251]   // Резерв DIX0609
#define  DIS091___V  DBB[ 252]   // Сост кнопки от оператора склада цемента
#define  DIR100___V  DBB[ 253]   // Сост ключа Р/А управления складом цемента
#define  DIH100___V  DBB[ 254]   // Уровень пн.насоса склада цемента
#define  DIS101___V  DBB[ 255]   // Сост пн.клапана подачи воздуха в пн.насос склада цемента
#define  DIS102___V  DBB[ 256]   // Сост пн.клапана загрузки цемента в пн.насос склада цемента
#define  DIR170___V  DBB[ 257]   // Сост ключа Р/А управления бункером цемента
#define  DIH170___V  DBB[ 258]   // Верхний уровень бункера цемента
#define  DIL170___V  DBB[ 259]   // Нижний уровень бункера цемента
#define  DIS180___V  DBB[ 260]   // Сост шнека после бункера цемента
#define  DIS171___V  DBB[ 261]   // Сост пн.клапана подачи воздуха в бункер цемента
#define  DIS172___V  DBB[ 262]   // Сост пн.клапана подачи цемента из бункера цемента в шнек
#define  DIS181___V  DBB[ 263]   // Сост пн.клапана дозировки цемента ГРУБО
#define  DIS182___V  DBB[ 264]   // Сост пн.клапана дозировки цемента ТОЧНО
#define  DIR160___V  DBB[ 265]   // Сост ключа шнека аспирации цемента
#define  DIS162___V  DBB[ 266]   // Сост шнека аспирации цемента
#define  DIS161___V  DBB[ 267]   // Сост вентилятора аспирации цемента
#define  DIS173___V  DBB[ 268]   // Сост вибратора бункера цемента
#define  DIR161___V  DBB[ 269]   // Сост ключа вентилятора аспирации цемента
#define  DIR140___V  DBB[ 270]   // Сост ключа Р/А управления бункером вяжущего
#define  DIH140___V  DBB[ 271]   // Верхний уровень бункера вяжущего
#define  DIL140___V  DBB[ 272]   // Нижний уровень бункера вяжущего
#define  DIS150___V  DBB[ 273]   // Сост шнека после бункера вяжущего
#define  DIS141___V  DBB[ 274]   // Сост пн.клапана подачи воздуха в бункер вяжущего
#define  DIS142___V  DBB[ 275]   // Сост пн.клапана подачи вяжущего из бункера вящего на шнек
#define  DIS151___V  DBB[ 276]   // Сост пн.клапана дозировки вяжущего ГРУБО
#define  DIS152___V  DBB[ 277]   // Сост пн.клапана дозировки вяжущего ТОЧНО
#define  DIR130___V  DBB[ 278]   // Сост ключа шнека аспирации вяжущего
#define  DIS132___V  DBB[ 279]   // Сост шнека аспирации вяжущего
#define  DIS131___V  DBB[ 280]   // Сост вентилятора аспирации вяжущего
#define  DIS143___V  DBB[ 281]   // Сост вибратора бункера вяжущего
#define  DIR131___V  DBB[ 282]   // Сост ключа вентилятора аспирации вяжущего
#define  DIX0813__V  DBB[ 283]   // Резерв DIX0813
#define  DIH060___V  DBB[ 284]   // Верхний уровень в сборнике конденсата
#define  DIL060___V  DBB[ 285]   // Нижний уровень в сборнике конденсата
#define  DIS061___V  DBB[ 286]   // Сост насоса подачи конденсата
#define  DIR061___V  DBB[ 287]   // Сост ключа Р/А управления насосом конденсата
#define  DIR200___V  DBB[ 288]   // Сост ключа Р/А управления сборником воды
#define  DIH200___V  DBB[ 289]   // Верхний уровень в сборнике воды
#define  DIM200___V  DBB[ 290]   // Средний уровень в сборнике воды
#define  DIL200___V  DBB[ 291]   // Нижний уровень в сборнике воды
#define  DIS202___V  DBB[ 292]   // Сост пн.клапана подачи воды со сборника в дозатор мокрого
#define  DIS201___V  DBB[ 293]   // Сост пн.клапана подачи тех.воды в сборник воды
#define  DIS232___V  DBB[ 294]   // Сост пн.клапана подачи промывочной воды в дозатор мокрого
#define  DIR230___V  DBB[ 295]   // Сост ключа Р/А управления дозатором мокрого
#define  DIR190___V  DBB[ 296]   // Сост ключа Р/А управления дозатором сухого
#define  DIS501___V  DBB[ 297]   // Наличие напряжения 24В для реле
#define  DIR210___V  DBB[ 298]   // Сост ключа Р/А управления мешалкой отходов
#define  DIH210___V  DBB[ 299]   // Верхний уровень мешалки отходов
#define  DIL210___V  DBB[ 300]   // Нижний уровень мешалки отходов
#define  DIS210___V  DBB[ 301]   // Сост привода мешалки отходов
#define  DIS211___V  DBB[ 302]   // Сост пн.клапана дозировки отходов ВЕРХНИЙ
#define  DIS212___V  DBB[ 303]   // Сост пн.клапана дозировки отходов НИЖНИЙ
#define  DIS071___V  DBB[ 304]   // Сост пн.клапана подачи воды в мешалку отходов РК
#define  DIH070___V  DBB[ 305]   // Верхний уровень в мешалке отходов РК
#define  DIS070___V  DBB[ 306]   // Сост привода мешалки отходов РК
#define  DIH080___V  DBB[ 307]   // Уровень пн.насоса мешалки отходов РК
#define  DIS082___V  DBB[ 308]   // Сост пн.клапана подачи воздуха в насос мешалки отходов РК
#define  DIS081___V  DBB[ 309]   // Сост пн.клапана подачи отходов из мешалки отходов РК в насос
#define  DIR070___V  DBB[ 310]   // Сост ключа управления мешалкой отходов РК
#define  DIS275___V  DBB[ 320]   // Сигнал от оператора ПАВ
#define  DIR110___V  DBB[ 321]   // Сост ключа Р/А управления гомогенизатором N1
#define  DIR120___V  DBB[ 322]   // Сост ключа Р/А управления гомогенизатором N2
#define  DIH110___V  DBB[ 323]   // Верхний уровень гомогенизатора N1
#define  DIL110___V  DBB[ 324]   // Нижний уровень гомогенизатора N1
#define  DIH120___V  DBB[ 325]   // Верхний уровень гомогенизатора N2
#define  DIL120___V  DBB[ 326]   // Нижний уровень гомогенизатора N2
#define  DIS111___V  DBB[ 327]   // Сост пн.клапана подачи воздуха в гомогенизатор N1 на подрыв
#define  DIS112___V  DBB[ 328]   // Сост пн.клапана подачи воздуха на инжектор гомогенизатора N1
#define  DIS121___V  DBB[ 329]   // Сост пн.клапана подачи воздуха в гомогенизатор N2 на подрыв
#define  DIS122___V  DBB[ 330]   // Сост пн.клапана подачи воздуха на инжектор гомогенизатора N2
#define  DIR220___V  DBB[ 331]   // Сост ключа Р/А управления мешалкой шлама
#define  DIS220___V  DBB[ 332]   // Сост привода мешалки шлама
#define  DIH220___V  DBB[ 333]   // Верхний уровень мешалки шлама
#define  DIL220___V  DBB[ 334]   // Нижний уровень мешалки шлама
#define  DIS221___V  DBB[ 335]   // Сост пн.клапана дозировки шлама ВЕРХНИЙ
#define  DIS222___V  DBB[ 336]   // Сост пн.клапана дозировки шлама НИЖНИЙ
#define  DIR270___V  DBB[ 337]   // Сост ключа Р/А управления емкости вода-ПАВ
#define  DIH270___V  DBB[ 338]   // Верхний уровень емкости вода-ПАВ
#define  DIL270___V  DBB[ 339]   // Нижний уровень емкости вода-ПАВ
#define  DIR273___V  DBB[ 340]   // Сост ключа Р/А управления подачей пара в емкость вода-ПАВ
#define  DIS272___V  DBB[ 341]   // Сост пн.клапана подачи воды в емкость вода-ПАВ
#define  DIX0C07__V  DBB[ 342]   // Резерв DIX0C07
#define  DIS274___V  DBB[ 343]   // Сост пн.клапана подачи ПАВ в мешалку суспензии ал.пасты
#define  DIX0C09__V  DBB[ 344]   // Резерв DIX0C09
#define  DIR290___V  DBB[ 345]   // Сост ключа Р/А управления дозатором ал.пасты
#define  DIX0C11__V  DBB[ 346]   // Резерв DIX0C11
#define  DIX0C12__V  DBB[ 347]   // Резерв DIX0C12
#define  DIX0C13__V  DBB[ 348]   // Резерв DIX0C13
#define  DIX0D00__V  DBB[ 349]   // Резерв DIX0D00
#define  DIX0D01__V  DBB[ 350]   // Резерв DIX0D01
#define  DIS286___V  DBB[ 351]   // Сост клапана подачи ал.пасты в дозатор
#define  DIH285___V  DBB[ 352]   // Верхний уровень промежуточной емкости ал.пасты
#define  DIX0D04__V  DBB[ 353]   // Резерв DIX0D04
#define  DIX0D05__V  DBB[ 354]   // Резерв DIX0D05
#define  DIS285___V  DBB[ 355]   // Сост мешалки промежуточной емкости ал.пасты
#define  DIX0D07__V  DBB[ 356]   // Резерв DIX0D07
#define  DIX0D08__V  DBB[ 357]   // Резерв DIX0D08
#define  DIX0D09__V  DBB[ 358]   // Резерв DIX0D09
#define  DIR300___V  DBB[ 359]   // Сост ключа Р/А управления мешалкой N1 суспензии ал.пасты
#define  DIH300___V  DBB[ 360]   // Верхний уровень нижней мешалки суспензии ал.пасты
#define  DIL300___V  DBB[ 361]   // Нижний уровень нижней мешалки суспензии ал.пасты
#define  DIS301___V  DBB[ 362]   // Сост насоса нижней мешалки суспензии ал.пасты
#define  DIS300___V  DBB[ 363]   // Сост привода нижней мешалки суспензии ал.пасты
#define  DIR280___V  DBB[ 364]   // Сост ключа Р/А управления верхней мешалкой суспензии ал.пасты
#define  DIH280___V  DBB[ 365]   // Верхний уровень верхней мешалки суспензии ал.пасты
#define  DIL280___V  DBB[ 366]   // Нижний уровень верхней мешалки суспензии ал.пасты
#define  DIS281___V  DBB[ 367]   // Сост пн.клапана загрузки в пром.емкость ал.пасты
#define  DIS291___V  DBB[ 368]   // Сост пн.клапана выгрузки из дозатора ал.пасты
#define  DIS193___V  DBB[ 369]   // Сост пн.клапана выгрузки из дозатора сухого
#define  DIS231___V  DBB[ 370]   // Сост пн.клапана выгрузки из дозатора мокрого
#define  DIS192___V  DBB[ 371]   // Сост вентилятора аспирации выгрузки сухого
#define  DIS191___V  DBB[ 372]   // Сост вибратора выгрузки из дозатора сухого
#define  DIS701___V  DBB[ 373]   // Сост кнопки включения загрузки-выгрузки
#define  DIS280___V  DBB[ 374]   // Сост привода верхней мешалки суспензии ал.пасты
#define  DIS302___V  DBB[ 375]   // Сигнал от оператора мешалки суспензии ал.пасты ниж.
#define  DIA285___V  DBB[ 376]   // Верхний аварийный уровень миксера ал.пасты
#define  DIR310___V  DBB[ 377]   // Сост ключа Р/А управления ВГБМ
#define  DIS310___V  DBB[ 378]   // Сост привода ВГБМ
#define  DIS315___V  DBB[ 379]   // Сост положения ВГБМ под загрузкой
#define  DIS318___V  DBB[ 380]   // Сост привода N1 передвижения ВГБМ
#define  DIS319___V  DBB[ 381]   // Сост привода N2 передвижения ВГБМ
#define  DIS31A___V  DBB[ 382]   // Состояние герметизатора ВГБМ
#define  DIS320___V  DBB[ 383]   // Сост ударного стола
#define  DIS311___V  DBB[ 384]   // Сост вибратора N1 ВГБМ
#define  DIS312___V  DBB[ 385]   // Сост вибратора N2 ВГБМ
#define  DIS313___V  DBB[ 386]   // Сост вибратора N3 ВГБМ
#define  DIS314___V  DBB[ 387]   // Сост вибратора N4 ВГБМ
#define  DIS316___V  DBB[ 388]   // Сост пн.клапана N1 слива массы из ВГБМ
#define  DIS317___V  DBB[ 389]   // Сост пн.клапана N2 слива массы из ВГБМ
#define  DIS702___V  DBB[ 390]   // Сост кнопки снятия звуковой сигнализации
#define  DON053O__V  DBB[ 391]   // Эл.клапан подачи пара в бассейн шлама N1 - Откр
#define  DON053C__V  DBB[ 392]   // Эл.клапан подачи пара в бассейн шлама N1 - Закр
#define  DON043O__V  DBB[ 393]   // Эл.клапан подачи пара в бассейн шлама N2 - Откр
#define  DON043C__V  DBB[ 394]   // Эл.клапан подачи пара в бассейн шлама N2 - Закр
#define  DON033O__V  DBB[ 395]   // Эл.клапан подачи пара в бассейн шлама N3 - Откр
#define  DON033C__V  DBB[ 396]   // Эл.клапан подачи пара в бассейн шлама N3 - Закр
#define  DON021___V  DBB[ 397]   // Пн.клапан подачи воздуха в насос шлама N1
#define  DON011___V  DBB[ 398]   // Пн.клапан подачи воздуха в насос шлама N2,3
#define  DON052___V  DBB[ 399]   // Пн.клапан выгрузки шлама из бассейна шлама N1
#define  DON051___V  DBB[ 400]   // Клапан выгрузки шлама из бассейна шлама N1
#define  DOX1010__V  DBB[ 401]   // Резерв DOX1010
#define  DON022___V  DBB[ 402]   // Пн.клапан загрузки насоса бассейна шлама N1
#define  DON042___V  DBB[ 403]   // Пн.клапан выгрузки шлама из бассейна шлама N2
#define  DON041___V  DBB[ 404]   // Клапан выгрузки шлама из бассейна шлама N2
#define  DOX1101__V  DBB[ 405]   // Резерв DOX1101
#define  DON032___V  DBB[ 406]   // Пн.клапан выгрузки шлама из бассейна шлама N3
#define  DON031___V  DBB[ 407]   // Клапан выгрузки шлама из бассейна шлама N3
#define  DOX1104__V  DBB[ 408]   // Резерв DOX1104
#define  DON012___V  DBB[ 409]   // Пн.клапан загрузки в насос бассейна шлама N2,3
#define  DON221___V  DBB[ 410]   // Пн.клапан дозировки шлама ВЕРХНИЙ
#define  DON222___V  DBB[ 411]   // Пн.клапан дозировки шлама НИЖНИЙ
#define  DON061___V  DBB[ 412]   // Включение насоса сборника конденсата
#define  DON202___V  DBB[ 413]   // Пн.клапан подачи воды в дозатор мокрого
#define  DON201___V  DBB[ 414]   // Пн.клапан подачи технической воды в сборник воды
#define  DON232___V  DBB[ 415]   // Пн.клапан подачи промывочной воды в дозатор мокрого
#define  DON101___V  DBB[ 416]   // Пн.клапан подачи воздуха на насос склада цемента
#define  DON172___V  DBB[ 417]   // Пн.клапан подачи цемента из бункера цемента на шнек
#define  DON181___V  DBB[ 418]   // Пн.клапан дозировки цемента ГРУБО
#define  DON182___V  DBB[ 419]   // Пн.клапан дозировки цемента ТОЧНО
#define  DON162___V  DBB[ 420]   // Шнек аспирации цемента
#define  DON180___V  DBB[ 421]   // Шнек подачи цемента после бункера цемента
#define  DON150___V  DBB[ 422]   // Шнек подачи вяжущего после бункера вяжущего
#define  DON151___V  DBB[ 423]   // Пн.клапан дозировки вяжущего ГРУБО
#define  DON152___V  DBB[ 424]   // Пн.клапан дозировки вяжущего ТОЧНО
#define  DON132___V  DBB[ 425]   // Шнек аспирации вяжущего
#define  DON211___V  DBB[ 426]   // Пн.клапан дозировки отходов ВЕРХНИЙ
#define  DON212___V  DBB[ 427]   // Пн.клапан дозировки отходов НИЖНИЙ
#define  DOX1211__V  DBB[ 428]   // Резерв DOX1211
#define  DON281___V  DBB[ 429]   // Пн.клапан загрузки в пром.емкость ал.пасты
#define  DON102___V  DBB[ 430]   // Пн.клапан подачи цемента в насос склада цемента
#define  DON161___V  DBB[ 431]   // Вентилятор аспирации цемента
#define  DON171___V  DBB[ 432]   // Пн.клапан подачи воздуха в бункер цемента
#define  DON131___V  DBB[ 433]   // Вентилятор аспирации вяжущего
#define  DON141___V  DBB[ 434]   // Пн.клапан подачи воздуха в бункер вяжущего
#define  DON142___V  DBB[ 435]   // Пн.клапан подачи вяжущего из бункера вяжущего на шнек
#define  DON071___V  DBB[ 436]   // Пн.клапан подачи воды в мешалку отходов РК
#define  DON082___V  DBB[ 437]   // Пн.клапан подачи воздуха в насос мешалки отходов РК
#define  DON081___V  DBB[ 438]   // Пн.клапан подачи отходов из мешалки отходов РК в пн.насос
#define  DON111___V  DBB[ 439]   // Пн.клапан подачи воздуха на подрыв гомогенизатора N1
#define  DON112___V  DBB[ 440]   // Пн.клапан подачи воздуха на инжектор гомогенизатора N1
#define  DON121___V  DBB[ 441]   // Пн.клапан подачи воздуха на подрыв гомогенизатора N2
#define  DON122___V  DBB[ 442]   // Пн.клапан подачи воздуха на инжектор гомогенизатора N2
#define  DON273O__V  DBB[ 443]   // Эл.клапан подачи пара в емкость вода-ПАВ - Откр
#define  DON273C__V  DBB[ 444]   // Эл.клапан подачи пара в емкость вода-ПАВ - Закр
#define  DON272___V  DBB[ 445]   // Пн.клапан подачи воды в емкость вода-ПАВ
#define  DOX1403__V  DBB[ 446]   // Резерв DOX1403
#define  DON274___V  DBB[ 447]   // Пн.клапан подачи ПАВ в мешалку суспензии ал.пасты
#define  DON285___V  DBB[ 448]   // Мешалка миксера ал.пасты
#define  DON286___V  DBB[ 449]   // Пн.клапан загрузки ал.пасты в дозатор ал.пасты
#define  DOX1407__V  DBB[ 450]   // Резерв DOX1407
#define  DOX1408__V  DBB[ 451]   // Резерв DOX1408 
#define  DON301___V  DBB[ 452]   // Включение насоса после мешалки суспензии ал.пасты
#define  DON291___V  DBB[ 453]   // Пн.клапан выгрузки из дозатора суспензии ал.пасты
#define  DON193___V  DBB[ 454]   // Пн.клапан выгрузки из дозатора сухого
#define  DON231___V  DBB[ 455]   // Пн.клапан выгрузки из дозатора мокрого
#define  DON316___V  DBB[ 456]   // Пн.клапан N1 слива массы из ВГБМ
#define  DON317___V  DBB[ 457]   // Пн.клапан N2 слива массы из ВГБМ
#define  DON31A___V  DBB[ 458]   // Герметизатор ВГБМ
#define  DON310___V  DBB[ 459]   // Включение ВГБМ
#define  DON192___V  DBB[ 460]   // Аспирация выгрузки сухого
#define  DON191___V  DBB[ 461]   // Вибратор выгрузки сухого
#define  DON143___V  DBB[ 462]   // Вибратор бункера вяжущего
#define  DON173___V  DBB[ 463]   // Вибратор бункера цемента
#define  DON311___V  DBB[ 464]   // Вибраторы ВГБМ
#define  DON801___V  DBB[ 465]   // Лампочка дозатора сухого
#define  DON802___V  DBB[ 466]   // Лампочка дозатора мокрого
#define  DON803___V  DBB[ 467]   // Лампочка дозатора пасты
#define  DON091___V  DBB[ 468]   // Сигнал на склад цемента
#define  DON203___V  DBB[ 469]   // Управление клапаном дозировки воды ТОЧНО
#define  DON223___V  DBB[ 470]   // Управление клапаном дозировки шлама ТОЧНО
#define  DOX1602__V  DBB[ 471]   // Резерв DOX1602
#define  DOX1603__V  DBB[ 472]   // Резерв DOX1603
#define  DOX1604__V  DBB[ 473]   // Резерв DOX1604
#define  DOX1605__V  DBB[ 474]   // Резерв DOX1605
#define  DOX1606__V  DBB[ 475]   // Резерв DOX1606
#define  DOX1607__V  DBB[ 476]   // Резерв DOX1607
#define  DOX1608__V  DBB[ 477]   // Резерв DOX1608
#define  DOX1609__V  DBB[ 478]   // Резерв DOX1609
#define  DOX1610__V  DBB[ 479]   // Резерв DOX1610
#define  DON900___V  DBB[ 480]   // Сигнал работы контроллера
#define  DON702___V  DBB[ 481]   // Звуковая сигнализация
#define  AOT050__OV  DBB[ 490]   // Температура шламобассейна N1
#define  AOT040__OV  DBB[ 491]   // Температура шламобассейна N2
#define  AOT030__OV  DBB[ 492]   // Температура шламобассейна N3
#define  AOT270__OV  DBB[ 493]   // Температура емкости ВОДА-ПАВ
#define  AIT050_SZM  DBB[ 494]   // Ноль шкалы  Температура в бассейне шлама N1
#define  AIT050_SZV  DBB[ 495]   // Ноль шкалы  Температура в бассейне шлама N1
#define  AIT050_SDM  DBB[ 496]   // Диапазон шкалы  Температура в бассейне шлама N1
#define  AIT050_SDV  DBB[ 497]   // Диапазон шкалы  Температура в бассейне шлама N1
#define  AIT050_AZM  DBB[ 498]   // Минимальное значение сигнализации  Температура в бассейне шлама N1
#define  AIT050_AZV  DBB[ 499]   // Минимальное значение сигнализации  Температура в бассейне шлама N1
#define  AIT050_AMM  DBB[ 500]   // Максимальное значение сигнализации  Температура в бассейне шлама N1
#define  AIT050_AMV  DBB[ 501]   // Максимальное значение сигнализации  Температура в бассейне шлама N1
#define  AIT050__FM  DBB[ 502]   // Значение фильтрации скачков  Температура в бассейне шлама N1
#define  AIT050__FV  DBB[ 503]   // Значение фильтрации скачков  Температура в бассейне шлама N1
#define  AIT050__AM  DBB[ 504]   // Количество циклов усреднения  Температура в бассейне шлама N1
#define  AIT050__AV  DBB[ 505]   // Количество циклов усреднения  Температура в бассейне шлама N1
#define  AIT040_SZM  DBB[ 506]   // Ноль шкалы  Температура в бассейне шлама N2
#define  AIT040_SZV  DBB[ 507]   // Ноль шкалы  Температура в бассейне шлама N2
#define  AIT040_SDM  DBB[ 508]   // Диапазон шкалы  Температура в бассейне шлама N2
#define  AIT040_SDV  DBB[ 509]   // Диапазон шкалы  Температура в бассейне шлама N2
#define  AIT040_AZM  DBB[ 510]   // Минимальное значение сигнализации  Температура в бассейне шлама N2
#define  AIT040_AZV  DBB[ 511]   // Минимальное значение сигнализации  Температура в бассейне шлама N2
#define  AIT040_AMM  DBB[ 512]   // Максимальное значение сигнализации  Температура в бассейне шлама N2
#define  AIT040_AMV  DBB[ 513]   // Максимальное значение сигнализации  Температура в бассейне шлама N2
#define  AIT040__FM  DBB[ 514]   // Значение фильтрации скачков  Температура в бассейне шлама N2
#define  AIT040__FV  DBB[ 515]   // Значение фильтрации скачков  Температура в бассейне шлама N2
#define  AIT040__AM  DBB[ 516]   // Количество циклов усреднения  Температура в бассейне шлама N2
#define  AIT040__AV  DBB[ 517]   // Количество циклов усреднения  Температура в бассейне шлама N2
#define  AIT030_SZM  DBB[ 518]   // Ноль шкалы  Температура в бассейне шлама N3
#define  AIT030_SZV  DBB[ 519]   // Ноль шкалы  Температура в бассейне шлама N3
#define  AIT030_SDM  DBB[ 520]   // Диапазон шкалы  Температура в бассейне шлама N3
#define  AIT030_SDV  DBB[ 521]   // Диапазон шкалы  Температура в бассейне шлама N3
#define  AIT030_AZM  DBB[ 522]   // Минимальное значение сигнализации  Температура в бассейне шлама N3
#define  AIT030_AZV  DBB[ 523]   // Минимальное значение сигнализации  Температура в бассейне шлама N3
#define  AIT030_AMM  DBB[ 524]   // Максимальное значение сигнализации  Температура в бассейне шлама N3
#define  AIT030_AMV  DBB[ 525]   // Максимальное значение сигнализации  Температура в бассейне шлама N3
#define  AIT030__FM  DBB[ 526]   // Значение фильтрации скачков  Температура в бассейне шлама N3
#define  AIT030__FV  DBB[ 527]   // Значение фильтрации скачков  Температура в бассейне шлама N3
#define  AIT030__AM  DBB[ 528]   // Количество циклов усреднения  Температура в бассейне шлама N3
#define  AIT030__AV  DBB[ 529]   // Количество циклов усреднения  Температура в бассейне шлама N3
#define  AIT220_SZM  DBB[ 530]   // Ноль шкалы  Температура в бункере шлама
#define  AIT220_SZV  DBB[ 531]   // Ноль шкалы  Температура в бункере шлама
#define  AIT220_SDM  DBB[ 532]   // Диапазон шкалы  Температура в бункере шлама
#define  AIT220_SDV  DBB[ 533]   // Диапазон шкалы  Температура в бункере шлама
#define  AIT220_AZM  DBB[ 534]   // Минимальное значение сигнализации  Температура в бункере шлама
#define  AIT220_AZV  DBB[ 535]   // Минимальное значение сигнализации  Температура в бункере шлама
#define  AIT220_AMM  DBB[ 536]   // Максимальное значение сигнализации  Температура в бункере шлама
#define  AIT220_AMV  DBB[ 537]   // Максимальное значение сигнализации  Температура в бункере шлама
#define  AIT220__FM  DBB[ 538]   // Значение фильтрации скачков  Температура в бункере шлама
#define  AIT220__FV  DBB[ 539]   // Значение фильтрации скачков  Температура в бункере шлама
#define  AIT220__AM  DBB[ 540]   // Количество циклов усреднения  Температура в бункере шлама
#define  AIT220__AV  DBB[ 541]   // Количество циклов усреднения  Температура в бункере шлама
#define  AIT270_SZM  DBB[ 542]   // Ноль шкалы  Температура в емкости вода-ПАВ
#define  AIT270_SZV  DBB[ 543]   // Ноль шкалы  Температура в емкости вода-ПАВ
#define  AIT270_SDM  DBB[ 544]   // Диапазон шкалы  Температура в емкости вода-ПАВ
#define  AIT270_SDV  DBB[ 545]   // Диапазон шкалы  Температура в емкости вода-ПАВ
#define  AIT270_AZM  DBB[ 546]   // Минимальное значение сигнализации  Температура в емкости вода-ПАВ
#define  AIT270_AZV  DBB[ 547]   // Минимальное значение сигнализации  Температура в емкости вода-ПАВ
#define  AIT270_AMM  DBB[ 548]   // Максимальное значение сигнализации  Температура в емкости вода-ПАВ
#define  AIT270_AMV  DBB[ 549]   // Максимальное значение сигнализации  Температура в емкости вода-ПАВ
#define  AIT270__FM  DBB[ 550]   // Значение фильтрации скачков  Температура в емкости вода-ПАВ
#define  AIT270__FV  DBB[ 551]   // Значение фильтрации скачков  Температура в емкости вода-ПАВ
#define  AIT270__AM  DBB[ 552]   // Количество циклов усреднения  Температура в емкости вода-ПАВ
#define  AIT270__AV  DBB[ 553]   // Количество циклов усреднения  Температура в емкости вода-ПАВ
#define  AIT200_SZM  DBB[ 554]   // Ноль шкалы  Температура на выходе сборника воды
#define  AIT200_SZV  DBB[ 555]   // Ноль шкалы  Температура на выходе сборника воды
#define  AIT200_SDM  DBB[ 556]   // Диапазон шкалы  Температура на выходе сборника воды
#define  AIT200_SDV  DBB[ 557]   // Диапазон шкалы  Температура на выходе сборника воды
#define  AIT200_AZM  DBB[ 558]   // Минимальное значение сигнализации  Температура на выходе сборника воды
#define  AIT200_AZV  DBB[ 559]   // Минимальное значение сигнализации  Температура на выходе сборника воды
#define  AIT200_AMM  DBB[ 560]   // Максимальное значение сигнализации  Температура на выходе сборника воды
#define  AIT200_AMV  DBB[ 561]   // Максимальное значение сигнализации  Температура на выходе сборника воды
#define  AIT200__FM  DBB[ 562]   // Значение фильтрации скачков  Температура на выходе сборника воды
#define  AIT200__FV  DBB[ 563]   // Значение фильтрации скачков  Температура на выходе сборника воды
#define  AIT200__AM  DBB[ 564]   // Количество циклов усреднения  Температура на выходе сборника воды
#define  AIT200__AV  DBB[ 565]   // Количество циклов усреднения  Температура на выходе сборника воды
#define  AIX0300SZM  DBB[ 566]   // Ноль шкалы  Резерв AIX0300
#define  AIX0300SZV  DBB[ 567]   // Ноль шкалы  Резерв AIX0300
#define  AIX0300SDM  DBB[ 568]   // Диапазон шкалы  Резерв AIX0300
#define  AIX0300SDV  DBB[ 569]   // Диапазон шкалы  Резерв AIX0300
#define  AIX0300AZM  DBB[ 570]   // Минимальное значение сигнализации  Резерв AIX0300
#define  AIX0300AZV  DBB[ 571]   // Минимальное значение сигнализации  Резерв AIX0300
#define  AIX0300AMM  DBB[ 572]   // Максимальное значение сигнализации  Резерв AIX0300
#define  AIX0300AMV  DBB[ 573]   // Максимальное значение сигнализации  Резерв AIX0300
#define  AIX0300_FM  DBB[ 574]   // Значение фильтрации скачков  Резерв AIX0300
#define  AIX0300_FV  DBB[ 575]   // Значение фильтрации скачков  Резерв AIX0300
#define  AIX0300_AM  DBB[ 576]   // Количество циклов усреднения  Резерв AIX0300
#define  AIX0300_AV  DBB[ 577]   // Количество циклов усреднения  Резерв AIX0300
#define  AIW290_SZM  DBB[ 578]   // Ноль шкалы  Вес дозатора пасты
#define  AIW290_SZV  DBB[ 579]   // Ноль шкалы  Вес дозатора пасты
#define  AIW290_SDM  DBB[ 580]   // Диапазон шкалы  Вес дозатора пасты
#define  AIW290_SDV  DBB[ 581]   // Диапазон шкалы  Вес дозатора пасты
#define  AIW290_AZM  DBB[ 582]   // Минимальное значение сигнализации  Вес дозатора пасты
#define  AIW290_AZV  DBB[ 583]   // Минимальное значение сигнализации  Вес дозатора пасты
#define  AIW290_AMM  DBB[ 584]   // Максимальное значение сигнализации  Вес дозатора пасты
#define  AIW290_AMV  DBB[ 585]   // Максимальное значение сигнализации  Вес дозатора пасты
#define  AIW290__FM  DBB[ 586]   // Значение фильтрации скачков  Вес дозатора пасты
#define  AIW290__FV  DBB[ 587]   // Значение фильтрации скачков  Вес дозатора пасты
#define  AIW290__AM  DBB[ 588]   // Количество циклов усреднения  Вес дозатора пасты
#define  AIW290__AV  DBB[ 589]   // Количество циклов усреднения  Вес дозатора пасты
#define  AIW230_SZM  DBB[ 590]   // Ноль шкалы  Вес дозатора мокрого
#define  AIW230_SZV  DBB[ 591]   // Ноль шкалы  Вес дозатора мокрого
#define  AIW230_SDM  DBB[ 592]   // Диапазон шкалы  Вес дозатора мокрого
#define  AIW230_SDV  DBB[ 593]   // Диапазон шкалы  Вес дозатора мокрого
#define  AIW230_AZM  DBB[ 594]   // Минимальное значение сигнализации  Вес дозатора мокрого
#define  AIW230_AZV  DBB[ 595]   // Минимальное значение сигнализации  Вес дозатора мокрого
#define  AIW230_AMM  DBB[ 596]   // Максимальное значение сигнализации  Вес дозатора мокрого
#define  AIW230_AMV  DBB[ 597]   // Максимальное значение сигнализации  Вес дозатора мокрого
#define  AIW230__FM  DBB[ 598]   // Значение фильтрации скачков  Вес дозатора мокрого
#define  AIW230__FV  DBB[ 599]   // Значение фильтрации скачков  Вес дозатора мокрого
#define  AIW230__AM  DBB[ 600]   // Количество циклов усреднения  Вес дозатора мокрого
#define  AIW230__AV  DBB[ 601]   // Количество циклов усреднения  Вес дозатора мокрого
#define  AIW190_SZM  DBB[ 602]   // Ноль шкалы  Вес дозатора сухого
#define  AIW190_SZV  DBB[ 603]   // Ноль шкалы  Вес дозатора сухого
#define  AIW190_SDM  DBB[ 604]   // Диапазон шкалы  Вес дозатора сухого
#define  AIW190_SDV  DBB[ 605]   // Диапазон шкалы  Вес дозатора сухого
#define  AIW190_AZM  DBB[ 606]   // Минимальное значение сигнализации  Вес дозатора сухого
#define  AIW190_AZV  DBB[ 607]   // Минимальное значение сигнализации  Вес дозатора сухого
#define  AIW190_AMM  DBB[ 608]   // Максимальное значение сигнализации  Вес дозатора сухого
#define  AIW190_AMV  DBB[ 609]   // Максимальное значение сигнализации  Вес дозатора сухого
#define  AIW190__FM  DBB[ 610]   // Значение фильтрации скачков  Вес дозатора сухого
#define  AIW190__FV  DBB[ 611]   // Значение фильтрации скачков  Вес дозатора сухого
#define  AIW190__AM  DBB[ 612]   // Количество циклов усреднения  Вес дозатора сухого
#define  AIW190__AV  DBB[ 613]   // Количество циклов усреднения  Вес дозатора сухого
#define  AIX0304SZM  DBB[ 614]   // Ноль шкалы  Резерв AIX0304
#define  AIX0304SZV  DBB[ 615]   // Ноль шкалы  Резерв AIX0304
#define  AIX0304SDM  DBB[ 616]   // Диапазон шкалы  Резерв AIX0304
#define  AIX0304SDV  DBB[ 617]   // Диапазон шкалы  Резерв AIX0304
#define  AIX0304AZM  DBB[ 618]   // Минимальное значение сигнализации  Резерв AIX0304
#define  AIX0304AZV  DBB[ 619]   // Минимальное значение сигнализации  Резерв AIX0304
#define  AIX0304AMM  DBB[ 620]   // Максимальное значение сигнализации  Резерв AIX0304
#define  AIX0304AMV  DBB[ 621]   // Максимальное значение сигнализации  Резерв AIX0304
#define  AIX0304_FM  DBB[ 622]   // Значение фильтрации скачков  Резерв AIX0304
#define  AIX0304_FV  DBB[ 623]   // Значение фильтрации скачков  Резерв AIX0304
#define  AIX0304_AM  DBB[ 624]   // Количество циклов усреднения  Резерв AIX0304
#define  AIX0304_AV  DBB[ 625]   // Количество циклов усреднения  Резерв AIX0304
#define  AIX0305SZM  DBB[ 626]   // Ноль шкалы  Резерв AIX0305
#define  AIX0305SZV  DBB[ 627]   // Ноль шкалы  Резерв AIX0305
#define  AIX0305SDM  DBB[ 628]   // Диапазон шкалы  Резерв AIX0305
#define  AIX0305SDV  DBB[ 629]   // Диапазон шкалы  Резерв AIX0305
#define  AIX0305AZM  DBB[ 630]   // Минимальное значение сигнализации  Резерв AIX0305
#define  AIX0305AZV  DBB[ 631]   // Минимальное значение сигнализации  Резерв AIX0305
#define  AIX0305AMM  DBB[ 632]   // Максимальное значение сигнализации  Резерв AIX0305
#define  AIX0305AMV  DBB[ 633]   // Максимальное значение сигнализации  Резерв AIX0305
#define  AIX0305_FM  DBB[ 634]   // Значение фильтрации скачков  Резерв AIX0305
#define  AIX0305_FV  DBB[ 635]   // Значение фильтрации скачков  Резерв AIX0305
#define  AIX0305_AM  DBB[ 636]   // Количество циклов усреднения  Резерв AIX0305
#define  AIX0305_AV  DBB[ 637]   // Количество циклов усреднения  Резерв AIX0305
#define  AIX0306SZM  DBB[ 638]   // Ноль шкалы  Резерв AIX0306
#define  AIX0306SZV  DBB[ 639]   // Ноль шкалы  Резерв AIX0306
#define  AIX0306SDM  DBB[ 640]   // Диапазон шкалы  Резерв AIX0306
#define  AIX0306SDV  DBB[ 641]   // Диапазон шкалы  Резерв AIX0306
#define  AIX0306AZM  DBB[ 642]   // Минимальное значение сигнализации  Резерв AIX0306
#define  AIX0306AZV  DBB[ 643]   // Минимальное значение сигнализации  Резерв AIX0306
#define  AIX0306AMM  DBB[ 644]   // Максимальное значение сигнализации  Резерв AIX0306
#define  AIX0306AMV  DBB[ 645]   // Максимальное значение сигнализации  Резерв AIX0306
#define  AIX0306_FM  DBB[ 646]   // Значение фильтрации скачков  Резерв AIX0306
#define  AIX0306_FV  DBB[ 647]   // Значение фильтрации скачков  Резерв AIX0306
#define  AIX0306_AM  DBB[ 648]   // Количество циклов усреднения  Резерв AIX0306
#define  AIX0306_AV  DBB[ 649]   // Количество циклов усреднения  Резерв AIX0306
#define  AIX0307SZM  DBB[ 650]   // Ноль шкалы  Резерв AIX0307
#define  AIX0307SZV  DBB[ 651]   // Ноль шкалы  Резерв AIX0307
#define  AIX0307SDM  DBB[ 652]   // Диапазон шкалы  Резерв AIX0307
#define  AIX0307SDV  DBB[ 653]   // Диапазон шкалы  Резерв AIX0307
#define  AIX0307AZM  DBB[ 654]   // Минимальное значение сигнализации  Резерв AIX0307
#define  AIX0307AZV  DBB[ 655]   // Минимальное значение сигнализации  Резерв AIX0307
#define  AIX0307AMM  DBB[ 656]   // Максимальное значение сигнализации  Резерв AIX0307
#define  AIX0307AMV  DBB[ 657]   // Максимальное значение сигнализации  Резерв AIX0307
#define  AIX0307_FM  DBB[ 658]   // Значение фильтрации скачков  Резерв AIX0307
#define  AIX0307_FV  DBB[ 659]   // Значение фильтрации скачков  Резерв AIX0307
#define  AIX0307_AM  DBB[ 660]   // Количество циклов усреднения  Резерв AIX0307
#define  AIX0307_AV  DBB[ 661]   // Количество циклов усреднения  Резерв AIX0307
#define  DON053O__M  DBB[ 662]   // Эл.клапан подачи пара в бассейн шлама N1 - Откр
#define  DON053C__M  DBB[ 663]   // Эл.клапан подачи пара в бассейн шлама N1 - Закр
#define  DON043O__M  DBB[ 664]   // Эл.клапан подачи пара в бассейн шлама N2 - Откр
#define  DON043C__M  DBB[ 665]   // Эл.клапан подачи пара в бассейн шлама N2 - Закр
#define  DON033O__M  DBB[ 666]   // Эл.клапан подачи пара в бассейн шлама N3 - Откр
#define  DON033C__M  DBB[ 667]   // Эл.клапан подачи пара в бассейн шлама N3 - Закр
#define  DON021___M  DBB[ 668]   // Пн.клапан подачи воздуха в насос шлама N1
#define  DON011___M  DBB[ 669]   // Пн.клапан подачи воздуха в насос шлама N2,3
#define  DON052___M  DBB[ 670]   // Пн.клапан выгрузки шлама из бассейна шлама N1
#define  DON051___M  DBB[ 671]   // Клапан выгрузки шлама из бассейна шлама N1
#define  DOX1010__M  DBB[ 672]   // Резерв DOX1010
#define  DON022___M  DBB[ 673]   // Пн.клапан загрузки насоса бассейна шлама N1
#define  DON042___M  DBB[ 674]   // Пн.клапан выгрузки шлама из бассейна шлама N2
#define  DON041___M  DBB[ 675]   // Клапан выгрузки шлама из бассейна шлама N2
#define  DOX1101__M  DBB[ 676]   // Резерв DOX1101
#define  DON032___M  DBB[ 677]   // Пн.клапан выгрузки шлама из бассейна шлама N3
#define  DON031___M  DBB[ 678]   // Клапан выгрузки шлама из бассейна шлама N3
#define  DOX1104__M  DBB[ 679]   // Резерв DOX1104
#define  DON012___M  DBB[ 680]   // Пн.клапан загрузки в насос бассейна шлама N2,3
#define  DON221___M  DBB[ 681]   // Пн.клапан дозировки шлама ВЕРХНИЙ
#define  DON222___M  DBB[ 682]   // Пн.клапан дозировки шлама НИЖНИЙ
#define  DON061___M  DBB[ 683]   // Включение насоса сборника конденсата
#define  DON202___M  DBB[ 684]   // Пн.клапан подачи воды в дозатор мокрого
#define  DON201___M  DBB[ 685]   // Пн.клапан подачи технической воды в сборник воды
#define  DON232___M  DBB[ 686]   // Пн.клапан подачи промывочной воды в дозатор мокрого
#define  DON101___M  DBB[ 687]   // Пн.клапан подачи воздуха на насос склада цемента
#define  DON172___M  DBB[ 688]   // Пн.клапан подачи цемента из бункера цемента на шнек
#define  DON181___M  DBB[ 689]   // Пн.клапан дозировки цемента ГРУБО
#define  DON182___M  DBB[ 690]   // Пн.клапан дозировки цемента ТОЧНО
#define  DON162___M  DBB[ 691]   // Шнек аспирации цемента
#define  DON180___M  DBB[ 692]   // Шнек подачи цемента после бункера цемента
#define  DON150___M  DBB[ 693]   // Шнек подачи вяжущего после бункера вяжущего
#define  DON151___M  DBB[ 694]   // Пн.клапан дозировки вяжущего ГРУБО
#define  DON152___M  DBB[ 695]   // Пн.клапан дозировки вяжущего ТОЧНО
#define  DON132___M  DBB[ 696]   // Шнек аспирации вяжущего
#define  DON211___M  DBB[ 697]   // Пн.клапан дозировки отходов ВЕРХНИЙ
#define  DON212___M  DBB[ 698]   // Пн.клапан дозировки отходов НИЖНИЙ
#define  DOX1211__M  DBB[ 699]   // Резерв DOX1211
#define  DON281___M  DBB[ 700]   // Пн.клапан загрузки в пром.емкость ал.пасты
#define  DON102___M  DBB[ 701]   // Пн.клапан подачи цемента в насос склада цемента
#define  DON161___M  DBB[ 702]   // Вентилятор аспирации цемента
#define  DON171___M  DBB[ 703]   // Пн.клапан подачи воздуха в бункер цемента
#define  DON131___M  DBB[ 704]   // Вентилятор аспирации вяжущего
#define  DON141___M  DBB[ 705]   // Пн.клапан подачи воздуха в бункер вяжущего
#define  DON142___M  DBB[ 706]   // Пн.клапан подачи вяжущего из бункера вяжущего на шнек
#define  DON071___M  DBB[ 707]   // Пн.клапан подачи воды в мешалку отходов РК
#define  DON082___M  DBB[ 708]   // Пн.клапан подачи воздуха в насос мешалки отходов РК
#define  DON081___M  DBB[ 709]   // Пн.клапан подачи отходов из мешалки отходов РК в пн.насос
#define  DON111___M  DBB[ 710]   // Пн.клапан подачи воздуха на подрыв гомогенизатора N1
#define  DON112___M  DBB[ 711]   // Пн.клапан подачи воздуха на инжектор гомогенизатора N1
#define  DON121___M  DBB[ 712]   // Пн.клапан подачи воздуха на подрыв гомогенизатора N2
#define  DON122___M  DBB[ 713]   // Пн.клапан подачи воздуха на инжектор гомогенизатора N2
#define  DON273O__M  DBB[ 714]   // Эл.клапан подачи пара в емкость вода-ПАВ - Откр
#define  DON273C__M  DBB[ 715]   // Эл.клапан подачи пара в емкость вода-ПАВ - Закр
#define  DON272___M  DBB[ 716]   // Пн.клапан подачи воды в емкость вода-ПАВ
#define  DOX1403__M  DBB[ 717]   // Резерв DOX1403
#define  DON274___M  DBB[ 718]   // Пн.клапан подачи ПАВ в мешалку суспензии ал.пасты
#define  DON285___M  DBB[ 719]   // Мешалка миксера ал.пасты
#define  DON286___M  DBB[ 720]   // Пн.клапан загрузки ал.пасты в дозатор ал.пасты
#define  DOX1407__M  DBB[ 721]   // Резерв DOX1407
#define  DOX1408__M  DBB[ 722]   // Резерв DOX1408 
#define  DON301___M  DBB[ 723]   // Включение насоса после мешалки суспензии ал.пасты
#define  DON291___M  DBB[ 724]   // Пн.клапан выгрузки из дозатора суспензии ал.пасты
#define  DON193___M  DBB[ 725]   // Пн.клапан выгрузки из дозатора сухого
#define  DON231___M  DBB[ 726]   // Пн.клапан выгрузки из дозатора мокрого
#define  DON316___M  DBB[ 727]   // Пн.клапан N1 слива массы из ВГБМ
#define  DON317___M  DBB[ 728]   // Пн.клапан N2 слива массы из ВГБМ
#define  DON31A___M  DBB[ 729]   // Герметизатор ВГБМ
#define  DON310___M  DBB[ 730]   // Включение ВГБМ
#define  DON192___M  DBB[ 731]   // Аспирация выгрузки сухого
#define  DON191___M  DBB[ 732]   // Вибратор выгрузки сухого
#define  DON143___M  DBB[ 733]   // Вибратор бункера вяжущего
#define  DON173___M  DBB[ 734]   // Вибратор бункера цемента
#define  DON311___M  DBB[ 735]   // Вибраторы ВГБМ
#define  DON801___M  DBB[ 736]   // Лампочка дозатора сухого
#define  DON802___M  DBB[ 737]   // Лампочка дозатора мокрого
#define  DON803___M  DBB[ 738]   // Лампочка дозатора пасты
#define  DON091___M  DBB[ 739]   // Сигнал на склад цемента
#define  DON203___M  DBB[ 740]   // Управление клапаном дозировки воды ТОЧНО
#define  DON223___M  DBB[ 741]   // Управление клапаном дозировки шлама ТОЧНО
#define  DOX1602__M  DBB[ 742]   // Резерв DOX1602
#define  DOX1603__M  DBB[ 743]   // Резерв DOX1603
#define  DOX1604__M  DBB[ 744]   // Резерв DOX1604
#define  DOX1605__M  DBB[ 745]   // Резерв DOX1605
#define  DOX1606__M  DBB[ 746]   // Резерв DOX1606
#define  DOX1607__M  DBB[ 747]   // Резерв DOX1607
#define  DOX1608__M  DBB[ 748]   // Резерв DOX1608
#define  DOX1609__M  DBB[ 749]   // Резерв DOX1609
#define  DOX1610__M  DBB[ 750]   // Резерв DOX1610
#define  DON900___M  DBB[ 751]   // Сигнал работы контроллера
#define  DON702___M  DBB[ 752]   // Звуковая сигнализация
#define  AOT050_OOV  DBB[ 753]   // Выход регулятора на модуль УСО [%]  Температура шламобассейна N1
#define  AOT050__OM  DBB[ 754]   // Выход регулятора [%]  Температура шламобассейна N1
#define  AOT050_LOM  DBB[ 755]   // Нижняя граница выхода регулятора [%]  Температура шламобассейна N1
#define  AOT050_LOV  DBB[ 756]   // Нижняя граница выхода регулятора [%]  Температура шламобассейна N1
#define  AOT050_HOM  DBB[ 757]   // Верхняя граница выхода регулятора [%]  Температура шламобассейна N1
#define  AOT050_HOV  DBB[ 758]   // Верхняя граница выхода регулятора [%]  Температура шламобассейна N1
#define  AOT050_LPM  DBB[ 759]   // Нижняя граница выхода прибора [%]  Температура шламобассейна N1
#define  AOT050_LPV  DBB[ 760]   // Нижняя граница выхода прибора [%]  Температура шламобассейна N1
#define  AOT050_HPM  DBB[ 761]   // Верхняя граница выхода прибора [%]  Температура шламобассейна N1
#define  AOT050_HPV  DBB[ 762]   // Верхняя граница выхода прибора [%]  Температура шламобассейна N1
#define  AOT050__ZM  DBB[ 763]   // Задание регулятора  Температура шламобассейна N1
#define  AOT050__ZV  DBB[ 764]   // Задание регулятора  Температура шламобассейна N1
#define  AOT050__PM  DBB[ 765]   // Коэффициент пропорциональности  Температура шламобассейна N1
#define  AOT050__PV  DBB[ 766]   // Коэффициент пропорциональности  Температура шламобассейна N1
#define  AOT050__IM  DBB[ 767]   // Коэффициент интегрирования  Температура шламобассейна N1
#define  AOT050__IV  DBB[ 768]   // Коэффициент интегрирования  Температура шламобассейна N1
#define  AOT050__DM  DBB[ 769]   // Коэффициент дифференцирования  Температура шламобассейна N1
#define  AOT050__DV  DBB[ 770]   // Коэффициент дифференцирования  Температура шламобассейна N1
#define  AOT050__MM  DBB[ 771]   // Коэффициент масштабирования  Температура шламобассейна N1
#define  AOT050__MV  DBB[ 772]   // Коэффициент масштабирования  Температура шламобассейна N1
#define  AOT050__RM  DBB[ 773]   // Режим регулятора (РУЧНОЕ-АВТОМАТ)  Температура шламобассейна N1
#define  AOT050__RV  DBB[ 774]   // Режим регулятора (РУЧНОЕ-АВТОМАТ)  Температура шламобассейна N1
#define  AOT040_OOV  DBB[ 775]   // Выход регулятора на модуль УСО [%]  Температура шламобассейна N2
#define  AOT040__OM  DBB[ 776]   // Выход регулятора [%]  Температура шламобассейна N2
#define  AOT040_LOM  DBB[ 777]   // Нижняя граница выхода регулятора [%]  Температура шламобассейна N2
#define  AOT040_LOV  DBB[ 778]   // Нижняя граница выхода регулятора [%]  Температура шламобассейна N2
#define  AOT040_HOM  DBB[ 779]   // Верхняя граница выхода регулятора [%]  Температура шламобассейна N2
#define  AOT040_HOV  DBB[ 780]   // Верхняя граница выхода регулятора [%]  Температура шламобассейна N2
#define  AOT040_LPM  DBB[ 781]   // Нижняя граница выхода прибора [%]  Температура шламобассейна N2
#define  AOT040_LPV  DBB[ 782]   // Нижняя граница выхода прибора [%]  Температура шламобассейна N2
#define  AOT040_HPM  DBB[ 783]   // Верхняя граница выхода прибора [%]  Температура шламобассейна N2
#define  AOT040_HPV  DBB[ 784]   // Верхняя граница выхода прибора [%]  Температура шламобассейна N2
#define  AOT040__ZM  DBB[ 785]   // Задание регулятора  Температура шламобассейна N2
#define  AOT040__ZV  DBB[ 786]   // Задание регулятора  Температура шламобассейна N2
#define  AOT040__PM  DBB[ 787]   // Коэффициент пропорциональности  Температура шламобассейна N2
#define  AOT040__PV  DBB[ 788]   // Коэффициент пропорциональности  Температура шламобассейна N2
#define  AOT040__IM  DBB[ 789]   // Коэффициент интегрирования  Температура шламобассейна N2
#define  AOT040__IV  DBB[ 790]   // Коэффициент интегрирования  Температура шламобассейна N2
#define  AOT040__DM  DBB[ 791]   // Коэффициент дифференцирования  Температура шламобассейна N2
#define  AOT040__DV  DBB[ 792]   // Коэффициент дифференцирования  Температура шламобассейна N2
#define  AOT040__MM  DBB[ 793]   // Коэффициент масштабирования  Температура шламобассейна N2
#define  AOT040__MV  DBB[ 794]   // Коэффициент масштабирования  Температура шламобассейна N2
#define  AOT040__RM  DBB[ 795]   // Режим регулятора (РУЧНОЕ-АВТОМАТ)  Температура шламобассейна N2
#define  AOT040__RV  DBB[ 796]   // Режим регулятора (РУЧНОЕ-АВТОМАТ)  Температура шламобассейна N2
#define  AOT030_OOV  DBB[ 797]   // Выход регулятора на модуль УСО [%]  Температура шламобассейна N3
#define  AOT030__OM  DBB[ 798]   // Выход регулятора [%]  Температура шламобассейна N3
#define  AOT030_LOM  DBB[ 799]   // Нижняя граница выхода регулятора [%]  Температура шламобассейна N3
#define  AOT030_LOV  DBB[ 800]   // Нижняя граница выхода регулятора [%]  Температура шламобассейна N3
#define  AOT030_HOM  DBB[ 801]   // Верхняя граница выхода регулятора [%]  Температура шламобассейна N3
#define  AOT030_HOV  DBB[ 802]   // Верхняя граница выхода регулятора [%]  Температура шламобассейна N3
#define  AOT030_LPM  DBB[ 803]   // Нижняя граница выхода прибора [%]  Температура шламобассейна N3
#define  AOT030_LPV  DBB[ 804]   // Нижняя граница выхода прибора [%]  Температура шламобассейна N3
#define  AOT030_HPM  DBB[ 805]   // Верхняя граница выхода прибора [%]  Температура шламобассейна N3
#define  AOT030_HPV  DBB[ 806]   // Верхняя граница выхода прибора [%]  Температура шламобассейна N3
#define  AOT030__ZM  DBB[ 807]   // Задание регулятора  Температура шламобассейна N3
#define  AOT030__ZV  DBB[ 808]   // Задание регулятора  Температура шламобассейна N3
#define  AOT030__PM  DBB[ 809]   // Коэффициент пропорциональности  Температура шламобассейна N3
#define  AOT030__PV  DBB[ 810]   // Коэффициент пропорциональности  Температура шламобассейна N3
#define  AOT030__IM  DBB[ 811]   // Коэффициент интегрирования  Температура шламобассейна N3
#define  AOT030__IV  DBB[ 812]   // Коэффициент интегрирования  Температура шламобассейна N3
#define  AOT030__DM  DBB[ 813]   // Коэффициент дифференцирования  Температура шламобассейна N3
#define  AOT030__DV  DBB[ 814]   // Коэффициент дифференцирования  Температура шламобассейна N3
#define  AOT030__MM  DBB[ 815]   // Коэффициент масштабирования  Температура шламобассейна N3
#define  AOT030__MV  DBB[ 816]   // Коэффициент масштабирования  Температура шламобассейна N3
#define  AOT030__RM  DBB[ 817]   // Режим регулятора (РУЧНОЕ-АВТОМАТ)  Температура шламобассейна N3
#define  AOT030__RV  DBB[ 818]   // Режим регулятора (РУЧНОЕ-АВТОМАТ)  Температура шламобассейна N3
#define  AOT270_OOV  DBB[ 819]   // Выход регулятора на модуль УСО [%]  Температура емкости ВОДА-ПАВ
#define  AOT270__OM  DBB[ 820]   // Выход регулятора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270_LOM  DBB[ 821]   // Нижняя граница выхода регулятора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270_LOV  DBB[ 822]   // Нижняя граница выхода регулятора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270_HOM  DBB[ 823]   // Верхняя граница выхода регулятора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270_HOV  DBB[ 824]   // Верхняя граница выхода регулятора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270_LPM  DBB[ 825]   // Нижняя граница выхода прибора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270_LPV  DBB[ 826]   // Нижняя граница выхода прибора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270_HPM  DBB[ 827]   // Верхняя граница выхода прибора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270_HPV  DBB[ 828]   // Верхняя граница выхода прибора [%]  Температура емкости ВОДА-ПАВ
#define  AOT270__ZM  DBB[ 829]   // Задание регулятора  Температура емкости ВОДА-ПАВ
#define  AOT270__ZV  DBB[ 830]   // Задание регулятора  Температура емкости ВОДА-ПАВ
#define  AOT270__PM  DBB[ 831]   // Коэффициент пропорциональности  Температура емкости ВОДА-ПАВ
#define  AOT270__PV  DBB[ 832]   // Коэффициент пропорциональности  Температура емкости ВОДА-ПАВ
#define  AOT270__IM  DBB[ 833]   // Коэффициент интегрирования  Температура емкости ВОДА-ПАВ
#define  AOT270__IV  DBB[ 834]   // Коэффициент интегрирования  Температура емкости ВОДА-ПАВ
#define  AOT270__DM  DBB[ 835]   // Коэффициент дифференцирования  Температура емкости ВОДА-ПАВ
#define  AOT270__DV  DBB[ 836]   // Коэффициент дифференцирования  Температура емкости ВОДА-ПАВ
#define  AOT270__MM  DBB[ 837]   // Коэффициент масштабирования  Температура емкости ВОДА-ПАВ
#define  AOT270__MV  DBB[ 838]   // Коэффициент масштабирования  Температура емкости ВОДА-ПАВ
#define  AOT270__RM  DBB[ 839]   // Режим регулятора (РУЧНОЕ-АВТОМАТ)  Температура емкости ВОДА-ПАВ
#define  AOT270__RV  DBB[ 840]   // Режим регулятора (РУЧНОЕ-АВТОМАТ)  Температура емкости ВОДА-ПАВ
#define  DebValN1_M  DBB[1001]   // Номер вводимой переменной 1
#define  DebValN1_V  DBB[1002]   // Номер вводимой переменной 1
#define  DebValZ1_M  DBB[1003]   // Значение вводимой переменной 1
#define  DebValZ1_V  DBB[1004]   // Значение вводимой переменной 1
#define  DebValZS1V  DBB[1005]   // Запомненное значен предыдущ переменной 1
#define  DebValN2_M  DBB[1006]   // Номер вводимой переменной 2
#define  DebValN2_V  DBB[1007]   // Номер вводимой переменной 2
#define  DebValZ2_M  DBB[1008]   // Значение вводимой переменной 2
#define  DebValZ2_V  DBB[1009]   // Значение вводимой переменной 2
#define  DebValZS2V  DBB[1010]   // Запомненное значен предыдущ переменной 2
#define  DebValN3_M  DBB[1011]   // Номер вводимой переменной 3
#define  DebValN3_V  DBB[1012]   // Номер вводимой переменной 3
#define  DebValZ3_M  DBB[1013]   // Значение вводимой переменной 3
#define  DebValZ3_V  DBB[1014]   // Значение вводимой переменной 3
#define  DebValZS3V  DBB[1015]   // Запомненное значен предыдущ переменной 3
#define  DebValN4_M  DBB[1016]   // Номер вводимой переменной 4
#define  DebValN4_V  DBB[1017]   // Номер вводимой переменной 4
#define  DebValZ4_M  DBB[1018]   // Значение вводимой переменной 4
#define  DebValZ4_V  DBB[1019]   // Значение вводимой переменной 4
#define  DebValZS4V  DBB[1020]   // Запомненное значен предыдущ переменной 4
#define  DebValN5_M  DBB[1021]   // Номер вводимой переменной 5
#define  DebValN5_V  DBB[1022]   // Номер вводимой переменной 5
#define  DebValZ5_M  DBB[1023]   // Значение вводимой переменной 5
#define  DebValZ5_V  DBB[1024]   // Значение вводимой переменной 5
#define  DebValZS5V  DBB[1025]   // Запомненное значен предыдущ переменной 5
#define  DebValN6_M  DBB[1026]   // Номер вводимой переменной 6
#define  DebValN6_V  DBB[1027]   // Номер вводимой переменной 6
#define  DebValZ6_M  DBB[1028]   // Значение вводимой переменной 6
#define  DebValZ6_V  DBB[1029]   // Значение вводимой переменной 6
#define  DebValZS6V  DBB[1030]   // Запомненное значен предыдущ переменной 6
#define  DebValN7_M  DBB[1031]   // Номер вводимой переменной 7
#define  DebValN7_V  DBB[1032]   // Номер вводимой переменной 7
#define  DebValZ7_M  DBB[1033]   // Значение вводимой переменной 7
#define  DebValZ7_V  DBB[1034]   // Значение вводимой переменной 7
#define  DebValZS7V  DBB[1035]   // Запомненное значен предыдущ переменной 7
#define  RegPublicM  DBB[1036]   // Включение-выключение общего регулятора
#define  RegPublicV  DBB[1037]   // Включение-выключение общего регулятора
#define  CONT_MSH1W  DBB[1038]   // Контроль работы мешалки ШБ N1
#define  CONT_MSH2W  DBB[1039]   // Контроль работы мешалки ШБ N2
#define  CONT_MSH3W  DBB[1040]   // Контроль работы мешалки ШБ N3
#define  CONT_MORKW  DBB[1041]   // Контроль работы мешалки отходов РК
#define  CONT_MOTHW  DBB[1042]   // Контроль работы мешалки отходов
#define  CONT_MSHLW  DBB[1043]   // Контроль работы мешалки шлама
#define  ch1044___v  DBB[1044]   // 
#define  CONT_MAPVW  DBB[1045]   // Контроль работы мешалки пасты верхней
#define  CONT_MAPNW  DBB[1046]   // Контроль работы мешалки пасты нижней
#define  TIME_MSVCW  DBB[1047]   // Время контроля работы мешалок
#define  KRCEM____F  DBB[1048]   // Флаг корректировки воды для цемента
#define  KRVYG____F  DBB[1049]   // Флаг корректировки воды для вяжущего
#define  KROTH____F  DBB[1050]   // Флаг корректировки воды для отходов
#define  KRSLM____F  DBB[1051]   // Флаг корректировки воды для шлама
#define  DIS302___S  DBB[1052]   // Флаг перемешивания ПАВ
#define  DIS275___S  DBB[1053]   // Флаг включения регулятора подогрева ПАВ
#define  TIME_PADZW  DBB[1054]   // Время контроля дозировки пасты
#define  TIME_PADZC  DBB[1055]   // Время контроля дозировки пасты
#define  TIME_PLLVW  DBB[1056]   // Время набора нижн уровня емк вода-ПАВ
#define  TIME_PLLVC  DBB[1057]   // Время набора нижн уровня емк вода-ПАВ
#define  TIME_PHLVW  DBB[1058]   // Время набора верх уровня емк вода-ПАВ
#define  TIME_PHLVC  DBB[1059]   // Время набора верх уровня емк вода-ПАВ
#define  DIS275___W  DBB[1060]   // Установка признака засыпки ПАВ
#define  DIS302___W  DBB[1061]   // Установка признака окончания перемешивания ПАВ
#define  TIME_PNMXW  DBB[1062]   // Время набора ал.пасты в миксер
#define  TIME_PNMXC  DBB[1063]   // Время набора ал.пасты в миксер
#define  TIME_PPMXW  DBB[1064]   // Время перемешивания ал.пасты в миксере
#define  TIME_PPMXC  DBB[1065]   // Время перемешивания ал.пасты в миксере
#define  TIME_PALNW  DBB[1066]   // Время набора ниж уровня нижн мешалки пасты
#define  TIME_PALNC  DBB[1067]   // Время набора ниж уровня нижн мешалки пасты
#define  TIME_PANNW  DBB[1068]   // Время набора верх уровня нижн мешалки пасты
#define  TIME_PANNC  DBB[1069]   // Время набора верх уровня нижн мешалки пасты
#define  TIME_PALVW  DBB[1070]   // Время набора ниж уровня верх мешалки пасты
#define  TIME_PALVC  DBB[1071]   // Время набора ниж уровня верх мешалки пасты
#define  TIME_PANVW  DBB[1072]   // Время набора верх уровня верх мешалки пасты
#define  TIME_PANVC  DBB[1073]   // Время набора верх уровня верх мешалки пасты
#define  TIME_PAMSW  DBB[1074]   // Время ожидания сигнала от операт меш пасты
#define  TIME_PAMSC  DBB[1075]   // Время ожидания сигнала от операт меш пасты
#define  TIME_PAVGW  DBB[1076]   // Время выгрузки дозатора пасты
#define  TIME_PAVGC  DBB[1077]   // Время выгрузки дозатора пасты
#define  REG01SW__V  DBB[1078]   // Текущий шаг ожидания регулятора
#define  REG02SW__V  DBB[1079]   // Текущий шаг ожидания регулятора
#define  REG03SW__V  DBB[1080]   // Текущий шаг ожидания регулятора
#define  REG04SW__V  DBB[1081]   // Текущий шаг ожидания регулятора
#define  REG05SW__V  DBB[1082]   // Текущий шаг ожидания регулятора
#define  REG06SW__V  DBB[1083]   // Текущий шаг ожидания регулятора
#define  REG07SW__V  DBB[1084]   // Текущий шаг ожидания регулятора
#define  ch1085___v  DBB[1085]   // 
#define  REG09SW__V  DBB[1086]   // Текущий шаг ожидания регулятора
#define  REG10SW__V  DBB[1087]   // Текущий шаг ожидания регулятора
#define  REG06SW1_V  DBB[1088]   // Текущий шаг ожидания регулятора
#define  REG07SW1_V  DBB[1089]   // Текущий шаг ожидания регулятора
#define  ch1090___v  DBB[1090]   // 
#define  REG09SW1_V  DBB[1091]   // Текущий шаг ожидания регулятора
#define  REG10SW1_V  DBB[1092]   // Текущий шаг ожидания регулятора
#define  TIME_POASW  DBB[1093]   // Время ожидания после включ аспирации вяжущего
#define  TIME_POASC  DBB[1094]   // Время ожидания после включ аспирации вяжущего
#define  SigPubZagW  DBB[1095]   // Управляющий сигнал загрузки общего регулятора
#define  SigPubVigW  DBB[1096]   // Управляющий сигнал выгрузки общего регулятора
#define  TIME_RGMCW  DBB[1099]   // Время контроля ручн режима работы регулятор
#define  TIME_LEV51  DBB[1101]   // Включение-выключение звонка
#define  TIME_LEV52  DBB[1102]   // Включение-выключение звонка
#define  TIME_LEV53  DBB[1103]   // Включение-выключение сообщений
#define  TIME_LEV54  DBB[1104]   // Включение-выключение сообщений
#define  TIME_OSC51  DBB[1105]   // Включение-выключение звонка
#define  TIME_OSC52  DBB[1106]   // Включение-выключение звонка
#define  TIME_OSC53  DBB[1107]   // Включение-выключение сообщений
#define  TIME_OSC54  DBB[1108]   // Включение-выключение сообщений
#define  TIME_NAS51  DBB[1109]   // Включение-выключение звонка
#define  TIME_NAS52  DBB[1110]   // Включение-выключение звонка
#define  TIME_NAS53  DBB[1111]   // Включение-выключение сообщений
#define  TIME_NAS54  DBB[1112]   // Включение-выключение сообщений
#define  LOAD_NS101  DBB[1113]   // Включение-выключение звонка
#define  LOAD_NS102  DBB[1114]   // Включение-выключение звонка
#define  LOAD_NS103  DBB[1115]   // Включение-выключение сообщений
#define  LOAD_NS104  DBB[1116]   // Включение-выключение сообщений
#define  TIME_SG011  DBB[1117]   // Включение-выключение звонка
#define  TIME_SG012  DBB[1118]   // Включение-выключение звонка
#define  TIME_SG013  DBB[1119]   // Включение-выключение сообщений
#define  TIME_SG014  DBB[1120]   // Включение-выключение сообщений
#define  TIME_SLNZ1  DBB[1121]   // Включение-выключение звонка
#define  TIME_SLNZ2  DBB[1122]   // Включение-выключение звонка
#define  TIME_SLNZ3  DBB[1123]   // Включение-выключение сообщений
#define  TIME_SLNZ4  DBB[1124]   // Включение-выключение сообщений
#define  TIME_SLNV1  DBB[1125]   // Включение-выключение звонка
#define  TIME_SLNV2  DBB[1126]   // Включение-выключение звонка
#define  TIME_SLNV3  DBB[1127]   // Включение-выключение сообщений
#define  TIME_SLNV4  DBB[1128]   // Включение-выключение сообщений
#define  LOAD_SLCN1  DBB[1129]   // Включение-выключение звонка
#define  LOAD_SLCN2  DBB[1130]   // Включение-выключение звонка
#define  LOAD_SLCN3  DBB[1131]   // Включение-выключение сообщений
#define  LOAD_SLCN4  DBB[1132]   // Включение-выключение сообщений
#define  TIME_VODL1  DBB[1133]   // Включение-выключение звонка
#define  TIME_VODL2  DBB[1134]   // Включение-выключение звонка
#define  TIME_VODL3  DBB[1135]   // Включение-выключение сообщений
#define  TIME_VODL4  DBB[1136]   // Включение-выключение сообщений
#define  TEMP_VODB1  DBB[1137]   // Включение-выключение звонка
#define  TEMP_VODB2  DBB[1138]   // Включение-выключение звонка
#define  TEMP_VODB3  DBB[1139]   // Включение-выключение сообщений
#define  TEMP_VODB4  DBB[1140]   // Включение-выключение сообщений
#define  TIME_COND1  DBB[1141]   // Включение-выключение звонка
#define  TIME_COND2  DBB[1142]   // Включение-выключение звонка
#define  TIME_COND3  DBB[1143]   // Включение-выключение сообщений
#define  TIME_COND4  DBB[1144]   // Включение-выключение сообщений
#define  TIME_OTHV1  DBB[1145]   // Включение-выключение звонка
#define  TIME_OTHV2  DBB[1146]   // Включение-выключение звонка
#define  TIME_OTHV3  DBB[1147]   // Включение-выключение сообщений
#define  TIME_OTHV4  DBB[1148]   // Включение-выключение сообщений
#define  TIME_NS311  DBB[1149]   // Включение-выключение звонка
#define  TIME_NS312  DBB[1150]   // Включение-выключение звонка
#define  TIME_NS313  DBB[1151]   // Включение-выключение сообщений
#define  TIME_NS314  DBB[1152]   // Включение-выключение сообщений
#define  TIME_NS321  DBB[1153]   // Включение-выключение звонка
#define  TIME_NS322  DBB[1154]   // Включение-выключение звонка
#define  TIME_NS323  DBB[1155]   // Включение-выключение сообщений
#define  TIME_NS324  DBB[1156]   // Включение-выключение сообщений
#define  LOAD_NS081  DBB[1157]   // Включение-выключение звонка
#define  LOAD_NS082  DBB[1158]   // Включение-выключение звонка
#define  LOAD_NS083  DBB[1159]   // Включение-выключение сообщений
#define  LOAD_NS084  DBB[1160]   // Включение-выключение сообщений
#define  TIME_PRDO1  DBB[1161]   // Включение-выключение звонка
#define  TIME_PRDO2  DBB[1162]   // Включение-выключение звонка
#define  TIME_PRDO3  DBB[1163]   // Включение-выключение сообщений
#define  TIME_PRDO4  DBB[1164]   // Включение-выключение сообщений
#define  TIME_GON_1  DBB[1165]   // Включение-выключение звонка
#define  TIME_GON_2  DBB[1166]   // Включение-выключение звонка
#define  TIME_GON_3  DBB[1167]   // Включение-выключение сообщений
#define  TIME_GON_4  DBB[1168]   // Включение-выключение сообщений
#define  TIME_GOFF1  DBB[1169]   // Включение-выключение звонка
#define  TIME_GOFF2  DBB[1170]   // Включение-выключение звонка
#define  TIME_GOFF3  DBB[1171]   // Включение-выключение сообщений
#define  TIME_GOFF4  DBB[1172]   // Включение-выключение сообщений
#define  TIME_BVAJ1  DBB[1173]   // Включение-выключение звонка
#define  TIME_BVAJ2  DBB[1174]   // Включение-выключение звонка
#define  TIME_BVAJ3  DBB[1175]   // Включение-выключение сообщений
#define  TIME_BVAJ4  DBB[1176]   // Включение-выключение сообщений
#define  TMST_CAV_W  DBB[1177]   // Время стабилизации веса цемента аспирации
#define  TMST_CAV_C  DBB[1178]   // Время стабилизации веса цемента аспирации
#define  VSST_CA__W  DBB[1179]   // Вес стабилизации цемента аспирации
#define  VSST_CA__C  DBB[1180]   // Вес стабилизации цемента аспирации
#define  TMST_CBV_W  DBB[1181]   // Время стабилизации веса цемента бункера
#define  TMST_CBV_C  DBB[1182]   // Время стабилизации веса цемента бункера
#define  VSST_CB__W  DBB[1183]   // Вес стабилизации набора цемента бункера
#define  VSST_CB__C  DBB[1184]   // Вес стабилизации набора цемента бункера
#define  TMST_VAV_W  DBB[1185]   // Время стабилизации веса вяжущего аспирации
#define  TMST_VAV_C  DBB[1186]   // Время стабилизации веса вяжущего аспирации
#define  VSST_VA__W  DBB[1187]   // Вес стабилизации вяжущего аспирации
#define  VSST_VA__C  DBB[1188]   // Вес стабилизации вяжущего аспирации
#define  TMST_VBV_W  DBB[1189]   // Время стабилизации веса вяжущего бункера
#define  TMST_VBV_C  DBB[1190]   // Время стабилизации веса вяжущего бункера
#define  TIME_VCONW  DBB[1191]   // Продолжительность включения вибратора цемента
#define  TIME_VCONC  DBB[1192]   // Продолжительность включения вибратора цемента
#define  TMVB_CB__W  DBB[1193]   // Время определ веса вкл вибратора бун цемента
#define  TMVB_CB__C  DBB[1194]   // Время определ веса вкл вибратора бун цемента
#define  VSVB_CB__W  DBB[1195]   // Вес включения вибратора бункера цемента
#define  VSVB_CB__C  DBB[1196]   // Вес включения вибратора бункера цемента
#define  TMVB_VB__W  DBB[1197]   // Время определ веса вкл вибратора бун вяжущего
#define  TMVB_VB__C  DBB[1198]   // Время определ веса вкл вибратора бун вяжущего
#define  VSVB_VB__W  DBB[1199]   // Вес включения вибратора бункера вяжущего
#define  VSVB_VB__C  DBB[1200]   // Вес включения вибратора бункера вяжущего
#define  TIME_VVONW  DBB[1201]   // Продолжительность включения вибратора вяжущего
#define  TIME_VVONC  DBB[1202]   // Продолжительность включения вибратора вяжущего
#define  TMST_VIS_W  DBB[1203]   // Время стабилизации веса выгрузки сухого
#define  TMST_VIS_C  DBB[1204]   // Время стабилизации веса выгрузки сухого
#define  VSST_VIS_W  DBB[1205]   // Вес стабилизации выгрузки сухого
#define  VSST_VIS_C  DBB[1206]   // Вес стабилизации выгрузки сухого
#define  TIME_VIONW  DBB[1207]   // Продолжит включ вибратора выгрузки сухого
#define  TIME_VIONC  DBB[1208]   // Продолжит включ вибратора выгрузки сухого
#define  VSST_VB__W  DBB[1209]   // Вес стабилизации набора вяжущего бункера
#define  VSST_VB__V  DBB[1210]   // Вес стабилизации набора вяжущего бункера
#define  CNST_CB__W  DBB[1211]   // Счетчик проверок стабилизац веса цемента
#define  CNST_CB__C  DBB[1212]   // Счетчик проверок стабилизац веса цемента
#define  CNST_VB__W  DBB[1213]   // Счетчик проверок стабилизац веса вяжущего
#define  CNST_VB__C  DBB[1214]   // Счетчик проверок стабилизац веса вяжущего
#define  TIME_CVPS3  DBB[1215]   // Включение-выключение сообщений
#define  TIME_CVPS4  DBB[1216]   // Включение-выключение сообщений
#define  DONCM_FR_V  DBB[1217]   // Флаг контроля добора веса ТОЧНО цемента
#define  DONVG_FR_V  DBB[1218]   // Флаг контроля добора веса ТОЧНО вяжущего
#define  CNST_MKVIW  DBB[1219]   // Счетчик провер стабилизац веса выгр доз мокр
#define  CNST_MKVIC  DBB[1220]   // Счетчик провер стабилизац веса выгр доз мокр
#define  LOAD_VGGR1  DBB[1221]   // Включение-выключение звонка
#define  LOAD_VGGR2  DBB[1222]   // Включение-выключение звонка
#define  LOAD_VGGR3  DBB[1223]   // Включение-выключение сообщений
#define  LOAD_VGGR4  DBB[1224]   // Включение-выключение сообщений
#define  LOAD_VGTC1  DBB[1225]   // Включение-выключение звонка
#define  LOAD_VGTC2  DBB[1226]   // Включение-выключение звонка
#define  LOAD_VGTC3  DBB[1227]   // Включение-выключение сообщений
#define  LOAD_VGTC4  DBB[1228]   // Включение-выключение сообщений
#define  VSOT_VDP_W  DBB[1229]   // Вес отсечки набора воды промывки
#define  VSOT_VDP_C  DBB[1230]   // Вес отсечки набора воды промывки
#define  VSOT_VDDGW  DBB[1231]   // Вес отсечки воды доливки ГРУБО
#define  VSOT_VDDGC  DBB[1232]   // Вес отсечки воды доливки ГРУБО
#define  VSOT_VDDTW  DBB[1233]   // Вес отсечки воды доливки ТОЧНО
#define  VSOT_VDDTC  DBB[1234]   // Вес отсечки воды доливки ТОЧНО
#define  VSST_VD__W  DBB[1235]   // Вес стабилизации набора воды
#define  VSST_VD__C  DBB[1236]   // Вес стабилизации набора воды
#define  TMST_VD__W  DBB[1237]   // Время стабилизации набора воды
#define  TMST_VD__C  DBB[1238]   // Время стабилизации набора воды
#define  VSOT_OTH_W  DBB[1239]   // Вес отсечки набора отходов
#define  VSOT_OTH_C  DBB[1240]   // Вес отсечки набора отходов
#define  VSOT_SLG_W  DBB[1241]   // Вес отсечки набора шлама ГРУБО
#define  VSOT_SLG_C  DBB[1242]   // Вес отсечки набора шлама ГРУБО
#define  VSOT_SLT_W  DBB[1243]   // Вес отсечки набора шлама ТОЧНО
#define  VSOT_SLT_C  DBB[1244]   // Вес отсечки набора шлама ТОЧНО
#define  VSST_SLG_W  DBB[1245]   // Вес стабилизации набора шлама ГРУБО
#define  VSST_SLG_C  DBB[1246]   // Вес стабилизации набора шлама ГРУБО
#define  TMST_SLG_W  DBB[1247]   // Время стабилизации набора шлама ГРУБО
#define  TMST_SLG_C  DBB[1248]   // Время стабилизации набора шлама ГРУБО
#define  VSST_SLT_W  DBB[1249]   // Вес стабилизации набора шлама ТОЧНО
#define  VSST_SLT_C  DBB[1250]   // Вес стабилизации набора шлама ТОЧНО
#define  TMST_SLT_W  DBB[1251]   // Время стабилизации набора шлама ТОЧНО
#define  TMST_SLT_C  DBB[1252]   // Время стабилизации набора шлама ТОЧНО
#define  CNST_SL__W  DBB[1253]   // Счетчик проверки стабилизации веса шлама
#define  CNST_SL__C  DBB[1254]   // Счетчик проверки стабилизации веса шлама
#define  TMPZ_ZGR_W  DBB[1255]   // Время паузы между загрузкой и выгрузкой
#define  TMPZ_ZGR_C  DBB[1256]   // Время паузы между загрузкой и выгрузкой
#define  VSST_MKVIW  DBB[1257]   // Вес стабилизации выгрузки доз мокрого
#define  VSST_MKVIC  DBB[1258]   // Вес стабилизации выгрузки доз мокрого
#define  TMST_MKVIW  DBB[1259]   // Время стабилизации выгрузки доз мокрого
#define  TMST_MKVIC  DBB[1260]   // Время стабилизации выгрузки доз мокрого
#define  VSDP_OST_W  DBB[1261]   // Допустимый вес остатка мокрого
#define  VSDP_OST_C  DBB[1262]   // Допустимый вес остатка мокрого
#define  VSOT_SSC_W  DBB[1263]   // Вес отсечки шнека цемента
#define  VSOT_SSV_W  DBB[1264]   // Вес отсечки шнека вяжущего
#define  CNST_VVS_W  DBB[1265]   // Счетчик проверок стаб веса выгруз сухого
#define  CNST_VVS_C  DBB[1266]   // Счетчик проверок стаб веса выгруз сухого
#define  VSST_VDP_W  DBB[1267]   // Вес стабилизации набора воды промывки
#define  VSST_VDP_C  DBB[1268]   // Вес стабилизации набора воды промывки
#define  TMST_VDP_W  DBB[1269]   // Время стабилизации набора воды промывки
#define  TMST_VDP_C  DBB[1270]   // Время стабилизации набора воды промывки
#define  CNST_VDP_W  DBB[1271]   // Счетчик стабилизац веса набора воды промывки
#define  CNST_VDP_C  DBB[1272]   // Счетчик стабилизац веса набора воды промывки
#define  TMST_OTH_W  DBB[1273]   // Время стабилизации набора отходов
#define  TMST_OTH_C  DBB[1274]   // Время стабилизации набора отходов
#define  CNST_OTH_W  DBB[1275]   // Счетчик стабилизации набора отходов
#define  CNST_OTH_C  DBB[1276]   // Счетчик стабилизации набора отходов
#define  TIME_LLVC1  DBB[1277]   // Включение-выключение звонка
#define  TIME_LLVC2  DBB[1278]   // Включение-выключение звонка
#define  TIME_LLVC3  DBB[1279]   // Включение-выключение сообщений
#define  TIME_LLVC4  DBB[1280]   // Включение-выключение сообщений
#define  TIME_LLVV1  DBB[1281]   // Включение-выключение звонка
#define  TIME_LLVV2  DBB[1282]   // Включение-выключение звонка
#define  TIME_LLVV3  DBB[1283]   // Включение-выключение сообщений
#define  TIME_LLVV4  DBB[1284]   // Включение-выключение сообщений
#define  TIME_LLVS1  DBB[1285]   // Включение-выключение звонка
#define  TIME_LLVS2  DBB[1286]   // Включение-выключение звонка
#define  TIME_LLVS3  DBB[1287]   // Включение-выключение сообщений
#define  TIME_LLVS4  DBB[1288]   // Включение-выключение сообщений
#define  TIME_LLVO1  DBB[1289]   // Включение-выключение звонка
#define  TIME_LLVO2  DBB[1290]   // Включение-выключение звонка
#define  TIME_LLVO3  DBB[1291]   // Включение-выключение сообщений
#define  TIME_LLVO4  DBB[1292]   // Включение-выключение сообщений
#define  TIME_BCEM1  DBB[1293]   // Включение-выключение звонка
#define  TIME_BCEM2  DBB[1294]   // Включение-выключение звонка
#define  TIME_BCEM3  DBB[1295]   // Включение-выключение сообщений
#define  TIME_BCEM4  DBB[1296]   // Включение-выключение сообщений
#define  DIS011W__V  DBB[1300]   // ВНИМАНИЕ !!!
#define  DIS012W__V  DBB[1301]   // ВНИМАНИЕ !!!
#define  DIS021W__V  DBB[1302]   // ВНИМАНИЕ !!!
#define  DIS022W__V  DBB[1303]   // ВНИМАНИЕ !!!
#define  DIS032W__V  DBB[1304]   // ВНИМАНИЕ !!!
#define  DIS042W__V  DBB[1305]   // ВНИМАНИЕ !!!
#define  DIS052W__V  DBB[1306]   // ВНИМАНИЕ !!!
#define  DIS031W__V  DBB[1307]   // ВНИМАНИЕ !!!
#define  DIS041W__V  DBB[1308]   // ВНИМАНИЕ !!!
#define  DIS051W__V  DBB[1309]   // ВНИМАНИЕ !!!
#define  REZ1310__V  DBB[1310]   // ВНИМАНИЕ !!!
#define  REZ1311__V  DBB[1311]   // ВНИМАНИЕ !!!
#define  REZ1312__V  DBB[1312]   // ВНИМАНИЕ !!!
#define  DIS061W__V  DBB[1313]   // ВНИМАНИЕ !!!
#define  DIS071W__V  DBB[1314]   // ВНИМАНИЕ !!!
#define  DIS081W__V  DBB[1315]   // ВНИМАНИЕ !!!
#define  DIS082W__V  DBB[1316]   // ВНИМАНИЕ !!!
#define  DIS111W__V  DBB[1317]   // ВНИМАНИЕ !!!
#define  DIS112W__V  DBB[1318]   // ВНИМАНИЕ !!!
#define  DIS121W__V  DBB[1319]   // ВНИМАНИЕ !!!
#define  DIS122W__V  DBB[1320]   // ВНИМАНИЕ !!!
#define  DIS101W__V  DBB[1321]   // ВНИМАНИЕ !!!
#define  DIS102W__V  DBB[1322]   // ВНИМАНИЕ !!!
#define  DIS131W__V  DBB[1323]   // ВНИМАНИЕ !!!
#define  DIS132W__V  DBB[1324]   // ВНИМАНИЕ !!!
#define  DIS141W__V  DBB[1325]   // ВНИМАНИЕ !!!
#define  DIS142W__V  DBB[1326]   // ВНИМАНИЕ !!!
#define  DIS143W__V  DBB[1327]   // ВНИМАНИЕ !!!
#define  DIS150W__V  DBB[1328]   // ВНИМАНИЕ !!!
#define  DIS151W__V  DBB[1329]   // ВНИМАНИЕ !!!
#define  DIS152W__V  DBB[1330]   // ВНИМАНИЕ !!!
#define  DIS161W__V  DBB[1331]   // ВНИМАНИЕ !!!
#define  DIS162W__V  DBB[1332]   // ВНИМАНИЕ !!!
#define  DIS171W__V  DBB[1333]   // ВНИМАНИЕ !!!
#define  DIS172W__V  DBB[1334]   // ВНИМАНИЕ !!!
#define  DIS173W__V  DBB[1335]   // ВНИМАНИЕ !!!
#define  DIS180W__V  DBB[1336]   // ВНИМАНИЕ !!!
#define  DIS181W__V  DBB[1337]   // ВНИМАНИЕ !!!
#define  DIS182W__V  DBB[1338]   // ВНИМАНИЕ !!!
#define  DIS191W__V  DBB[1339]   // ВНИМАНИЕ !!!
#define  DIS192W__V  DBB[1340]   // ВНИМАНИЕ !!!
#define  DIS193W__V  DBB[1341]   // ВНИМАНИЕ !!!
#define  DIS201W__V  DBB[1342]   // ВНИМАНИЕ !!!
#define  DIS202W__V  DBB[1343]   // ВНИМАНИЕ !!!
#define  DIS211W__V  DBB[1344]   // ВНИМАНИЕ !!!
#define  DIS212W__V  DBB[1345]   // ВНИМАНИЕ !!!
#define  DIS221W__V  DBB[1346]   // ВНИМАНИЕ !!!
#define  DIS222W__V  DBB[1347]   // ВНИМАНИЕ !!!
#define  DIS231W__V  DBB[1348]   // ВНИМАНИЕ !!!
#define  DIS232W__V  DBB[1349]   // ВНИМАНИЕ !!!
#define  DIS241W__V  DBB[1350]   // ВНИМАНИЕ !!!
#define  DIS250W__V  DBB[1351]   // ВНИМАНИЕ !!!
#define  DIS285W__V  DBB[1352]   // ВНИМАНИЕ !!!
#define  DIS252W__V  DBB[1353]   // ВНИМАНИЕ !!!
#define  DIS261W__V  DBB[1354]   // ВНИМАНИЕ !!!
#define  DIS286W__V  DBB[1355]   // ВНИМАНИЕ !!!
#define  DIS272W__V  DBB[1356]   // ВНИМАНИЕ !!!
#define  DIS273W__V  DBB[1357]   // ВНИМАНИЕ !!!
#define  DIS274W__V  DBB[1358]   // ВНИМАНИЕ !!!
#define  DIS281W__V  DBB[1359]   // ВНИМАНИЕ !!!
#define  DIS291W__V  DBB[1360]   // ВНИМАНИЕ !!!
#define  DIS301W__V  DBB[1361]   // ВНИМАНИЕ !!!
#define  DIS31AW__V  DBB[1362]   // ВНИМАНИЕ !!!
#define  DIS311W__V  DBB[1363]   // ВНИМАНИЕ !!!
#define  DIS312W__V  DBB[1364]   // ВНИМАНИЕ !!!
#define  DIS313W__V  DBB[1365]   // ВНИМАНИЕ !!!
#define  DIS314W__V  DBB[1366]   // ВНИМАНИЕ !!!
#define  DIS316W__V  DBB[1367]   // ВНИМАНИЕ !!!
#define  DIS317W__V  DBB[1368]   // ВНИМАНИЕ !!!
#define  DIS203W__V  DBB[1369]   // ВНИМАНИЕ !!!
#define  DIS223W__V  DBB[1370]   // ВНИМАНИЕ !!!
#define  DON312___V  DBB[1390]   // Вибратор ВГБМ
#define  DON313___V  DBB[1391]   // Вибратор ВГБМ
#define  DON314___V  DBB[1392]   // Вибратор ВГБМ
#define  FL_ZALIV_V  DBB[1400]   // Флаг прижима герметизатора
#define  CHAN_GOM1W  DBB[1401]   // Выбор для следующего цикла подкачки гомогенизатора N1
#define  CHAN_GOM2W  DBB[1402]   // Выбор для следующего цикла подкачки гомогенизатора N2
#define  TIME_LEV5M  DBB[1403]   // Время сработки уровня насоса цемента
#define  TIME_LEV5V  DBB[1404]   // Время сработки уровня насоса цемента
#define  TIME_LEV5C  DBB[1405]   // Время сработки уровня насоса цемента
#define  TIME_OSC5M  DBB[1406]   // Время ожидания сигнала от оператора склада цемента
#define  TIME_OSC5V  DBB[1407]   // Время ожидания сигнала от оператора склада цемента
#define  TIME_OSC5C  DBB[1408]   // Время ожидания сигнала от оператора склада цемента
#define  TIME_NAS5M  DBB[1409]   // Время выгрузки пневмонасоса цемента
#define  TIME_NAS5V  DBB[1410]   // Время выгрузки пневмонасоса цемента
#define  TIME_NAS5C  DBB[1411]   // Время выгрузки пневмонасоса цемента
#define  LOAD_NS10M  DBB[1412]   // Количество пневмонасосов загруженных в бункер цемента
#define  LOAD_NS10V  DBB[1413]   // Количество пневмонасосов загруженных в бункер цемента
#define  LOAD_NS10C  DBB[1414]   // Количество пневмонасосов загруженных в бункер цемента
#define  CHAN_GOM1V  DBB[1415]   // Выбор гомогенизатора 1
#define  CHAN_GOM2V  DBB[1416]   // Выбор гомогенизатора 2
#define  TIME_GON_M  DBB[1417]   // Время работы клапана воздуха гомогенизатора
#define  TIME_GON_V  DBB[1418]   // Время работы клапана воздуха гомогенизатора
#define  TIME_GON_C  DBB[1419]   // Время работы клапана воздуха гомогенизатора
#define  TIME_GOFFM  DBB[1420]   // Время паузы включений клапана воздуха гомогенизатора
#define  TIME_GOFFV  DBB[1421]   // Время паузы включений клапана воздуха гомогенизатора
#define  TIME_GOFFC  DBB[1422]   // Время паузы включений клапана воздуха гомогенизатора
#define  TIME_BVAJM  DBB[1423]   // Время ожидания сработки верхнего уровня бункера вяжущего
#define  TIME_BVAJV  DBB[1424]   // Время ожидания сработки верхнего уровня бункера вяжущего
#define  TIME_BVAJC  DBB[1425]   // Время ожидания сработки верхнего уровня бункера вяжущего
#define  TIME_VODMM  DBB[1426]   // Время ожидания сред уровня сборника воды
#define  TIME_VODMV  DBB[1427]   // Время ожидания сред уровня сборника воды
#define  TIME_VODMC  DBB[1428]   // Время ожидания сред уровня сборника воды
#define  TEMP_VODBM  DBB[1429]   // Температура выключения подачи конденсата в сборник воды
#define  TEMP_VODBV  DBB[1430]   // Температура выключения подачи конденсата в сборник воды
#define  TIME_CONDM  DBB[1431]   // Время отведенное для закачки конденсата
#define  TIME_CONDV  DBB[1432]   // Время отведенное для закачки конденсата
#define  TIME_CONDC  DBB[1433]   // Время отведенное для закачки конденсата
#define  TIME_OTHVM  DBB[1434]   // Время подачи воды в Мешалку отходов РК
#define  TIME_OTHVV  DBB[1435]   // Время подачи воды в Мешалку отходов РК
#define  TIME_OTHVC  DBB[1436]   // Время подачи воды в Мешалку отходов РК
#define  TIME_NS31M  DBB[1438]   // Время загруз пн.насоса отходов, если не сработал уровень
#define  TIME_NS31V  DBB[1439]   // Время загруз пн.насоса отходов, если не сработал уровень
#define  TIME_NS31C  DBB[1440]   // Время загруз пн.насоса отходов, если не сработал уровень
#define  TIME_NS32M  DBB[1441]   // Время выгрузки пн.насоса отходов
#define  TIME_NS32V  DBB[1442]   // Время выгрузки пн.насоса отходов
#define  TIME_NS32C  DBB[1443]   // Время выгрузки пн.насоса отходов
#define  LOAD_NS08M  DBB[1444]   // Количество пневмонасосов загруженных в мешалку отходов
#define  LOAD_NS08V  DBB[1445]   // Количество пневмонасосов загруженных в мешалку отходов
#define  LOAD_NS08C  DBB[1446]   // Количество пневмонасосов загруженных в мешалку отходов
#define  TIME_PRDOM  DBB[1447]   // Время продувки пн.насоса отходов
#define  TIME_PRDOV  DBB[1448]   // Время продувки пн.насоса отходов
#define  TIME_PRDOC  DBB[1449]   // Время продувки пн.насоса отходов
#define  TIME_ISPKM  DBB[1450]   // Время сработки пневмо клапанов
#define  TIME_ISPKV  DBB[1451]   // Время сработки пневмо клапанов
#define  TIME_ISPKC  DBB[1452]   // Время сработки пневмо клапанов
#define  CNST_VDD_W  DBB[1453]   // Счетчик стабил веса набора воды доливки
#define  CNST_VDD_V  DBB[1454]   // Счетчик стабил веса набора воды доливки
#define  CNST_VDD_C  DBB[1455]   // Счетчик стабил веса набора воды доливки
#define  TIME_ISNSM  DBB[1456]   // Время сработки насосов
#define  TIME_ISNSV  DBB[1457]   // Время сработки насосов
#define  TIME_ISNSC  DBB[1458]   // Время сработки насосов
#define  TIME_ISPRM  DBB[1459]   // Время сработки приводов
#define  TIME_ISPRV  DBB[1460]   // Время сработки приводов
#define  TIME_ISPRC  DBB[1461]   // Время сработки приводов
#define  TIME_ISVBM  DBB[1462]   // Время сработки вибраторов
#define  TIME_ISVBV  DBB[1463]   // Время сработки вибраторов
#define  TIME_ISVBC  DBB[1464]   // Время сработки вибраторов
#define  VSOT_SHV_W  DBB[1465]   // Вес отсечки при выгруз веса рецепта
#define  VSOT_SHV_C  DBB[1466]   // Вес отсечки при выгруз веса рецепта
#define  VGR_SHALLM  DBB[1467]   // Выгрузка из доз сух всех компонентов
#define  VGR_SHALLV  DBB[1468]   // Выгрузка из доз сух всех компонентов
#define  VGR_SHALLC  DBB[1469]   // Выгрузка из доз сух всех компонентов
#define  VGR_SHRECM  DBB[1470]   // Выгрузка из доз сух рецептного веса
#define  VGR_SHRECV  DBB[1471]   // Выгрузка из доз сух рецептного веса
#define  VGR_SHRECC  DBB[1472]   // Выгрузка из доз сух рецептного веса
#define  VGR_SHIZLM  DBB[1473]   // Выгрузить вес до рецептного в дозаторе
#define  VGR_SHIZLV  DBB[1474]   // Выгрузить вес до рецептного в дозаторе
#define  VGR_SHIZLC  DBB[1475]   // Выгрузить вес до рецептного в дозаторе
#define  VGR_SHNV_V  DBB[1476]   // Номер выбора выгрузки из доз сухого
#define  LOAD_CCGRW  DBB[1477]   // Вес отсечки набора цемента клапана ГРУБО
#define  LOAD_CCGRC  DBB[1478]   // Вес отсечки набора цемента клапана ГРУБО
#define  LOAD_CCTCW  DBB[1479]   // Вес отсечки набора цемента клапана ТОЧНО
#define  LOAD_CCTCC  DBB[1480]   // Вес отсечки набора цемента клапана ТОЧНО
#define  TMKV_PDC_W  DBB[1481]   // Время включ клапан возд перед дозир цемента
#define  TMKV_PDC_C  DBB[1482]   // Время включ клапан возд перед дозир цемента
#define  TMKV_RDC_W  DBB[1483]   // Время включ клапан возд во врем дозир цемента
#define  TMKV_RDC_C  DBB[1484]   // Время включ клапан возд во врем дозир цемента
#define  TMKV_PDV_W  DBB[1485]   // Время включ клапан возд перед дозир вяжущего
#define  TMKV_PDV_C  DBB[1486]   // Время включ клапан возд перед дозир вяжущего
#define  TMKV_RDV_W  DBB[1487]   // Время включ клапан возд во врем дозир вяжущ
#define  TMKV_RDV_C  DBB[1488]   // Время включ клапан возд во врем дозир вяжущ
#define  AIW190PVZV  DBB[1489]   // Вес дозатора сухого перед выгрузкой
#define  TIME_CVPSW  DBB[1490]   // Пауза между набором компонентов сухого
#define  TIME_CVPSV  DBB[1491]   // Пауза между набором компонентов сухого
#define  TIME_CVPSC  DBB[1492]   // Пауза между набором компонентов сухого
#define  VSST_OTH_W  DBB[1493]   // Вес стабилизации набора отходов
#define  VSST_OTH_V  DBB[1494]   // Вес стабилизации набора отходов
#define  VSST_OTH_C  DBB[1495]   // Вес стабилизации набора отходов
#define  LOAD_VGGRW  DBB[1496]   // Вес отсечки набора вяжущего клапана ГРУБО
#define  LOAD_VGGRC  DBB[1497]   // Вес отсечки набора вяжущего клапана ГРУБО
#define  LOAD_VGTCW  DBB[1498]   // Вес отсечки набора вяжущего клапана ТОЧНО
#define  LOAD_VGTCC  DBB[1499]   // Вес отсечки набора вяжущего клапана ТОЧНО
#define  TIME_SLNZM  DBB[1500]   // Время загрузки пн.насоса шлама
#define  TIME_SLNZV  DBB[1501]   // Время загрузки пн.насоса шлама
#define  TIME_SLNZC  DBB[1502]   // Время загрузки пн.насоса шлама
#define  TIME_SLNVM  DBB[1503]   // Время выгрузки пн.насоса шлама
#define  TIME_SLNVV  DBB[1504]   // Время выгрузки пн.насоса шлама
#define  TIME_SLNVC  DBB[1505]   // Время выгрузки пн.насоса шлама
#define  LOAD_SLCNM  DBB[1506]   // Кол-во загруженных пн.насосов шлама
#define  LOAD_SLCNV  DBB[1507]   // Кол-во загруженных пн.насосов шлама
#define  LOAD_SLCNC  DBB[1508]   // Кол-во загруженных пн.насосов шлама
#define  CVVODP___V  DBB[1509]   // Реально набранный вес воды промывки
#define  ch1510___v  DBB[1510]   // 
#define  ch1511___v  DBB[1511]   // 
#define  CHAN_MODEW  DBB[1512]   // Выбор режима дозировки мокрого
#define  CHAN_MODEC  DBB[1513]   // Выбор режима дозировки мокрого
#define  TIME_PIMNW  DBB[1514]   // Длительность импульса набора
#define  TIME_PIMNC  DBB[1515]   // Длительность импульса набора
#define  TIME_PIMPW  DBB[1516]   // Длительность импульса паузы
#define  TIME_PIMPC  DBB[1517]   // Длительность импульса паузы
#define  MODE_PIMZW  DBB[1518]   // Вес включ импульс режима загрузки дозатора
#define  MODE_PIMZC  DBB[1519]   // Вес включ импульс режима загрузки дозатора
#define  CNST_PAN_W  DBB[1520]   // Счетчик стабилизации набора пасты
#define  CNST_PAN_C  DBB[1521]   // Счетчик стабилизации набора пасты
#define  VSST_PAVIW  DBB[1522]   // Вес стабилизации выгрузки пасты
#define  VSST_PAVIC  DBB[1523]   // Вес стабилизации выгрузки пасты
#define  TMST_PAVIW  DBB[1524]   // Время стабилизации выгрузки пасты
#define  TMST_PAVIC  DBB[1525]   // Время стабилизации выгрузки пасты
#define  CNST_PAVIW  DBB[1526]   // Счетчик стабилизации выгрузки пасты
#define  CNST_PAVIC  DBB[1527]   // Счетчик стабилизации выгрузки пасты
#define  VSOS_PAVIW  DBB[1528]   // Допустимый вес остатка в дозаторе пасты
#define  VSOS_PAVIC  DBB[1529]   // Допустимый вес остатка в дозаторе пасты
#define  TMWT_VODDW  DBB[1530]   // Пауза перед набором воды
#define  TMWT_VODDC  DBB[1531]   // Пауза перед набором воды
#define  FNOTH____W  DBB[1532]   // Флаг набора отходов
#define  FNOTH____V  DBB[1533]   // Флаг набора отходов
#define  FNSLM____W  DBB[1534]   // Флаг набора шлама
#define  FNSLM____V  DBB[1535]   // Флаг набора шлама
#define  TIME_LLVCM  DBB[1536]   // Время ожид набор нижн уровня бункер цемента
#define  TIME_LLVCV  DBB[1537]   // Время ожид набор нижн уровня бункер цемента
#define  TIME_LLVCC  DBB[1538]   // Время ожид набор нижн уровня бункер цемента
#define  TIME_LLVVM  DBB[1539]   // Время ожид набор нижн уровня бункер вяжущих
#define  TIME_LLVVV  DBB[1540]   // Время ожид набор нижн уровня бункер вяжущих
#define  TIME_LLVVC  DBB[1541]   // Время ожид набор нижн уровня бункер вяжущих
#define  TIME_LLVOM  DBB[1542]   // Время набора нижнего уровня мешалки отходов
#define  TIME_LLVOV  DBB[1543]   // Время набора нижнего уровня мешалки отходов
#define  TIME_LLVOC  DBB[1544]   // Время набора нижнего уровня мешалки отходов
#define  TIME_LLVSM  DBB[1545]   // Время ожид набор нижн уровня мешалки шлама
#define  TIME_LLVSV  DBB[1546]   // Время ожид набор нижн уровня мешалки шлама
#define  TIME_LLVSC  DBB[1547]   // Время ожид набор нижн уровня мешалки шлама
#define  TIME_BCEMM  DBB[1548]   // Время ожид сработ сигнал верх уровня бунк цемента
#define  TIME_BCEMV  DBB[1549]   // Время ожид сработ сигнал верх уровня бунк цемента
#define  TIME_BCEMC  DBB[1550]   // Время ожид сработ сигнал верх уровня бунк цемента
#define  TIME_PRDCM  DBB[1551]   // Время продувки пн.насоса цемента
#define  TIME_PRDCV  DBB[1552]   // Время продувки пн.насоса цемента
#define  TIME_PRDCC  DBB[1553]   // Время продувки пн.насоса цемента
#define  TIME_PRDSM  DBB[1554]   // Время продувки пн.насоса шлама
#define  TIME_PRDSV  DBB[1555]   // Время продувки пн.насоса шлама
#define  TIME_PRDSC  DBB[1556]   // Время продувки пн.насоса шлама
#define  MODE_PVIGW  DBB[1557]   // Режим выгрузки дозатора ал.пасты
#define  VSBG_SHDZV  DBB[1558]   // Начальный вес дозатора сухого
#define  FNVODP___W  DBB[1559]   // Флаг набора воды промывки
#define  FNVODP___V  DBB[1560]   // Флаг набора воды промывки
#define  FNVODD___W  DBB[1561]   // Флаг набора воды доливки
#define  FNVODD___V  DBB[1562]   // Флаг набора воды доливки
#define  TIME_PRDC1  DBB[1563]   // Включение-выключение звонка
#define  TIME_PRDC2  DBB[1564]   // Включение-выключение звонка
#define  TIME_PRDC3  DBB[1565]   // Включение-выключение сообщений
#define  TIME_PRDC4  DBB[1566]   // Включение-выключение сообщений
#define  TIME_PRDS1  DBB[1567]   // Включение-выключение звонка
#define  TIME_PRDS2  DBB[1568]   // Включение-выключение звонка
#define  TIME_PRDS3  DBB[1569]   // Включение-выключение сообщений
#define  TIME_PRDS4  DBB[1570]   // Включение-выключение сообщений
#define  TIME_PCASM  DBB[1571]   // Время выкл аспир цемента после продувки
#define  TIME_PCASV  DBB[1572]   // Время выкл аспир цемента после продувки
#define  TIME_PCASC  DBB[1573]   // Время выкл аспир цемента после продувки
#define  TIME_PCAS1  DBB[1574]   // Включение-выключение звонка
#define  TIME_PCAS2  DBB[1575]   // Включение-выключение звонка
#define  TIME_PCAS3  DBB[1576]   // Включение-выключение сообщений
#define  TIME_PCAS4  DBB[1577]   // Включение-выключение сообщений
#define  LOAD_SVPVW  DBB[1578]   // Вес порции выгрузки из дозатора сухого
#define  LOAD_SVPVC  DBB[1579]   // Вес порции выгрузки из дозатора сухого
#define  TIME_PONVW  DBB[1580]   // Время паузы между выгрузкой порций из доз сух
#define  TIME_PONVC  DBB[1581]   // Время паузы между выгрузкой порций из доз сух
#define  FNSLMVOD_W  DBB[1582]   // Флаг набора остатка шлама+вода
#define  FNSLMVOD_V  DBB[1583]   // Флаг набора остатка шлама+вода
#define  MKVG_IZS_W  DBB[1584]   // Флаг выгрузки излишка шлама
#define  MKVG_IZS_V  DBB[1585]   // Флаг выгрузки излишка шлама
#define  MKVG_REC_W  DBB[1586]   // Флаг выгрузки рецепта воды
#define  MKVG_REC_V  DBB[1587]   // Флаг выгрузки рецепта воды
#define  TIME_PAVZM  DBB[1588]   // Время ожидания засыпки ПАВ
#define  TIME_PAVZV  DBB[1589]   // Время ожидания засыпки ПАВ
#define  TIME_PAVZC  DBB[1590]   // Время ожидания засыпки ПАВ
#define  TEMP_PAVDM  DBB[1591]   // Температура дозировки ПАВ
#define  TEMP_PAVDV  DBB[1592]   // Температура дозировки ПАВ
#define  TIME_PPM1M  DBB[1593]   // Время перемешивания ПАВ
#define  TIME_PPM1V  DBB[1594]   // Время перемешивания ПАВ
#define  TIME_PPM1C  DBB[1595]   // Время перемешивания ПАВ
#define  TIME_PNOFM  DBB[1596]   // Время выкл насоса после НУ ниж меш ал.пасты
#define  TIME_PNOFV  DBB[1597]   // Время выкл насоса после НУ ниж меш ал.пасты
#define  TIME_PNOFC  DBB[1598]   // Время выкл насоса после НУ ниж меш ал.пасты
#define  VIGR_PVOTW  DBB[1599]   // Вес отсечки выгрузки из дозатора ал.пасты
#define  REG01R___M  DBB[1600]   // Включение регулятора Подкачка шлама
#define  REG01R___V  DBB[1601]   // Включение регулятора Подкачка шлама
#define  REG01S___M  DBB[1602]   // Текущий шаг регулятора Подкачка шлама
#define  REG01S___V  DBB[1603]   // Текущий шаг регулятора Подкачка шлама
#define  REG01S1__V  DBB[1604]   // Текущий шаг регулятора Подкачка шлама
#define  REG01TCW_V  DBB[1605]   // Время контроля работы регулятора
#define  REG01TCW_M  DBB[1606]   // Время контроля работы регулятора
#define  REG01R3__V  DBB[1607]   // Резерв
#define  REG01R4__M  DBB[1608]   // Резерв
#define  REG02R___M  DBB[1610]   // Включение регулятора Подкачка воды
#define  REG02R___V  DBB[1611]   // Включение регулятора Подкачка воды
#define  REG02S___M  DBB[1612]   // Текущий шаг регулятора Подкачка воды
#define  REG02S___V  DBB[1613]   // Текущий шаг регулятора Подкачка воды
#define  REG02S1__V  DBB[1614]   // Текущий шаг регулятора Подкачка воды
#define  REG02TCW_V  DBB[1615]   // Время контроля работы регулятора
#define  REG02TCW_M  DBB[1616]   // Время контроля работы регулятора
#define  REG02R3__V  DBB[1617]   // Резерв
#define  REG02R4__M  DBB[1618]   // Резерв
#define  REG09GL__M  DBB[1619]   // Общий-локальный режим работы регулятора
#define  REG03R___M  DBB[1620]   // Включение регулятора Подкачка отходов
#define  REG03R___V  DBB[1621]   // Включение регулятора Подкачка отходов
#define  REG03S___M  DBB[1622]   // Текущий шаг регулятора Подкачка отходов
#define  REG03S___V  DBB[1623]   // Текущий шаг регулятора Подкачка отходов
#define  REG03S1__V  DBB[1624]   // Текущий шаг регулятора Подкачка отходов
#define  REG03TCW_V  DBB[1625]   // Время контроля работы регулятора
#define  REG03TCW_M  DBB[1626]   // Время контроля работы регулятора
#define  REG03R3__V  DBB[1627]   // Резерв
#define  REG03R4__M  DBB[1628]   // Резерв
#define  REG04R___M  DBB[1630]   // Включение регулятора Подкачка вяжущего
#define  REG04R___V  DBB[1631]   // Включение регулятора Подкачка вяжущего
#define  REG04S___M  DBB[1632]   // Текущий шаг регулятора Подкачка вяжущего
#define  REG04S___V  DBB[1633]   // Текущий шаг регулятора Подкачка вяжущего
#define  REG04S1__V  DBB[1634]   // Текущий шаг регулятора Подкачка вяжущего
#define  REG04TCW_V  DBB[1635]   // Время контроля работы регулятора
#define  REG04TCW_M  DBB[1636]   // Время контроля работы регулятора
#define  REG04R3__V  DBB[1637]   // Резерв
#define  REG04R4__M  DBB[1638]   // Резерв
#define  REG07GL__M  DBB[1639]   // Общий-локальный режим работы регулятора
#define  REG05R___M  DBB[1640]   // Включение регулятора Подкачка цемента
#define  REG05R___V  DBB[1641]   // Включение регулятора Подкачка цемента
#define  REG05S___M  DBB[1642]   // Текущий шаг регулятора Подкачка цемента
#define  REG05S___V  DBB[1643]   // Текущий шаг регулятора Подкачка цемента
#define  REG05S1__V  DBB[1644]   // Текущий шаг регулятора Подкачка цемента
#define  REG05TCW_V  DBB[1645]   // Время контроля работы регулятора
#define  REG05TCW_M  DBB[1646]   // Время контроля работы регулятора
#define  REG05R3__V  DBB[1647]   // Резерв
#define  REG05R4__M  DBB[1648]   // Резерв
#define  REG06GL__M  DBB[1649]   // Общий-локальный режим работы регулятора
#define  REG06R___M  DBB[1650]   // Включение регулятора Дозировка сухого
#define  REG06R___V  DBB[1651]   // Включение регулятора Дозировка сухого
#define  REG06S___M  DBB[1652]   // Текущий шаг регулятора Дозировка сухого
#define  REG06S___V  DBB[1653]   // Текущий шаг регулятора Дозировка сухого
#define  REG06S1__V  DBB[1654]   // Текущий шаг регулятора Дозировка сухого
#define  REG06TCW_V  DBB[1655]   // Время контроля работы регулятора
#define  REG06TCW_M  DBB[1656]   // Время контроля работы регулятора
#define  REG06ZV__V  DBB[1657]   // Выбор режима загрузки-выгрузки
#define  REG06ZV__M  DBB[1658]   // Выбор режима загрузки-выгрузки
#define  REG06GL__V  DBB[1659]   // Общий-локальный режим работы регулятора
#define  REG07R___M  DBB[1660]   // Включение регулятора Дозировка мокрого
#define  REG07R___V  DBB[1661]   // Включение регулятора Дозировка мокрого
#define  REG07S___M  DBB[1662]   // Текущий шаг регулятора Дозировка мокрого
#define  REG07S___V  DBB[1663]   // Текущий шаг регулятора Дозировка мокрого
#define  REG07S1__V  DBB[1664]   // Текущий шаг регулятора Дозировка мокрого
#define  REG07TCW_V  DBB[1665]   // Время контроля работы регулятора
#define  REG07TCW_M  DBB[1666]   // Время контроля работы регулятора
#define  REG07ZV__V  DBB[1667]   // Выбор режима загрузки-выгрузки
#define  REG07ZV__M  DBB[1668]   // Выбор режима загрузки-выгрузки
#define  REG07GL__V  DBB[1669]   // Общий-локальный режим работы регулятора
#define  MODE_PIMVW  DBB[1670]   // Вес включ импульс режима выгрузки
#define  TIME_PIVVW  DBB[1671]   // Длительность импульса выгрузки
#define  TIME_PIVVC  DBB[1672]   // Длительность импульса выгрузки
#define  TIME_PIVPW  DBB[1673]   // Длительность импульса паузы выгрузки
#define  TIME_PIVPC  DBB[1674]   // Длительность импульса паузы выгрузки
#define  ch1675___v  DBB[1675]   // 
#define  ch1676___v  DBB[1676]   // 
#define  ch1677___v  DBB[1677]   // 
#define  ch1678___v  DBB[1678]   // 
#define  ch1679___v  DBB[1679]   // 
#define  REG09R___M  DBB[1680]   // Включение регулятора Дозировка пасты
#define  REG09R___V  DBB[1681]   // Включение регулятора Дозировка пасты
#define  REG09S___M  DBB[1682]   // Текущий шаг регулятора Дозировка пасты
#define  REG09S___V  DBB[1683]   // Текущий шаг регулятора Дозировка пасты
#define  REG09S1__V  DBB[1684]   // Текущий шаг регулятора Дозировка пасты
#define  REG09TCW_V  DBB[1685]   // Время контроля работы регулятора
#define  REG09TCW_M  DBB[1686]   // Время контроля работы регулятора
#define  REG09ZV__V  DBB[1687]   // Выбор режима загрузки-выгрузки
#define  REG09ZV__M  DBB[1688]   // Выбор режима загрузки-выгрузки
#define  REG09GL__V  DBB[1689]   // Общий-локальный режим работы регулятора
#define  REG10R___M  DBB[1690]   // Включение регулятора Подкачки ПАВ
#define  REG10R___V  DBB[1691]   // Включение регулятора Подкачки ПАВ
#define  REG10S___M  DBB[1692]   // Текущий шаг регулятора Подкачки ПАВ
#define  REG10S___V  DBB[1693]   // Текущий шаг регулятора Подкачки ПАВ
#define  REG10S1__V  DBB[1694]   // Текущий шаг регулятора Подкачки ПАВ
#define  REG10TCW_V  DBB[1695]   // Время контроля работы регулятора
#define  REG10TCW_M  DBB[1696]   // Время контроля работы регулятора
#define  TIME_VODHM  DBB[1697]   // Время ожидания верх уровня сборника воды
#define  TIME_VODHV  DBB[1698]   // Время ожидания верх уровня сборника воды
#define  TIME_VODHC  DBB[1699]   // Время ожидания верх уровня сборника воды
#define  AOT050__UM  DBB[1700]   // Дискретное управление регулятором
#define  AOT050__UV  DBB[1701]   // Дискретное управление регулятором
#define  AOT050__XV  DBB[1702]   // Разница между шагами регулятора
#define  AOT050__XO  DBB[1703]   // Выход регулятора на предыдущем шаге
#define  AOT050_CPV  DBB[1704]   // Длинна импульса
#define  AOT050_CWV  DBB[1705]   // Длинна паузы между импульсами
#define  AOT040__UM  DBB[1706]   // Дискретное управление регулятором
#define  AOT040__UV  DBB[1707]   // Дискретное управление регулятором
#define  AOT040__XV  DBB[1708]   // Разница между шагами регулятора
#define  AOT040__XO  DBB[1709]   // Выход регулятора на предыдущем шаге
#define  AOT040_CPV  DBB[1710]   // Длинна импульса
#define  AOT040_CWV  DBB[1711]   // Длинна паузы между импульсами
#define  AOT030__UM  DBB[1712]   // Дискретное управление регулятором
#define  AOT030__UV  DBB[1713]   // Дискретное управление регулятором
#define  AOT030__XV  DBB[1714]   // Разница между шагами регулятора
#define  AOT030__XO  DBB[1715]   // Выход регулятора на предыдущем шаге
#define  AOT030_CPV  DBB[1716]   // Длинна импульса
#define  AOT030_CWV  DBB[1717]   // Длинна паузы между импульсами
#define  AOT270__UM  DBB[1718]   // Дискретное управление регулятором
#define  AOT270__UV  DBB[1719]   // Дискретное управление регулятором
#define  AOT270__XV  DBB[1720]   // Разница между шагами регулятора
#define  AOT270__XO  DBB[1721]   // Выход регулятора на предыдущем шаге
#define  AOT270_CPV  DBB[1722]   // Длинна импульса
#define  AOT270_CWV  DBB[1723]   // Длинна паузы между импульсами
#define  DIR031SETM  DBB[1724]   // Выбор насоса ШБ N1 для закачек шлама
#define  DIR031SETV  DBB[1725]   // Выбор насоса ШБ N1 для закачек шлама
#define  DIR041SETM  DBB[1726]   // Выбор насоса ШБ N2 для закачек шлама
#define  DIR041SETV  DBB[1727]   // Выбор насоса ШБ N2 для закачек шлама
#define  DIR051SETM  DBB[1728]   // Выбор насоса ШБ N3 для закачек шлама
#define  DIR051SETV  DBB[1729]   // Выбор насоса ШБ N3 для закачек шлама
#define  DIR031NEXV  DBB[1730]   // Выбор насоса ШБ N1 для следующих закачек шлама
#define  DIR041NEXV  DBB[1731]   // Выбор насоса ШБ N2 для следующих закачек шлама
#define  DIR051NEXV  DBB[1732]   // Выбор насоса ШБ N3 для следующих закачек шлама
#define  TIME_PAVSW  DBB[1733]   // Время стабилизации набора пасты
#define  TIME_PAVSV  DBB[1734]   // Время стабилизации набора пасты
#define  TIME_PAVSC  DBB[1735]   // Время стабилизации набора пасты
#define  LOAD_PAVSW  DBB[1736]   // Вес стабилизации набора пасты
#define  LOAD_PAVSC  DBB[1737]   // Вес стабилизации набора пасты
#define  LOAD_PAVOW  DBB[1738]   // Вес отсечки набора пасты
#define  LOAD_PAVOC  DBB[1739]   // Вес отсечки набора пасты
#define  ch1740___v  DBB[1740]   // 
#define  ch1741___v  DBB[1741]   // 
#define  ch1742___v  DBB[1742]   // 
#define  ch1743___v  DBB[1743]   // 
#define  ch1744___v  DBB[1744]   // 
#define  ch1745___v  DBB[1745]   // 
#define  ch1746___v  DBB[1746]   // 
#define  ch1747___v  DBB[1747]   // 
#define  ch1748___v  DBB[1748]   // 
#define  TIME_PVASM  DBB[1749]   // Время выкл аспир вяжущего после продувки
#define  TIME_PVASV  DBB[1750]   // Время выкл аспир вяжущего после продувки
#define  TIME_PVASC  DBB[1751]   // Время выкл аспир вяжущего после продувки
#define  TIME_LSTBM  DBB[1752]   // Время стабилизации уровней
#define  TIME_LSTBV  DBB[1753]   // Время стабилизации уровней
#define  TIME_SHVVW  DBB[1754]   // Время выкл вентилят выгрузки после выгр сухого
#define  TIME_SHVVC  DBB[1755]   // Время выкл вентилят выгрузки после выгр сухого
#define  CH1756___V  DBB[1756]   // 
#define  TIME_HLVOW  DBB[1757]   // Время набора верхнего уровня мешалки отходов
#define  TIME_HLVOC  DBB[1758]   // Время набора верхнего уровня мешалки отходов
#define  TIME_CMPKW  DBB[1759]   // Время паузы между включениями исполнителей
#define  TIME_CMPKC  DBB[1760]   // Время паузы между включениями исполнителей
#define  TIME_VJPKW  DBB[1761]   // Время паузы между включениями исполнителей
#define  TIME_VJPKC  DBB[1762]   // Время паузы между включениями исполнителей
#define  TIME_OTPKW  DBB[1763]   // Время паузы между включениями исполнителей
#define  TIME_OTPKC  DBB[1764]   // Время паузы между включениями исполнителей
#define  TIME_VDPKW  DBB[1765]   // Время паузы между включениями исполнителей
#define  TIME_VDPKC  DBB[1766]   // Время паузы между включениями исполнителей
#define  TIME_SLPKW  DBB[1767]   // Время паузы между включениями исполнителей
#define  TIME_SLPKC  DBB[1768]   // Время паузы между включениями исполнителей
#define  TIME_HLVSW  DBB[1769]   // Время набора верхнего уровня мешалки шлама
#define  TIME_HLVSC  DBB[1770]   // Время набора верхнего уровня мешалки шлама
#define  RECEPT_01M  DBB[1800]   // Выбор Рецепта 1
#define  RECEPT_01V  DBB[1801]   // Выбор Рецепта 1
#define  RECEPT_02M  DBB[1802]   // Выбор Рецепта 2
#define  RECEPT_02V  DBB[1803]   // Выбор Рецепта 2
#define  RECEPT_03M  DBB[1804]   // Выбор Рецепта 3
#define  RECEPT_03V  DBB[1805]   // Выбор Рецепта 3
#define  RECEPT_04M  DBB[1806]   // Выбор Рецепта 4
#define  RECEPT_04V  DBB[1807]   // Выбор Рецепта 4
#define  RECEPT_05M  DBB[1808]   // Выбор Рецепта 5
#define  RECEPT_05V  DBB[1809]   // Выбор Рецепта 5
#define  TRCEMA_01M  DBB[1810]   // Рецепт 1 загрузки цемента из аспирации
#define  TRCEMA_01V  DBB[1811]   // Рецепт 1 загрузки цемента из аспирации
#define  TRCEMS_01M  DBB[1812]   // Рецепт 1 загрузки цемента общий
#define  TRCEMS_01V  DBB[1813]   // Рецепт 1 загрузки цемента общий
#define  TRVYGA_01M  DBB[1814]   // Рецепт 1 загрузки вяжущего из аспирации
#define  TRVYGA_01V  DBB[1815]   // Рецепт 1 загрузки вяжущего из аспирации
#define  TRVYGS_01M  DBB[1816]   // Рецепт 1 загрузки вяжущего общий
#define  TRVYGS_01V  DBB[1817]   // Рецепт 1 загрузки вяжущего общий
#define  TRVODP_01M  DBB[1818]   // Рецепт 1 загрузки воды промывки
#define  TRVODP_01V  DBB[1819]   // Рецепт 1 загрузки воды промывки
#define  TROTH__01M  DBB[1820]   // Рецепт 1 загрузки отходов
#define  TROTH__01V  DBB[1821]   // Рецепт 1 загрузки отходов
#define  TRSLM__01M  DBB[1822]   // Рецепт 1 загрузки шлама
#define  TRSLM__01V  DBB[1823]   // Рецепт 1 загрузки шлама
#define  TRVODD_01M  DBB[1824]   // Рецепт 1 загрузки воды доливки
#define  TRVODD_01V  DBB[1825]   // Рецепт 1 загрузки воды доливки
#define  TRPAS__01M  DBB[1826]   // Рецепт 1 загрузки пасты
#define  TRPAS__01V  DBB[1827]   // Рецепт 1 загрузки пасты
#define  ch1828___v  DBB[1828]   // 
#define  ch1829___v  DBB[1829]   // 
#define  TRCEMA_02M  DBB[1830]   // Рецепт 2 загрузки цемента из аспирации
#define  TRCEMA_02V  DBB[1831]   // Рецепт 2 загрузки цемента из аспирации
#define  TRCEMS_02M  DBB[1832]   // Рецепт 2 загрузки цемента общий
#define  TRCEMS_02V  DBB[1833]   // Рецепт 2 загрузки цемента общий
#define  TRVYGA_02M  DBB[1834]   // Рецепт 2 загрузки вяжущего из аспирации
#define  TRVYGA_02V  DBB[1835]   // Рецепт 2 загрузки вяжущего из аспирации
#define  TRVYGS_02M  DBB[1836]   // Рецепт 2 загрузки вяжущего общий
#define  TRVYGS_02V  DBB[1837]   // Рецепт 2 загрузки вяжущего общий
#define  TRVODP_02M  DBB[1838]   // Рецепт 2 загрузки воды промывки
#define  TRVODP_02V  DBB[1839]   // Рецепт 2 загрузки воды промывки
#define  TROTH__02M  DBB[1840]   // Рецепт 2 загрузки отходов
#define  TROTH__02V  DBB[1841]   // Рецепт 2 загрузки отходов
#define  TRSLM__02M  DBB[1842]   // Рецепт 2 загрузки шлама
#define  TRSLM__02V  DBB[1843]   // Рецепт 2 загрузки шлама
#define  TRVODD_02M  DBB[1844]   // Рецепт 2 загрузки воды доливки
#define  TRVODD_02V  DBB[1845]   // Рецепт 2 загрузки воды доливки
#define  TRPAS__02M  DBB[1846]   // Рецепт 2 загрузки пасты
#define  TRPAS__02V  DBB[1847]   // Рецепт 2 загрузки пасты
#define  ch1848___v  DBB[1848]   // 
#define  ch1849___v  DBB[1849]   // 
#define  TRCEMA_03M  DBB[1850]   // Рецепт 3 загрузки цемента из аспирации
#define  TRCEMA_03V  DBB[1851]   // Рецепт 3 загрузки цемента из аспирации
#define  TRCEMS_03M  DBB[1852]   // Рецепт 3 загрузки цемента общий
#define  TRCEMS_03V  DBB[1853]   // Рецепт 3 загрузки цемента общий
#define  TRVYGA_03M  DBB[1854]   // Рецепт 3 загрузки вяжущего из аспирации
#define  TRVYGA_03V  DBB[1855]   // Рецепт 3 загрузки вяжущего из аспирации
#define  TRVYGS_03M  DBB[1856]   // Рецепт 3 загрузки вяжущего общий
#define  TRVYGS_03V  DBB[1857]   // Рецепт 3 загрузки вяжущего общий
#define  TRVODP_03M  DBB[1858]   // Рецепт 3 загрузки воды промывки
#define  TRVODP_03V  DBB[1859]   // Рецепт 3 загрузки воды промывки
#define  TROTH__03M  DBB[1860]   // Рецепт 3 загрузки отходов
#define  TROTH__03V  DBB[1861]   // Рецепт 3 загрузки отходов
#define  TRSLM__03M  DBB[1862]   // Рецепт 3 загрузки шлама
#define  TRSLM__03V  DBB[1863]   // Рецепт 3 загрузки шлама
#define  TRVODD_03M  DBB[1864]   // Рецепт 3 загрузки воды доливки
#define  TRVODD_03V  DBB[1865]   // Рецепт 3 загрузки воды доливки
#define  TRPAS__03M  DBB[1866]   // Рецепт 3 загрузки пасты
#define  TRPAS__03V  DBB[1867]   // Рецепт 3 загрузки пасты
#define  ch1868___v  DBB[1868]   // 
#define  ch1869___v  DBB[1869]   // 
#define  TRCEMA_04M  DBB[1870]   // Рецепт 4 загрузки цемента из аспирации
#define  TRCEMA_04V  DBB[1871]   // Рецепт 4 загрузки цемента из аспирации
#define  TRCEMS_04M  DBB[1872]   // Рецепт 4 загрузки цемента общий
#define  TRCEMS_04V  DBB[1873]   // Рецепт 4 загрузки цемента общий
#define  TRVYGA_04M  DBB[1874]   // Рецепт 4 загрузки вяжущего из аспирации
#define  TRVYGA_04V  DBB[1875]   // Рецепт 4 загрузки вяжущего из аспирации
#define  TRVYGS_04M  DBB[1876]   // Рецепт 4 загрузки вяжущего общий
#define  TRVYGS_04V  DBB[1877]   // Рецепт 4 загрузки вяжущего общий
#define  TRVODP_04M  DBB[1878]   // Рецепт 4 загрузки воды промывки
#define  TRVODP_04V  DBB[1879]   // Рецепт 4 загрузки воды промывки
#define  TROTH__04M  DBB[1880]   // Рецепт 4 загрузки отходов
#define  TROTH__04V  DBB[1881]   // Рецепт 4 загрузки отходов
#define  TRSLM__04M  DBB[1882]   // Рецепт 4 загрузки шлама
#define  TRSLM__04V  DBB[1883]   // Рецепт 4 загрузки шлама
#define  TRVODD_04M  DBB[1884]   // Рецепт 4 загрузки воды доливки
#define  TRVODD_04V  DBB[1885]   // Рецепт 4 загрузки воды доливки
#define  TRPAS__04M  DBB[1886]   // Рецепт 4 загрузки пасты
#define  TRPAS__04V  DBB[1887]   // Рецепт 4 загрузки пасты
#define  ch1888___v  DBB[1888]   // 
#define  ch1889___v  DBB[1889]   // 
#define  TRCEMA_05M  DBB[1890]   // Рецепт 5 загрузки цемента из аспирации
#define  TRCEMA_05V  DBB[1891]   // Рецепт 5 загрузки цемента из аспирации
#define  TRCEMS_05M  DBB[1892]   // Рецепт 5 загрузки цемента общий
#define  TRCEMS_05V  DBB[1893]   // Рецепт 5 загрузки цемента общий
#define  TRVYGA_05M  DBB[1894]   // Рецепт 5 загрузки вяжущего из аспирации
#define  TRVYGA_05V  DBB[1895]   // Рецепт 5 загрузки вяжущего из аспирации
#define  TRVYGS_05M  DBB[1896]   // Рецепт 5 загрузки вяжущего общий
#define  TRVYGS_05V  DBB[1897]   // Рецепт 5 загрузки вяжущего общий
#define  TRVODP_05M  DBB[1898]   // Рецепт 5 загрузки воды промывки
#define  TRVODP_05V  DBB[1899]   // Рецепт 5 загрузки воды промывки
#define  TROTH__05M  DBB[1900]   // Рецепт 5 загрузки отходов
#define  TROTH__05V  DBB[1901]   // Рецепт 5 загрузки отходов
#define  TRSLM__05M  DBB[1902]   // Рецепт 5 загрузки шлама
#define  TRSLM__05V  DBB[1903]   // Рецепт 5 загрузки шлама
#define  TRVODD_05M  DBB[1904]   // Рецепт 5 загрузки воды доливки
#define  TRVODD_05V  DBB[1905]   // Рецепт 5 загрузки воды доливки
#define  TRPAS__05M  DBB[1906]   // Рецепт 5 загрузки пасты
#define  TRPAS__05V  DBB[1907]   // Рецепт 5 загрузки пасты
#define  ch1908___v  DBB[1908]   // 
#define  ch1909___v  DBB[1909]   // 
#define  RECEPT_CNV  DBB[1910]   // Номер выбранного рецепта
#define  CRCEMA___V  DBB[1911]   // Текущий вес цемента из аспирации
#define  CRCEMB___V  DBB[1912]   // Текущий вес цемента из бункера
#define  CRCEMS___V  DBB[1913]   // Текущий вес цемента общий
#define  CRVYGA___V  DBB[1914]   // Текущий вес вяжущего из аспирации
#define  CRVYGB___V  DBB[1915]   // Текущий вес вяжущего из бункера
#define  CRVYGS___V  DBB[1916]   // Текущий вес вяжущего общий
#define  CRVODP___V  DBB[1917]   // Текущий вес воды промывки
#define  CROTH____V  DBB[1918]   // Текущий вес отходов
#define  CRSLM____V  DBB[1919]   // Текущий вес шлама
#define  CRVODD___V  DBB[1920]   // Текущий вес воды доливки общей
#define  CRPAS____V  DBB[1921]   // Текущий вес пасты
#define  ch1922___v  DBB[1922]   // 
#define  CRVODV___V  DBB[1923]   // Текущий вес воды верхней
#define  CRSLO____V  DBB[1924]   // Текущий вес шлама и отходов
#define  CRCEMA___F  DBB[1931]   // Флаг набора веса цемента из аспирации
#define  CRCEMB___F  DBB[1932]   // Флаг набора веса цемента из бункера
#define  CRCEMS___F  DBB[1933]   // Флаг набора веса цемента общий
#define  CRVYGA___F  DBB[1934]   // Флаг набора веса вяжущего из аспирации
#define  CRVYGB___F  DBB[1935]   // Флаг набора веса вяжущего из бункера
#define  CRVYGS___F  DBB[1936]   // Флаг набора веса вяжущего общий
#define  CRVODP___F  DBB[1937]   // Флаг набора веса воды промывки
#define  CROTH____F  DBB[1938]   // Флаг набора веса отходов
#define  CRSLM____F  DBB[1939]   // Флаг набора веса шлама
#define  CRVODD___F  DBB[1940]   // Флаг набора веса воды доливки
#define  CRPAS____F  DBB[1941]   // Флаг набора веса пасты
#define  ch1942___v  DBB[1942]   // 
#define  FL_DZSH__V  DBB[1950]   // Флаг набора дозатора сухого
#define  FL_DZMK__V  DBB[1951]   // Флаг набора дозатора мокрого
#define  FL_DZPA__V  DBB[1952]   // Флаг набора дозатора пасты
#define  ch1953___v  DBB[1953]   // 
#define  SV_DZSHCAV  DBB[1955]   // Запомненный вес дозатора сухого
#define  SV_DZSHCBV  DBB[1956]   // Запомненный вес дозатора сухого
#define  SV_DZSHVAV  DBB[1957]   // Запомненный вес дозатора сухого
#define  SV_DZSHVBV  DBB[1958]   // Запомненный вес дозатора сухого
#define  SV_DZMKVPV  DBB[1959]   // Запомненный вес дозатора мокрого
#define  SV_DZMKOTV  DBB[1960]   // Запомненный вес дозатора мокрого
#define  SV_DZMKSLV  DBB[1961]   // Запомненный вес дозатора мокрого
#define  SV_DZMKVDV  DBB[1962]   // Запомненный вес дозатора мокрого
#define  SV_DZPA__V  DBB[1963]   // Запомненный вес дозатора пасты
#define  ch1964___v  DBB[1964]   // 
#define  TIME_ISPPW  DBB[2000]   // Время переключ сост исполнит при несработке
#define  DON011__EW  DBB[2001]   // Количество переключений состояний исполнителя
#define  DON011__EK  DBB[2002]   // Счетчик паузы между проверками сработ исполнителя
#define  DON012__EW  DBB[2003]   // Количество переключений состояний исполнителя
#define  DON012__EK  DBB[2004]   // Счетчик паузы между проверками сработ исполнителя
#define  DON021__EW  DBB[2005]   // Количество переключений состояний исполнителя
#define  DON021__EK  DBB[2006]   // Счетчик паузы между проверками сработ исполнителя
#define  DON022__EW  DBB[2007]   // Количество переключений состояний исполнителя
#define  DON022__EK  DBB[2008]   // Счетчик паузы между проверками сработ исполнителя
#define  DON032__EW  DBB[2009]   // Количество переключений состояний исполнителя
#define  DON032__EK  DBB[2010]   // Счетчик паузы между проверками сработ исполнителя
#define  DON042__EW  DBB[2011]   // Количество переключений состояний исполнителя
#define  DON042__EK  DBB[2012]   // Счетчик паузы между проверками сработ исполнителя
#define  DON052__EW  DBB[2013]   // Количество переключений состояний исполнителя
#define  DON052__EK  DBB[2014]   // Счетчик паузы между проверками сработ исполнителя
#define  DON031__EW  DBB[2015]   // Количество переключений состояний исполнителя
#define  DON031__EK  DBB[2016]   // Счетчик паузы между проверками сработ исполнителя
#define  DON041__EW  DBB[2017]   // Количество переключений состояний исполнителя
#define  DON041__EK  DBB[2018]   // Счетчик паузы между проверками сработ исполнителя
#define  DON051__EW  DBB[2019]   // Количество переключений состояний исполнителя
#define  DON051__EK  DBB[2020]   // Счетчик паузы между проверками сработ исполнителя
#define  DON061__EW  DBB[2021]   // Количество переключений состояний исполнителя
#define  DON061__EK  DBB[2022]   // Счетчик паузы между проверками сработ исполнителя
#define  DON071__EW  DBB[2023]   // Количество переключений состояний исполнителя
#define  DON071__EK  DBB[2024]   // Счетчик паузы между проверками сработ исполнителя
#define  DON081__EW  DBB[2025]   // Количество переключений состояний исполнителя
#define  DON081__EK  DBB[2026]   // Счетчик паузы между проверками сработ исполнителя
#define  DON082__EW  DBB[2027]   // Количество переключений состояний исполнителя
#define  DON082__EK  DBB[2028]   // Счетчик паузы между проверками сработ исполнителя
#define  DON111__EW  DBB[2029]   // Количество переключений состояний исполнителя
#define  DON111__EK  DBB[2030]   // Счетчик паузы между проверками сработ исполнителя
#define  DON112__EW  DBB[2031]   // Количество переключений состояний исполнителя
#define  DON112__EK  DBB[2032]   // Счетчик паузы между проверками сработ исполнителя
#define  DON121__EW  DBB[2033]   // Количество переключений состояний исполнителя
#define  DON121__EK  DBB[2034]   // Счетчик паузы между проверками сработ исполнителя
#define  DON122__EW  DBB[2035]   // Количество переключений состояний исполнителя
#define  DON122__EK  DBB[2036]   // Счетчик паузы между проверками сработ исполнителя
#define  DON101__EW  DBB[2037]   // Количество переключений состояний исполнителя
#define  DON101__EK  DBB[2038]   // Счетчик паузы между проверками сработ исполнителя
#define  DON102__EW  DBB[2039]   // Количество переключений состояний исполнителя
#define  DON102__EK  DBB[2040]   // Счетчик паузы между проверками сработ исполнителя
#define  DON131__EW  DBB[2041]   // Количество переключений состояний исполнителя
#define  DON131__EK  DBB[2042]   // Счетчик паузы между проверками сработ исполнителя
#define  DON132__EW  DBB[2043]   // Количество переключений состояний исполнителя
#define  DON132__EK  DBB[2044]   // Счетчик паузы между проверками сработ исполнителя
#define  DON141__EW  DBB[2045]   // Количество переключений состояний исполнителя
#define  DON141__EK  DBB[2046]   // Счетчик паузы между проверками сработ исполнителя
#define  DON142__EW  DBB[2047]   // Количество переключений состояний исполнителя
#define  DON142__EK  DBB[2048]   // Счетчик паузы между проверками сработ исполнителя
#define  DON143__EW  DBB[2049]   // Количество переключений состояний исполнителя
#define  DON143__EK  DBB[2050]   // Счетчик паузы между проверками сработ исполнителя
#define  DON150__EW  DBB[2051]   // Количество переключений состояний исполнителя
#define  DON150__EK  DBB[2052]   // Счетчик паузы между проверками сработ исполнителя
#define  DON151__EW  DBB[2053]   // Количество переключений состояний исполнителя
#define  DON151__EK  DBB[2054]   // Счетчик паузы между проверками сработ исполнителя
#define  DON152__EW  DBB[2055]   // Количество переключений состояний исполнителя
#define  DON152__EK  DBB[2056]   // Счетчик паузы между проверками сработ исполнителя
#define  DON161__EW  DBB[2057]   // Количество переключений состояний исполнителя
#define  DON161__EK  DBB[2058]   // Счетчик паузы между проверками сработ исполнителя
#define  DON162__EW  DBB[2059]   // Количество переключений состояний исполнителя
#define  DON162__EK  DBB[2060]   // Счетчик паузы между проверками сработ исполнителя
#define  DON171__EW  DBB[2061]   // Количество переключений состояний исполнителя
#define  DON171__EK  DBB[2062]   // Счетчик паузы между проверками сработ исполнителя
#define  DON172__EW  DBB[2063]   // Количество переключений состояний исполнителя
#define  DON172__EK  DBB[2064]   // Счетчик паузы между проверками сработ исполнителя
#define  DON173__EW  DBB[2065]   // Количество переключений состояний исполнителя
#define  DON173__EK  DBB[2066]   // Счетчик паузы между проверками сработ исполнителя
#define  DON180__EW  DBB[2067]   // Количество переключений состояний исполнителя
#define  DON180__EK  DBB[2068]   // Счетчик паузы между проверками сработ исполнителя
#define  DON181__EW  DBB[2069]   // Количество переключений состояний исполнителя
#define  DON181__EK  DBB[2070]   // Счетчик паузы между проверками сработ исполнителя
#define  DON182__EW  DBB[2071]   // Количество переключений состояний исполнителя
#define  DON182__EK  DBB[2072]   // Счетчик паузы между проверками сработ исполнителя
#define  DON191__EW  DBB[2073]   // Количество переключений состояний исполнителя
#define  DON119__EK  DBB[2074]   // Счетчик паузы между проверками сработ исполнителя
#define  DON192__EW  DBB[2075]   // Количество переключений состояний исполнителя
#define  DON192__EK  DBB[2076]   // Счетчик паузы между проверками сработ исполнителя
#define  DON193__EW  DBB[2077]   // Количество переключений состояний исполнителя
#define  DON193__EK  DBB[2078]   // Счетчик паузы между проверками сработ исполнителя
#define  DON201__EW  DBB[2079]   // Количество переключений состояний исполнителя
#define  DON201__EK  DBB[2080]   // Счетчик паузы между проверками сработ исполнителя
#define  DON202__EW  DBB[2081]   // Количество переключений состояний исполнителя
#define  DON202__EK  DBB[2082]   // Счетчик паузы между проверками сработ исполнителя
#define  DON211__EW  DBB[2083]   // Количество переключений состояний исполнителя
#define  DON211__EK  DBB[2084]   // Счетчик паузы между проверками сработ исполнителя
#define  DON212__EW  DBB[2085]   // Количество переключений состояний исполнителя
#define  DON212__EK  DBB[2086]   // Счетчик паузы между проверками сработ исполнителя
#define  DON221__EW  DBB[2087]   // Количество переключений состояний исполнителя
#define  DON221__EK  DBB[2088]   // Счетчик паузы между проверками сработ исполнителя
#define  DON222__EW  DBB[2089]   // Количество переключений состояний исполнителя
#define  DON222__EK  DBB[2090]   // Счетчик паузы между проверками сработ исполнителя
#define  DON231__EW  DBB[2091]   // Количество переключений состояний исполнителя
#define  DON231__EK  DBB[2092]   // Счетчик паузы между проверками сработ исполнителя
#define  DON232__EW  DBB[2093]   // Количество переключений состояний исполнителя
#define  DON232__EK  DBB[2094]   // Счетчик паузы между проверками сработ исполнителя
#define  DON241__EW  DBB[2095]   // Количество переключений состояний исполнителя
#define  DON241__EK  DBB[2096]   // Счетчик паузы между проверками сработ исполнителя
#define  DON250__EW  DBB[2097]   // Количество переключений состояний исполнителя
#define  DON250__EK  DBB[2098]   // Счетчик паузы между проверками сработ исполнителя
#define  DON251__EW  DBB[2099]   // Количество переключений состояний исполнителя
#define  DON251__EK  DBB[2100]   // Счетчик паузы между проверками сработ исполнителя
#define  DON252__EW  DBB[2101]   // Количество переключений состояний исполнителя
#define  DON252__EK  DBB[2102]   // Счетчик паузы между проверками сработ исполнителя
#define  DON261__EW  DBB[2103]   // Количество переключений состояний исполнителя
#define  DON261__EK  DBB[2104]   // Счетчик паузы между проверками сработ исполнителя
#define  DON271__EW  DBB[2105]   // Количество переключений состояний исполнителя
#define  DON271__EK  DBB[2106]   // Счетчик паузы между проверками сработ исполнителя
#define  DON272__EW  DBB[2107]   // Количество переключений состояний исполнителя
#define  DON272__EK  DBB[2108]   // Счетчик паузы между проверками сработ исполнителя
#define  DON274__EW  DBB[2109]   // Количество переключений состояний исполнителя
#define  DON274__EK  DBB[2110]   // Счетчик паузы между проверками сработ исполнителя
#define  DON281__EW  DBB[2111]   // Количество переключений состояний исполнителя
#define  DON281__EK  DBB[2112]   // Счетчик паузы между проверками сработ исполнителя
#define  DON291__EW  DBB[2113]   // Количество переключений состояний исполнителя
#define  DON291__EK  DBB[2114]   // Счетчик паузы между проверками сработ исполнителя
#define  DON301__EW  DBB[2115]   // Количество переключений состояний исполнителя
#define  DON301__EK  DBB[2116]   // Счетчик паузы между проверками сработ исполнителя
#define  DON311__EW  DBB[2117]   // Количество переключений состояний исполнителя
#define  DON311__EK  DBB[2118]   // Счетчик паузы между проверками сработ исполнителя
#define  DON312__EW  DBB[2119]   // Количество переключений состояний исполнителя
#define  DON312__EK  DBB[2120]   // Счетчик паузы между проверками сработ исполнителя
#define  DON313__EW  DBB[2121]   // Количество переключений состояний исполнителя
#define  DON313__EK  DBB[2122]   // Счетчик паузы между проверками сработ исполнителя
#define  DON314__EW  DBB[2123]   // Количество переключений состояний исполнителя
#define  DON314__EK  DBB[2124]   // Счетчик паузы между проверками сработ исполнителя
#define  DON316__EW  DBB[2125]   // Количество переключений состояний исполнителя
#define  DON316__EK  DBB[2126]   // Счетчик паузы между проверками сработ исполнителя
#define  DON317__EW  DBB[2127]   // Количество переключений состояний исполнителя
#define  DON317__EK  DBB[2128]   // Счетчик паузы между проверками сработ исполнителя
#define  DON31A__EW  DBB[2129]   // Количество переключений состояний исполнителя
#define  DON31A__EK  DBB[2130]   // Счетчик паузы между проверками сработ исполнителя
#define  COUN_SLDZW  DBB[2201]   // Количество дозировок шлама
#define  COUN_SLDZC  DBB[2202]   // Количество дозировок шлама
#define  COUN_OTDZW  DBB[2203]   // Количество дозировок отходов
#define  COUN_OTDZC  DBB[2204]   // Количество дозировок отходов
#define  COUN_CMDZW  DBB[2205]   // Количество дозировок цемента
#define  COUN_CMDZC  DBB[2206]   // Количество дозировок цемента
#define  COUN_VJDZW  DBB[2207]   // Количество дозировок вяжущих
#define  COUN_VJDZC  DBB[2208]   // Количество дозировок вяжущих
#define  COUN_PADZW  DBB[2209]   // Количество дозировок пасты
#define  COUN_PADZC  DBB[2210]   // Количество дозировок пасты
#define  ch2211___v  DBB[2211]   // 
#define  ch2212___v  DBB[2212]   // 
#define  COUN_VDDZW  DBB[2213]   // Количество дозировок воды
#define  COUN_VDDZC  DBB[2214]   // Количество дозировок воды
#define  FLAG_SLDZC  DBB[2215]   // Флаг счета колич дозир шлама
#define  FLAG_SLDZZ  DBB[2216]   // флаг загрузок шлама
#define  FLAG_SLDZV  DBB[2217]   // флаг выгрузок шлама
#define  FLAG_VDDZC  DBB[2218]   // флаг счета колич дозир воды
#define  FLAG_VDDZZ  DBB[2219]   // флаг загрузок воды
#define  FLAG_VDDZV  DBB[2220]   // флаг выгрузок воды
#define  FLAG_OTDZC  DBB[2221]   // флаг счета колич дозир отходов
#define  FLAG_OTDZZ  DBB[2222]   // флаг загрузок отходов
#define  FLAG_OTDZV  DBB[2223]   // флаг выгрузок отходов
#define  FLAG_CMDZC  DBB[2224]   // флаг счета колич дозир цемента
#define  FLAG_CMDZZ  DBB[2225]   // флаг загрузок цемента
#define  FLAG_CMDZV  DBB[2226]   // флаг выгрузок цемента
#define  FLAG_VJDZC  DBB[2227]   // флаг счета колич дозир вяжущих
#define  FLAG_VJDZZ  DBB[2228]   // флаг загрузок вяжущих
#define  FLAG_VJDZV  DBB[2229]   // флаг выгрузок вяжущих
#define  FLAG_PADZC  DBB[2230]   // флаг счета колич дозир пасты
#define  FLAG_PADZZ  DBB[2231]   // флаг загрузок пасты
#define  FLAG_PADZV  DBB[2232]   // флаг выгрузок пасты
#define  ch2233___v  DBB[2233]   // 
#define  ch2234___v  DBB[2234]   // 
#define  ch2235___v  DBB[2235]   // 
#define  CTRL_LLMSM  DBB[2301]   // Контроль нижнего уровня мешалки шлама
#define  CTRL_LLMSV  DBB[2302]   // Контроль нижнего уровня мешалки шлама
#define  CTRL_HLMSM  DBB[2303]   // Контроль верхнего уровня мешалки шлама
#define  CTRL_HLMSV  DBB[2304]   // Контроль верхнего уровня мешалки шлама
#define  CTRL_LPSLM  DBB[2305]   // Контроль уровня пн насоса шлама
#define  CTRL_LPSLV  DBB[2306]   // Контроль уровня пн насоса шлама
#define  CTRL_LLSVM  DBB[2311]   // Контроль нижнего уровня зборника воды
#define  CTRL_LLSVV  DBB[2312]   // Контроль нижнего уровня зборника воды
#define  CTRL_MLSVM  DBB[2313]   // Контроль среднего уровня зборника воды
#define  CTRL_MLSVV  DBB[2314]   // Контроль среднего уровня зборника воды
#define  CTRL_HLSVM  DBB[2315]   // Контроль верхнего уровня зборника воды
#define  CTRL_HLSVV  DBB[2316]   // Контроль верхнего уровня зборника воды
#define  CTRL_LLSKM  DBB[2317]   // Контроль нижнего уровня зборника конденсата
#define  CTRL_LLSKV  DBB[2318]   // Контроль нижнего уровня зборника конденсата
#define  CTRL_LLMOM  DBB[2321]   // Контроль нижнего уровня мешалки отходов
#define  CTRL_LLMOV  DBB[2322]   // Контроль нижнего уровня мешалки отходов
#define  CTRL_HLMOM  DBB[2323]   // Контроль верхнего уровня мешалки отходов
#define  CTRL_HLMOV  DBB[2324]   // Контроль верхнего уровня мешалки отходов
#define  CTRL_LPOTM  DBB[2325]   // Контроль уровня пн насоса отходов
#define  CTRL_LPOTV  DBB[2326]   // Контроль уровня пн насоса отходов
#define  CTRL_LLBVM  DBB[2331]   // Контроль нижнего уровня бункера вяжущего
#define  CTRL_LLBVV  DBB[2332]   // Контроль нижнего уровня бункера вяжущего
#define  CTRL_HLBVM  DBB[2333]   // Контроль верхнего уровня бункера вяжущего
#define  CTRL_HLBVV  DBB[2334]   // Контроль верхнего уровня бункера вяжущего
#define  CTRL_LLGMM  DBB[2335]   // Контроль нижнего уровня гомогенизатора
#define  CTRL_LLGMV  DBB[2336]   // Контроль нижнего уровня гомогенизатора
#define  CTRL_LLBCM  DBB[2341]   // Контроль нижнего уровня бункера цемента
#define  CTRL_LLBCV  DBB[2342]   // Контроль нижнего уровня бункера цемента
#define  CTRL_HLBCM  DBB[2343]   // Контроль верхнего уровня бункера цемента
#define  CTRL_HLBCV  DBB[2344]   // Контроль верхнего уровня бункера цемента
#define  CTRL_LPCMM  DBB[2345]   // Контроль уровня пн насоса цемента
#define  CTRL_LPCMV  DBB[2346]   // Контроль уровня пн насоса цемента
#define  CTRL_LLVPM  DBB[2351]   // Контроль нижнего уровня емкости вода-ПАВ
#define  CTRL_LLVPV  DBB[2352]   // Контроль нижнего уровня емкости вода-ПАВ
#define  CTRL_HLVPM  DBB[2353]   // Контроль верхнего уровня емкости вода-ПАВ
#define  CTRL_HLVPV  DBB[2354]   // Контроль верхнего уровня емкости вода-ПАВ
#define  CONT_MSH1S  DBB[2355]   // Контроль работы мешалки
#define  CONT_MSH2S  DBB[2356]   // Контроль работы мешалки
#define  CONT_MSH3S  DBB[2357]   // Контроль работы мешалки
#define  CONT_MORKS  DBB[2358]   // Контроль работы мешалки
#define  CONT_MOTHS  DBB[2359]   // Контроль работы мешалки
#define  CONT_MSHLS  DBB[2360]   // Контроль работы мешалки
#define  CONT_MAPUS  DBB[2361]   // Контроль работы мешалки
#define  CONT_MAPVS  DBB[2362]   // Контроль работы мешалки
#define  CONT_MAPNS  DBB[2363]   // Контроль работы мешалки
#define  CTRL_HLM1M  DBB[2371]   // Контроль верхнего уровня нижн.мешалки ПАВ
#define  CTRL_HLM1V  DBB[2372]   // Контроль верхнего уровня нижн.мешалки ПАВ
#define  CTRL_LLM1M  DBB[2373]   // Контроль нижнего уровня нижн.мешалки ПАВ
#define  CTRL_LLM1V  DBB[2374]   // Контроль нижнего уровня нижн.мешалки ПАВ
#define  CTRL_HLM2M  DBB[2375]   // Контроль верхнего уровня верх.мешалки ПАВ
#define  CTRL_HLM2V  DBB[2376]   // Контроль верхнего уровня верх.мешалки ПАВ
#define  CTRL_LLM2M  DBB[2377]   // Контроль нижнего уровня верх.мешалки ПАВ
#define  CTRL_LLM2V  DBB[2378]   // Контроль нижнего уровня верх.мешалки ПАВ
#define  CTRL_HLPEM  DBB[2379]   // Контроль верхнего уровня пром.емк. ал.пасты
#define  CTRL_HLPEV  DBB[2380]   // Контроль верхнего уровня пром.емк. ал.пасты
#define  CTRL_LLPEM  DBB[2381]   // Контроль нижнего уровня пром.емк. ал.пасты
#define  CTRL_LLPEV  DBB[2382]   // Контроль нижнего уровня пром.емк. ал.пасты
#define  REG01ZO1_W  DBB[2401]   // Запрос R01 1
#define  REG01ZO2_W  DBB[2402]   // Запрос R01 2
#define  REG02ZO1_W  DBB[2403]   // Запрос R02 1
#define  REG03ZO1_W  DBB[2404]   // Запрос R03 1
#define  REG03ZO2_W  DBB[2405]   // Запрос R03 2
#define  REG04ZO1_W  DBB[2406]   // Запрос R04 1
#define  REG04ZO2_W  DBB[2407]   // Запрос R04 2
#define  REG05ZO1_W  DBB[2408]   // Запрос R05 1
#define  REG05ZO2_W  DBB[2409]   // Запрос R05 2
#define  REG06ZO1_W  DBB[2410]   // Запрос R06 1
#define  REG06ZO2_W  DBB[2411]   // Запрос R06 2
#define  REG07ZO1_W  DBB[2412]   // Запрос R07 1
#define  REG07ZO2_W  DBB[2413]   // Запрос R07 2
#define  REG10ZO4_W  DBB[2414]   // Запрос R10 4
#define  REG10ZO3_W  DBB[2415]   // Запрос R10 3
#define  REG09ZO1_W  DBB[2416]   // Запрос R09 1
#define  REG09ZO2_W  DBB[2417]   // Запрос R09 2
#define  REG10ZO1_W  DBB[2418]   // Запрос R10 1
#define  REG10ZO2_W  DBB[2419]   // Запрос R10 2
#define  REG01RS__M  DBB[2431]   // Переключение регулятора
#define  REG02RS__M  DBB[2432]   // Переключение регулятора
#define  REG03RS__M  DBB[2433]   // Переключение регулятора
#define  REG04RS__M  DBB[2434]   // Переключение регулятора
#define  REG05RS__M  DBB[2435]   // Переключение регулятора
#define  REG06RS__M  DBB[2436]   // Переключение регулятора
#define  REG07RS__M  DBB[2437]   // Переключение регулятора
#define  REG08RS__M  DBB[2438]   // Переключение регулятора
#define  REG09RS__M  DBB[2439]   // Переключение регулятора
#define  REG10RS__M  DBB[2440]   // Переключение регулятора
#define  REG11RS__M  DBB[2441]   // Переключение регулятора
#define  REG12RS__M  DBB[2442]   // Переключение регулятора
#define  REG13RS__M  DBB[2443]   // Переключение регулятора
#define  REG14RS__M  DBB[2444]   // Переключение регулятора
#define  AIW190___E  DBB[2451]   // Сумма веса компонентов дозировки сухого
#define  AIW230___E  DBB[2452]   // Сумма веса компонентов дозировки мокрого
#define  AIW190___P  DBB[2453]   // Сумма веса компонентов дозировки сухого
#define  AIW230___P  DBB[2454]   // Сумма веса компонентов дозировки мокрого
#define  AIW190VO_V  DBB[2455]   // Вес следующей отсечки дозатора сухого
#define  AIW230VO_V  DBB[2456]   // Вес следующей отсечки дозатора мокрого
#define  AIW290VO_V  DBB[2457]   // Вес следующей отсечки дозатора пасты
#define  ch2458___v  DBB[2458]   // 
#define  AIW190VB_V  DBB[2461]   // Вес следующей блокировки дозатора сухого
#define  AIW230VB_V  DBB[2462]   // Вес следующей блокировки дозатора мокрого
#define  AIW290VB_V  DBB[2463]   // Вес следующей блокировки дозатора пасты
#define  ch2464___v  DBB[2464]   // 
#define  AIW190VZ_V  DBB[2465]   // Вес следующего заданного набора в дозатор сухого
#define  AIW230VZ_V  DBB[2466]   // Вес следующего заданного набора в дозатор мокрого
#define  AIW290VZ_V  DBB[2467]   // Вес следующего заданного набора в дозатор пасты
#define  ch2468___v  DBB[2468]   // 
#define  AIW190NV_V  DBB[2469]   // Начальный вес дозатора сухого
#define  AIW230NV_V  DBB[2470]   // Начальный вес дозатора мокрого
#define  AIW290NV_V  DBB[2471]   // Начальный вес дозатора пасты
#define  ch2472___v  DBB[2472]   // 
#define  AIW190FV_V  DBB[2473]   // Флаг веса дозатора сухого
#define  AIW230FV_V  DBB[2474]   // Флаг веса дозатора мокрого
#define  AIW290FV_V  DBB[2475]   // Флаг веса дозатора пасты
#define  ch2476___v  DBB[2476]   // 
#define  AIW190VD_V  DBB[2477]   // Вес дозатора сухого перед загрузкой
#define  AIW230VD_V  DBB[2478]   // Вес дозатора мокрого перед загрузкой
#define  AIW290VD_V  DBB[2479]   // Вес дозатора пасты перед загрузкой
#define  ch2480___v  DBB[2480]   // 
#define  TSCEMA_PZV  DBB[2481]   // Вес предыдущей дозировки цемента из аспирации
#define  TSCEMB_PZV  DBB[2482]   // Вес предыдущей дозировки цемента из бункера
#define  TSCEMS_PZV  DBB[2483]   // Вес предыдущей дозировки цемента общего
#define  TSVYGA_PZV  DBB[2484]   // Вес предыдущей дозировки вяжущего из аспирации
#define  TSVYGB_PZV  DBB[2485]   // Вес предыдущей дозировки вяжущего из бункера
#define  TSVYGS_PZV  DBB[2486]   // Вес предыдущей дозировки вяжущего общего
#define  TSVODP_PZV  DBB[2487]   // Вес предыдущей дозировки воды промывки
#define  TSOTH__PZV  DBB[2488]   // Вес предыдущей дозировки отходов
#define  TSSLM__PZV  DBB[2489]   // Вес предыдущей дозировки шлама
#define  TSVODD_PZV  DBB[2490]   // Вес предыдущей дозировки воды доливки
#define  TSPAS__PZV  DBB[2491]   // Вес предыдущей дозировки пасты
#define  ch2492___v  DBB[2492]   // 
#define  TSCEMA_NKV  DBB[2501]   // Накопление веса дозировок цемента из аспирации
#define  TSCEMB_NKV  DBB[2502]   // Накопление веса дозировок цемента из бункера
#define  TSCEMS_NKV  DBB[2503]   // Накопление веса дозировок цемента общего
#define  TSVYGA_NKV  DBB[2504]   // Накопление веса дозировок вяжущего из аспирации
#define  TSVYGB_NKV  DBB[2505]   // Накопление веса дозировок вяжущего из бункера
#define  TSVYGS_NKV  DBB[2506]   // Накопление веса дозировок вяжущего общего
#define  TSVODP_NKV  DBB[2507]   // Накопление веса дозировок воды промывки
#define  TSOTH__NKV  DBB[2508]   // Накопление веса дозировок отходов
#define  TSSLM__NKV  DBB[2509]   // Накопление веса дозировок шлама
#define  TSVODD_NKV  DBB[2510]   // Накопление веса дозировок воды доливки
#define  TSPAS__NKV  DBB[2511]   // Накопление веса дозировок пасты
#define  ch2512___v  DBB[2512]   // 
#define  TSCEMA_CSV  DBB[2521]   // Суммарная загрузка цемента асп за текущую смену
#define  TSCEMB_CSV  DBB[2522]   // Суммарная загрузка цемента бунк за текущую смену
#define  TSCEMS_CSV  DBB[2523]   // Суммарная загрузка цемента общ за текущую смену
#define  TSVYGA_CSV  DBB[2524]   // Суммарная загрузка вяжущего асп за текущую смену
#define  TSVYGB_CSV  DBB[2525]   // Суммарная загрузка вяжущего бунк за текущую смену
#define  TSVYGS_CSV  DBB[2526]   // Суммарная загрузка вяжущего общ за текущую смену
#define  TSVODP_CSV  DBB[2527]   // Суммарная загрузка воды промывки за текущую смену
#define  TSOTH__CSV  DBB[2528]   // Суммарная загрузка отходов за текущую смену
#define  TSSLM__CSV  DBB[2529]   // Суммарная загрузка шлама за текущую смену
#define  TSVODD_CSV  DBB[2530]   // Суммарная загрузка воды доливки за текущую смену
#define  TSPAS__CSV  DBB[2531]   // Суммарная загрузка пасты за текущую смену
#define  ch2532___v  DBB[2532]   // 
#define  TSCEMA_PSV  DBB[2541]   // Суммарная загрузка цемента асп за прошлую смену
#define  TSCEMB_PSV  DBB[2542]   // Суммарная загрузка цемента бунк за прошлую смену
#define  TSCEMS_PSV  DBB[2543]   // Суммарная загрузка цемента общ за прошлую смену
#define  TSVYGA_PSV  DBB[2544]   // Суммарная загрузка вяжущего асп за прошлую смену
#define  TSVYGB_PSV  DBB[2545]   // Суммарная загрузка вяжущего бунк за прошлую смену
#define  TSVYGS_PSV  DBB[2546]   // Суммарная загрузка вяжущего общ за прошлую смену
#define  TSVODP_PSV  DBB[2547]   // Суммарная загрузка воды промывки за прошлую смену
#define  TSOTH__PSV  DBB[2548]   // Суммарная загрузка отходов за прошлую смену
#define  TSSLM__PSV  DBB[2549]   // Суммарная загрузка шлама за прошлую смену
#define  TSVODD_PSV  DBB[2550]   // Суммарная загрузка воды доливки за прошлую смену
#define  TSPAS__PSV  DBB[2551]   // Суммарная загрузка пасты за прошлую смену
#define  ch2552___v  DBB[2552]   // 
#define  TSCEMA_CMV  DBB[2561]   // Суммарная загрузка цемента асп за тек месяц
#define  TSCEMB_CMV  DBB[2562]   // Суммарная загрузка цемента бунк за тек месяц
#define  TSCEMS_CMV  DBB[2563]   // Суммарная загрузка цемента общ за тек месяц
#define  TSVYGA_CMV  DBB[2564]   // Суммарная загрузка вяжущего асп за тек месяц
#define  TSVYGB_CMV  DBB[2565]   // Суммарная загрузка вяжущего бунк за тек месяц
#define  TSVYGS_CMV  DBB[2566]   // Суммарная загрузка вяжущего общ за тек месяц
#define  TSVODP_CMV  DBB[2567]   // Суммарная загрузка воды промывки за тек месяц
#define  TSOTH__CMV  DBB[2568]   // Суммарная загрузка отходов за тек месяц
#define  TSSLM__CMV  DBB[2569]   // Суммарная загрузка шлама за тек месяц
#define  TSVODD_CMV  DBB[2570]   // Суммарная загрузка воды доливки за тек месяц
#define  TSPAS__CMV  DBB[2571]   // Суммарная загрузка пасты за тек месяц
#define  ch2572___v  DBB[2572]   // 
#define  TSCEMA_PMV  DBB[2575]   // Суммарная загрузка цемента асп за прош месяц
#define  TSCEMB_PMV  DBB[2576]   // Суммарная загрузка цемента бунк за прош месяц
#define  TSCEMS_PMV  DBB[2577]   // Суммарная загрузка цемента общ за прош месяц
#define  TSVYGA_PMV  DBB[2578]   // Суммарная загрузка вяжущего асп за прош месяц
#define  TSVYGB_PMV  DBB[2579]   // Суммарная загрузка вяжущего бунк за прош месяц
#define  TSVYGS_PMV  DBB[2580]   // Суммарная загрузка вяжущего общ за прош месяц
#define  TSVODP_PMV  DBB[2581]   // Суммарная загрузка воды промывки за прош месяц
#define  TSOTH__PMV  DBB[2582]   // Суммарная загрузка отходов за прош месяц
#define  TSSLM__PMV  DBB[2583]   // Суммарная загрузка шлама за прош месяц
#define  TSVODD_PMV  DBB[2584]   // Суммарная загрузка воды доливки за прош месяц
#define  TSPAS__PMV  DBB[2585]   // Суммарная загрузка пасты за прош месяц
#define  ch2586___v  DBB[2586]   // 
#define  CN_ZALCS_V  DBB[2589]   // Количество заливок за текущую смену
#define  CN_ZALPS_V  DBB[2590]   // Количество заливок за прошлую смену
#define  CN_ZALNK_V  DBB[2591]   // Количество заливок накопления
#define  CN_ZALCM_V  DBB[2592]   // Количество заливок за текущий месяц
#define  CN_ZALPM_V  DBB[2593]   // Количество заливок за прошлый месяц
#define  FL_NAKOP_M  DBB[2594]   // Флаг сброса накоплений
#define  FL_NAKOP_V  DBB[2595]   // Флаг сброса накоплений
#define  TRCEMA_VIB  DBB[2601]   // Выбранный вес загрузки цемента асп
#define  TRCEMB_VIB  DBB[2602]   // Выбранный вес загрузки цемента бунк
#define  TRCEMS_VIB  DBB[2603]   // Выбранный вес загрузки цемента общ
#define  TRVYGA_VIB  DBB[2604]   // Выбранный вес загрузки вяжущего асп
#define  TRVYGB_VIB  DBB[2605]   // Выбранный вес загрузки вяжущего бунк
#define  TRVYGS_VIB  DBB[2606]   // Выбранный вес загрузки вяжущего общ
#define  TRVODP_VIB  DBB[2607]   // Выбранный вес загрузки воды промывки
#define  TROTH__VIB  DBB[2608]   // Выбранный вес загрузки отходов
#define  TRSLM__VIB  DBB[2609]   // Выбранный вес загрузки шлама
#define  TRVODD_VIB  DBB[2610]   // Выбранный вес загрузки воды доливки общей
#define  TRPAS__VIB  DBB[2611]   // Выбранный вес загрузки пасты
#define  ch2612___v  DBB[2612]   // 
#define  TRVODV_VIB  DBB[2613]   // Выбранный вес загрузки воды верхней
#define  TRSLO__VIB  DBB[2614]   // Выбранный вес загрузки шлама и отходов
#define  KRCEMA___M  DBB[2631]   // В данной ячейке значение не меняется
#define  KRCEMA___V  DBB[2632]   // В данной ячейке значение не меняется
#define  KRCEMS___M  DBB[2633]   // В данной ячейке значение не меняется
#define  KRCEMS___V  DBB[2634]   // В данной ячейке значение не меняется
#define  KRVYGA___M  DBB[2635]   // В данной ячейке значение не меняется
#define  KRVYGA___V  DBB[2636]   // В данной ячейке значение не меняется
#define  KRVYGS___M  DBB[2637]   // Коррекция веса вяжущего для остатка в дозаторе сухого
#define  KRVYGS___V  DBB[2638]   // Коррекция веса вяжущего для остатка в дозаторе сухого
#define  KRVODP___M  DBB[2639]   // В данной ячейке значение не меняется
#define  KRVODP___V  DBB[2640]   // В данной ячейке значение не меняется
#define  KROTH____M  DBB[2641]   // В данной ячейке значение не меняется
#define  KROTH____V  DBB[2642]   // В данной ячейке значение не меняется
#define  KRSLM____M  DBB[2643]   // В данной ячейке значение не меняется
#define  KRSLM____V  DBB[2644]   // В данной ячейке значение не меняется
#define  KRVODD___M  DBB[2645]   // Коррекция веса воды доливки
#define  KRVODD___V  DBB[2646]   // Коррекция веса воды доливки
#define  KRPAS____M  DBB[2647]   // Коррекция веса пасты
#define  KRPAS____V  DBB[2648]   // Коррекция веса пасты
#define  ch2649___v  DBB[2649]   // 
#define  ch2650___v  DBB[2650]   // 
#define  DPCEMA___M  DBB[2661]   // Допуск веса набора цемента из аспирации
#define  DPCEMA___V  DBB[2662]   // Допуск веса набора цемента из аспирации
#define  DPCEMS___M  DBB[2663]   // Допуск веса набора цемента общего
#define  DPCEMS___V  DBB[2664]   // Допуск веса набора цемента общего
#define  DPVYGA___M  DBB[2665]   // Допуск веса набора вяжущего из аспирации
#define  DPVYGA___V  DBB[2666]   // Допуск веса набора вяжущего из аспирации
#define  DPVYGS___M  DBB[2667]   // Допуск веса набора вяжущего общего
#define  DPVYGS___V  DBB[2668]   // Допуск веса набора вяжущего общего
#define  DPVODP___M  DBB[2669]   // Допуск веса набора воды промывки
#define  DPVODP___V  DBB[2670]   // Допуск веса набора воды промывки
#define  DPOTH____M  DBB[2671]   // Допуск веса набора отходов
#define  DPOTH____V  DBB[2672]   // Допуск веса набора отходов
#define  DPSLM____M  DBB[2673]   // Допуск веса набора шлама
#define  DPSLM____V  DBB[2674]   // Допуск веса набора шлама
#define  DPVODD___M  DBB[2675]   // Допуск веса набора воды доливки
#define  DPVODD___V  DBB[2676]   // Допуск веса набора воды доливки
#define  DPPAS____M  DBB[2677]   // Допуск веса набора пасты
#define  DPPAS____V  DBB[2678]   // Допуск веса набора пасты
#define  ch2679___v  DBB[2679]   // 
#define  ch2680___v  DBB[2680]   // 
#define  BLCEMA___M  DBB[2691]   // Вес блокировки набора цемента из аспирации
#define  BLCEMA___V  DBB[2692]   // Вес блокировки набора цемента из аспирации
#define  BLCEMS___M  DBB[2693]   // Вес блокировки набора цемента общего
#define  BLCEMS___V  DBB[2694]   // Вес блокировки набора цемента общего
#define  BLVYGA___M  DBB[2695]   // Вес блокировки набора вяжущего из аспирации
#define  BLVYGA___V  DBB[2696]   // Вес блокировки набора вяжущего из аспирации
#define  BLVYGS___M  DBB[2697]   // Вес блокировки набора вяжущего общего
#define  BLVYGS___V  DBB[2698]   // Вес блокировки набора вяжущего общего
#define  BLVODP___M  DBB[2699]   // Вес блокировки набора воды промывки
#define  BLVODP___V  DBB[2700]   // Вес блокировки набора воды промывки
#define  BLOTH____M  DBB[2701]   // Вес блокировки набора отходов
#define  BLOTH____V  DBB[2702]   // Вес блокировки набора отходов
#define  BLSLM____M  DBB[2703]   // Вес блокировки набора шлама
#define  BLSLM____V  DBB[2704]   // Вес блокировки набора шлама
#define  BLVODD___M  DBB[2705]   // Вес блокировки набора воды доливки
#define  BLVODD___V  DBB[2706]   // Вес блокировки набора воды доливки
#define  BLPAS____M  DBB[2707]   // Вес блокировки набора пасты
#define  BLPAS____V  DBB[2708]   // Вес блокировки набора пасты
#define  ch2709___v  DBB[2709]   // 
#define  ch2710___v  DBB[2710]   // 
#define  BLCEMP___M  DBB[2711]   // Закрывать цемент на шнек при подрыве
#define  BLCEMP___V  DBB[2712]   // Закрывать цемент на шнек при подрыве
#define  BLVYGP___M  DBB[2713]   // Закрывать вяжущее на шнек при подрыве
#define  BLVYGP___V  DBB[2714]   // Закрывать вяжущее на шнек при подрыве
#define  BLNSUH___M  DBB[2715]   // Выкл регулятор когда нет набора сухих
#define  BLNSUH___V  DBB[2716]   // Выкл регулятор когда нет набора сухих
