//----------------------------------------------------------------------------
//  Обновление значений каждую секунду
vd  far UpdDataS(vd){

    //-----------------------------------------------------------------------
    // Установка переменной, отображающей работоспособность сети
    NetLive__V++; if(NetLive__V>8){ NetLive__V=0; }
    //------------------------------------------------------------------------
    // флаг работы контроллера
    DON900___V = (DON900___V == OFF) then_ ON else_ OFF;
    //------------------------------------------------------------------------
    // проверка сработки исполнителей (oth\ispolnit.c)
    CheckIsp();
    //------------------------------------------------------------------------
    // проверка нахождения регуляторов в ручном режиме
    Check_Regul_Manual();
    //------------------------------------------------------------------------
    // контроль включения мешалок
    Meshalki();
    //------------------------------------------------------------------------

    return;
}
//----------------------------------------------------------------------------
