//---------------------------------------------------------------------------
//  Обновление значений каждый тик системы (18 раз/сек)
vd  far UpdDataT(vd){

    //-----------------------------------------------------------------------
    // Задание значений переменных массива DBB для отладки
    DebugVal();
    //-----------------------------------------------------------------------
    // Задание оператором текущего шага регулятора
    SetStepReg();
    //-----------------------------------------------------------------------

    //-----------------------------------------------------------------------
    // Вызов подпрограмм регуляторов
    if( (Timer(1,18,1))==2 ){ RegRUN=ON; }
    Regul_up();
    Regul_01();
    Regul_02();
    Regul_03();
    Regul_04();
    Regul_05();
    Regul_06();
    Regul_07();
    Regul_09();
    Regul_10();
    Regul_11();
    Regul_12();
    Regul_13();
    Regul_14();
    Signal();
    RegRUN=OFF;
    //-----------------------------------------------------------------------

    //-----------------------------------------------------------------------
    // Контроль обмена по сети NetBIOS
    if(NBLive___M >0){
       NBLive___M =0; NBLive___V++; if(NBLive___V>8){ NBLive___V=1; }
       NBLiveTO_V =0; NBLF=1;CPLF=0;
    }
    //-----------------------------------
    // Контроль обмена по сети COM порта
    if(CPLive___M >0){
       CPLive___M =0; CPLive___V++; if(CPLive___V>8){ CPLive___V=1; }
       CPLiveTO_V =0; CPLF=1;NBLF=0;
    }
    NBLiveTO_V++; if(NBLiveTO_V>100){ NBLiveTO_V=100; }
    CPLiveTO_V++; if(CPLiveTO_V>100){ CPLiveTO_V=100; }
    //-----------------------------------------------------------------------
    // Передача переменных циклов работы программы контроллера
    TickLoop_V=TLoop;
    SecnLoop_V=SLoop;
    //-----------------------------------------------------------------------
    // Запись данных на диск
    if (WriteDataM>0){ WriteDataM=0; WriteData(0); Message(3); }
    //-----------------------------------------------------------------------
    // Проверка флага звонка
    if (Bell(2)>0){ ErrBell__V=1; DON702___V=1; }
    // сброс флага звонка
    if (ErrBell__M>0){ Bell(0); ErrBell__V=0; ErrBell__M=0; DON702___V=0; }
    //-----------------------------------------------------------------------
    // Вывод и установка времени и даты
    TimeCSS__V=secC; TimeCSM__V=minC; TimeCSH__V=houC;
    DateCSD__V=dayC; DateCSM__V=monC; DateCSY__V=yeaC;
    if(TMDTSet__M>0){
       secC=TimeCSS__M; minC=TimeCSM__M; houC=TimeCSH__M;
       dayC=DateCSD__M; monC=DateCSM__M; yeaC=DateCSY__M;
       SetTime(houC, minC, secC);
       SetDate(yeaC, monC, dayC); Message(12); TMDTSet__M=0;
    }
    //-----------------------------------------------------------------------
    // Передача номера текущего сообщения
    if (FirstCall>PAMSG){
       if (CurMESSAGE!=nMESSAGE){ CurMESSAGE=nMESSAGE; }
    } else {
       MessageCLS();
    }
    //-----------------------------------------------------------------------
    // Если передан флаг выхода из программы
    if (ExitFlag_M>0){ ExitForLoad=ExitFlag_M; ExitFlag_M=0; }
    //-----------------------------------------------------------------------
    // Установка значений переданных оператором (из верхнего уровня)
    SetVal();
    //-----------------------------------------------------------------------
    // Выбор рецепта загрузки
    DefRecept();
    //-----------------------------------------------------------------------
    // Включение-выключение сообщений и звонка для парамметров
    Reg_ZvMs();
    //-----------------------------------------------------------------------
    // Выключение исполнителей при смене работы режима ключей
    AutoManM();
    //-----------------------------------------------------------------------
    // Переключение флагов включения приборов дозаторов в очередь опроса:
    // Дозатор сухого
    if(DZT01ON__M==SWITCH){
       DZT01ON__V=(DZT01ON__V==ON) then_ OFF else_ ON; DZT01ON__M=OFF;
       if(DZT01ON__V==OFF){
          SetMODC(COMU2,      0,        0,             "",       0,  0);
          Message(92);
       } else {
          SetMODC(COMU2,      0,        1,        "#\01W",       3,  1);
          Message(91); COM2ER01FL=OFF;
       }
    }
    // Дозатор мокрого
    if(DZT02ON__M==SWITCH){
       DZT02ON__V=(DZT02ON__V==ON) then_ OFF else_ ON; DZT02ON__M=OFF;
       if(DZT02ON__V==OFF){
          SetMODC(COMU2,      1,        0,             "",       0,  0);
          Message(94);
       } else {
          SetMODC(COMU2,      1,        1,        "#\02W",       3,  1);
          Message(93); COM2ER02FL=OFF;
       }
    }
    // Дозатор пасты
    if(DZT03ON__M==SWITCH){
       DZT03ON__V=(DZT03ON__V==ON) then_ OFF else_ ON; DZT03ON__M=OFF;
       if(DZT03ON__V==OFF){
          SetMODC(COMU2,      2,        0,             "",       0,  0);
          Message(96);
       } else {
          SetMODC(COMU2,      2,        1,        "#\03W",       3,  1);
          Message(95); COM2ER03FL=OFF;
       }
    }
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
