//---------------------------------------------------------------------------
//  coding=cp866; version=2013013112; title="";
vd  far EveryCyc(vd){
    // читать ответы от модулей УСО
    if(RunLocal>0){ ReadANS(COMU1); ReadANS(COMU2); }
    // послать комманды запросов на модули УСО
    if(BusyTer==0){ SendCMD(COMU1); SendCMD(COMU2); }
    return;
}
//---------------------------------------------------------------------------
vd  far First_in_Cycle(vd){
    WS_NB__NetChange(); 
    return;
}
//---------------------------------------------------------------------------
vd  far Last__in_Cycle(vd){
    return;
}
//---------------------------------------------------------------------------
