//----------------------------------------------------------------------------
//  coding=cp866; version=2013013112; title="";
//  Получить значения с дискретных модулей
vd  far InpDataD(vd){

    Mod_DI();

    DIH252A__V = BFiltr(11, DIH252A__V, 10);        // Аварийный уровень дозатора мокрого
    DIS056G__V = BFiltr(12, DIS056G__V, 10);        // Аварийный уровень меш1 обр шлама
    DIS057G__V = BFiltr(14, DIS057G__V, 10);        // Аварийный уровень меш2 обр шлама
    DIS064G__V = BFiltr(15, DIS064G__V, 10);        // Аварийный уровень меш1 шлама
    DIS065G__V = BFiltr(16, DIS065G__V, 10);        // Аварийный уровень меш2 шлама

    return;
}
//----------------------------------------------------------------------------
