//----------------------------------------------------------------------------
//  coding=cp866; version=2013013112; title="";
//  Установить значения на каналах дискретных модулей
vd  far OutDataD(vd){

    // Блокировка регуляторов
    ModeKO_01();
    ModeKO_02();
    ModeKO_03();
    ModeKO_04();
    ModeKO_05();
    ModeKO_06c();
    ModeKO_06v();
    ModeKO_07();
    ModeKO_08();
    ModeKO_09();
    ModeKO_14();

    // Выход на модули
    Mod_DO();

    return;
}
//----------------------------------------------------------------------------
