//---------------------------------------------------------------------------
//  coding=cp866; version=2013013112; title="";
//  Обновление значений каждый тик системы
vd  far UpdDataT(vd){

    //-----------------------------------------------------------------------
    // Задание оператором текущего шага регулятора
    SetStepReg();
    //-----------------------------------------------------------------------

    //-----------------------------------------------------------------------
    // Вызов подпрограмм регуляторов
    if( (Timer(1,18,1))==2 ){ RegRUN=ON; }
    Regul_up();
    Regul_01();
    Regul_02();
    Regul_03();
    Regul_04();
    Regul_05();
    Regul_06c();
    Regul_06v();
    Regul_07();
    Regul_07v();
    Regul_08();
    Regul_09();
    Regul_11();
    Regul_12();
    Regul_14();
    Regul_55();
    Signal();
    RegRUN=OFF;
    //-----------------------------------------------------------------------

    //-----------------------------------------------------------------------
    // Контроль обмена по сети NetBIOS
    if(NBLive___M >0){
       NBLive___M =0; NBLive___V++; if(NBLive___V>8){ NBLive___V=1; }
       NBLiveTO_V =0; NBLF=1;CPLF=0;
    }
    NBLiveTO_V++; if(NBLiveTO_V>100){ NBLiveTO_V=100; }
    //-----------------------------------------------------------------------
    // Передача переменных циклов работы программы контроллера
    TickLoop_V=TLoop;
    SecnLoop_V=SLoop;
    //-----------------------------------------------------------------------
    // Запись данных на диск
    if (WriteDataM>0){ WriteDataM=0; WriteData(0); Message(3,NOKV); }
    //-----------------------------------------------------------------------
    // Проверка флага звонка
    if (Bell(1,2)>0){ ErrBell__V=1; DON090___V=1; }
    // сброс флага звонка
    if (ErrBell__M>0){ Bell(1,0); ErrBell__V=0; ErrBell__M=0; DON090___V=0; }
    //-----------------------------------------------------------------------
    // Вывод и установка времени и даты
    TimeCSS__V=secC; TimeCSM__V=minC; TimeCSH__V=houC;
    DateCSD__V=dayC; DateCSM__V=monC; DateCSY__V=yeaC;
    if(TMDTSet__M>0){
       secC=TimeCSS__M; minC=TimeCSM__M; houC=TimeCSH__M;
       dayC=DateCSD__M; monC=DateCSM__M; yeaC=DateCSY__M;
       SetTime(houC, minC, secC);
       SetDate(yeaC, monC, dayC); Message(12,NOKV); TMDTSet__M=0;
    }
    //-----------------------------------------------------------------------
    // Передача номера текущего сообщения
    if (FirstCall>PAMSG){
       if (CurMESSAGE!=nMESSAGE){ CurMESSAGE=nMESSAGE; }
    } else {
       MessageCLS();
    }
    //-----------------------------------------------------------------------
    // Если передан флаг выхода из программы
    if (ExitFlag_M>0){ ExitForLoad=ExitFlag_M; ExitFlag_M=0; }
    //-----------------------------------------------------------------------
    // Установка значений переданных оператором (из верхнего уровня)
    SetVal();
    //-----------------------------------------------------------------------
    // Выбор рецепта загрузки
    DefRecept();
    //-----------------------------------------------------------------------
    // Включение-выключение сообщений и звонка для парамметров, блокировки
    Reg_ZvMs();
    //-----------------------------------------------------------------------
    // Выключение исполнителей при смене работы режима ключей
    AutoManM();
    //-----------------------------------------------------------------------

    return;
}
//---------------------------------------------------------------------------
