//----------------------------------------------------------------------------
//  coding=cp866; version=2013013112; title="";
//  Обновление значений каждую секунду
vd  far UpdDataS(vd){

    //-----------------------------------------------------------------------
    // Установка переменной, отображающей работоспособность сети
    NetLive__V++; if(NetLive__V>8){ NetLive__V=0; }
    //------------------------------------------------------------------------
    // флаг работы контроллера
    M0BC12___V = (M0BC12___V == OFF) then_ ON else_ OFF;
    //------------------------------------------------------------------------
    // проверка сработки исполнителей (oth\ispolnit.c)
    CheckIsp();
    //------------------------------------------------------------------------
    // контроль включения мешалок
    Meshalki();
    //------------------------------------------------------------------------

    return;
}
//----------------------------------------------------------------------------
