//---------------------------------------------------------------------------
#include <stdlib.h>
#include <stdio.h>
#include <io.h>
#include <dos.h>
#include <bios.h>
#include <conio.h>
#include <errno.h>
#include <time.h>
#include <string.h>
#include <process.h>
#include <signal.h>
#include <setjmp.h>
#include <float.h>
#include <mem.h>
#include <alloc.h>
#include <math.h>
#include <fcntl.h>
#include <ctype.h>
#include <sys\stat.h>
#include <dir.h>

//---------------------------------------------------------------------------
typedef unsigned        _u;
typedef unsigned char   uc;
typedef unsigned short  us;
typedef unsigned int    ui;
typedef unsigned long   ul;
typedef char            _c;
typedef short           _s;
typedef int             _i;
typedef long            _l;
typedef float           _f;
typedef double          db;
typedef void            vd;
typedef FILE            FL;

#define   ex            extern
#define   NO            0
#define   YES           1
#define   OFF           0
#define   ON            1
#define   MANUAL        0
#define   AUTO          1
#define   SWITCH        5
#define   AND           &&
#define   and           &&
#define   OR            ||
#define   or            ||
#define   THEN_         ?
#define   then_         ?
#define   ELSE_         :
#define   else_         :
#define   END           2
#define   RUN           1
#define   BAD           0
#define   VAG           0
#define   SEC           1
#define   MIN           60
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
#define  NVMAX          60
//  Максимальное кол-во переменных для усреднения значений AISet()
//---------------------------------------------------------------------------
#define  CVMAX          20
//  Максимальное кол-во ячеек для подсчета среднего значения
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  ANALOG         0
#define  IMPULS         1
//  Тип счетчиков усреднения
//---------------------------------------------------------------------------
#define  MAXAV          20
//  Максимальное количество счетчиков усреднения AAverRun()
//---------------------------------------------------------------------------
#define  MAXAA         (MAXAV*2)
//  макс кол-во значений усреднений
#define  MAXCL          60                
//  макс кол-во ячеек в массивах усреднений
#define  SMNHOW         5
//  макс кол-во возможных смен
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
#define  MBS            30
//  Размер буфера сообщений
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  MAXDBB         4000
#define  SIZDBB        (MAXDBB*4)
//  Максимальное количество элементов массива обмена
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  MAXSTRE        79
//  Максимальная длинна строки экрана
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  LCMD           20
//  Максимальная длинна посылаемой строки комманды
//---------------------------------------------------------------------------
#define  LANS           60
//  Максимальная длинна ответа
//---------------------------------------------------------------------------
#define  MCF            30
//  Максимальное количество записей модулей УСО
//---------------------------------------------------------------------------
#define  MVAL           14
//  Максимальное количество переменных в ответе от модуля
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//  Максимальное количество портов + 1
#define  MCOM           5
//---------------------------------------------------------------------------
#define  RBFSZ          512
//  Размер буфера чтения данных из COM порта
//---------------------------------------------------------------------------
#define  NOU            0
#define  USO            1
#define  WST            2
//  Признак назначения порта (для обмена с УСО или рабочей станцией (WST))
//---------------------------------------------------------------------------
#define  COM1     1
#define  COM2     2
#define  COM3     3
#define  COM4     4
//  Номера COM портов
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  MaxTT          40
//  Максимальное кол-во таймеров программы пользователя
#define  MAXCNTTO       200
//  Максимальное кол-во счетчиков таймаута
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  HFI            70
//  Количество элементов массива фильтрации DI сигналов
//---------------------------------------------------------------------------
#define  MDI            10
//  Количество ячеек фильтрации DI сигналов в одном элементе
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  LNAM           16
//  Количество символов в имени станции для NBW
//---------------------------------------------------------------------------
#define  MNCB           8
//  Максимальное кол-во NCB
//---------------------------------------------------------------------------
#define  LNCB           504
//  Длинна посылаемого NCB в байтах
//---------------------------------------------------------------------------
#define  C250           250
#define  C124           124
#define  C080           80
#define  C020           20
#define  C002           2
//  Длины массивов
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  NREGUL         20
//  Максимальное кол-во регуляторов в программе
//---------------------------------------------------------------------------
#define  RNA           -1
#define  RMINUS         0
#define  RSTOP          1
#define  RPLUS          2
//  Значения дискретного выхода регулятора
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  u5648count 5
//  Максимальное количество плат 5648
#define  BegC   0
#define  EndC   7
#define  BegA   8
#define  EndA  15
#define  BegB  16
#define  EndB  24
//  Определение номеров каналов для портов
#define  pA 0
#define  pB 1
#define  pC 2
//  Порядок портов Port A,B,C
//---------------------------------------------------------------------------
#define  u5700count 5
//  Максимальное количество плат 5700
//---------------------------------------------------------------------------
#define  u5750count 5
//  Максимальное количество плат 5750
//---------------------------------------------------------------------------
#define  TICKS_in_CYCLE    18
//  Количество тиков в цикле
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define  MINCKVAL   -100
#define  MAXCKVAL    9000000000
//  Минимал-Максимал значения проверки границ переменных
//---------------------------------------------------------------------------
#define  MNOCHECK    10
//  Количество переменных не подлежащих проверке
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
#define   VAGSLEN     30
//---------------------------------------------------------------------------
