//----------------------------------------------------------------------------
//  COM1, 7033, N01

    rec=0;

    // Значения НУЛЯ и ДИАПАЗОНА по умолчанию, если они не заданы
    if(AIT050_SDV<=0){ AIT050_SDV=100; AIT050_SZV=0; }
    if(AIT040_SDV<=0){ AIT040_SDV=100; AIT040_SZV=0; }
    if(AIT030_SDV<=0){ AIT030_SDV=100; AIT030_SZV=0; }

    // Получить преобразованные значения с каналов модуля
    AIT050___V=AISet( 0,GetMODV(COMU1,rec,0),0,32768,0,AIT050_SDV,AIT050__AV,AIT050__FV)+AIT050_SZV;
    AIT040___V=AISet( 1,GetMODV(COMU1,rec,1),0,32768,0,AIT040_SDV,AIT040__AV,AIT040__FV)+AIT040_SZV;
    AIT030___V=AISet( 2,GetMODV(COMU1,rec,2),0,32768,0,AIT030_SDV,AIT030__AV,AIT030__FV)+AIT030_SZV;

//----------------------------------------------------------------------------
