//----------------------------------------------------------------------------
//  COM1, 7033, N02

    rec=1;

    // Значения НУЛЯ и ДИАПАЗОНА по умолчанию, если они не заданы
    if(AIT220_SDV<=0){ AIT220_SDV=100; AIT220_SZV=0; }
    if(AIT270_SDV<=0){ AIT270_SDV=100; AIT270_SZV=0; }
    if(AIT200_SDV<=0){ AIT200_SDV=100; AIT200_SZV=0; }

    // Получить преобразованные значения с каналов модуля
    AIT220___V=AISet( 3,GetMODV(COMU1,rec,0),0,32768,0,AIT220_SDV,AIT220__AV,AIT220__FV)+AIT220_SZV;
    AIT270___V=AISet( 4,GetMODV(COMU1,rec,1),0,32768,0,AIT270_SDV,AIT270__AV,AIT270__FV)+AIT270_SZV;
    AIT200___V=AISet( 5,GetMODV(COMU1,rec,2),0,32768,0,AIT200_SDV,AIT200__AV,AIT200__FV)+AIT200_SZV;

//----------------------------------------------------------------------------
