//----------------------------------------------------------------------------
//  COM2, тензометрические приборы ТП-001(ВАГИ), N01

    rec=0;
    // дозатор сухого
    AIW190___V=AISet( 6,GetMODV(COMU2,rec,0),0,100,0,AIW190_SDV,AIW190__AV,AIW190__FV)+AIW190_SZV;
    rec=1;
    // дозатор мокрого
    AIW230___V=AISet( 7,GetMODV(COMU2,rec,0),0,100,0,AIW230_SDV,AIW230__AV,AIW230__FV)+AIW230_SZV;
    rec=2;
    // дозатор пасты
    AIW290___V=AISet( 8,GetMODV(COMU2,rec,0),0,100,0,AIW290_SDV,AIW290__AV,AIW290__FV)+AIW290_SZV;

//----------------------------------------------------------------------------
